; ModuleID = 'programs_new/Python-new/memoryobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !418, globals: !1444)
!1 = !DIFile(filename: "memoryobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !350, !52, !369, !94, !383, !384, !386, !387, !388, !79, !396, !44, !17, !96, !385, !77, !341, !397, !398, !11, !399, !382, !400, !401, !409}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemoryViewObject", file: !345, line: 68, baseType: !346)
!345 = !DIFile(filename: "Include/memoryobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 58, size: 1280, align: 64, elements: !347)
!347 = !{!348, !349, !358, !359, !360, !361, !362, !366, !367}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 59, baseType: !23, size: 192, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mbuf", scope: !346, file: !345, line: 60, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyManagedBufferObject", file: !345, line: 45, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 40, size: 896, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !352, file: !345, line: 41, baseType: !6, size: 128, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !345, line: 42, baseType: !44, size: 32, align: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exports", scope: !352, file: !345, line: 43, baseType: !11, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !352, file: !345, line: 44, baseType: !236, size: 640, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !346, file: !345, line: 61, baseType: !218, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !345, line: 62, baseType: !44, size: 32, align: 32, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "exports", scope: !346, file: !345, line: 63, baseType: !11, size: 64, align: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !346, file: !345, line: 64, baseType: !236, size: 640, align: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !346, file: !345, line: 65, baseType: !363, size: 24, align: 8, offset: 1088)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 8, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 3)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !346, file: !345, line: 66, baseType: !5, size: 64, align: 64, offset: 1152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_array", scope: !346, file: !345, line: 67, baseType: !368, size: 64, align: 64, offset: 1216)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 64, elements: !82)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !371, line: 253, baseType: !372)
!371 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!372 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !371, line: 246, size: 192, align: 64, elements: !373)
!373 = !{!374, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !372, file: !371, line: 251, baseType: !375, size: 192, align: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !372, file: !371, line: 247, size: 192, align: 64, elements: !376)
!376 = !{!377, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !375, file: !371, line: 248, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !375, file: !371, line: 249, baseType: !378, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !375, file: !371, line: 250, baseType: !11, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !372, file: !371, line: 252, baseType: !382, size: 64, align: 64)
!382 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !390, line: 33, baseType: !391)
!390 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 25, size: 256, align: 64, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !391, file: !390, line: 26, baseType: !23, size: 192, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !391, file: !390, line: 27, baseType: !395, size: 64, align: 64, offset: 192)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!396 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!397 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!398 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!399 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!400 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !403, line: 41, baseType: !404)
!403 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 31, size: 320, align: 64, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 32, baseType: !23, size: 192, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !404, file: !403, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !404, file: !403, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !411, line: 40, baseType: !412)
!411 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 23, size: 320, align: 64, elements: !413)
!413 = !{!414, !415, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !411, line: 24, baseType: !23, size: 192, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !412, file: !411, line: 26, baseType: !416, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !412, file: !411, line: 39, baseType: !11, size: 64, align: 64, offset: 256)
!418 = !{!419, !432, !441, !453, !473, !489, !494, !499, !510, !515, !522, !532, !540, !547, !555, !578, !587, !596, !602, !606, !613, !619, !629, !634, !638, !660, !687, !693, !698, !703, !713, !724, !729, !734, !739, !750, !756, !764, !808, !830, !844, !849, !858, !878, !927, !936, !945, !954, !963, !970, !979, !984, !987, !990, !995, !1006, !1013, !1022, !1028, !1039, !1048, !1071, !1099, !1104, !1107, !1160, !1179, !1191, !1212, !1234, !1251, !1255, !1265, !1271, !1291, !1312, !1325, !1330, !1344, !1355, !1370, !1374, !1378, !1382, !1385, !1388, !1391, !1394, !1397, !1400, !1416, !1419, !1422, !1426, !1430, !1434}
!419 = !DISubprogram(name: "PyMemoryView_FromMemory", scope: !420, file: !420, line: 719, type: !421, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i32)* @PyMemoryView_FromMemory, variables: !423)
!420 = !DIFile(filename: "Objects/memoryobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!421 = !DISubroutineType(types: !422)
!422 = !{!5, !52, !11, !44}
!423 = !{!424, !425, !426, !427, !428, !429, !430}
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 1, scope: !419, file: !420, line: 719, type: !52)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !419, file: !420, line: 719, type: !11)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !419, file: !420, line: 719, type: !44)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !419, file: !420, line: 721, type: !350)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !419, file: !420, line: 722, type: !5)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readonly", scope: !419, file: !420, line: 723, type: !44)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !431, file: !420, line: 737, type: !5)
!431 = distinct !DILexicalBlock(scope: !419, file: !420, line: 737, column: 8)
!432 = !DISubprogram(name: "PyMemoryView_FromBuffer", scope: !420, file: !420, line: 748, type: !433, isLocal: false, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.bufferinfo*)* @PyMemoryView_FromBuffer, variables: !435)
!433 = !DISubroutineType(types: !434)
!434 = !{!5, !235}
!435 = !{!436, !437, !438, !439}
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !432, file: !420, line: 748, type: !235)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !432, file: !420, line: 750, type: !350)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !432, file: !420, line: 751, type: !5)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !440, file: !420, line: 769, type: !5)
!440 = distinct !DILexicalBlock(scope: !432, file: !420, line: 769, column: 8)
!441 = !DISubprogram(name: "PyMemoryView_FromObject", scope: !420, file: !420, line: 778, type: !116, isLocal: false, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyMemoryView_FromObject, variables: !442)
!442 = !{!443, !444, !445, !448, !451}
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !441, file: !420, line: 778, type: !5)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !441, file: !420, line: 780, type: !350)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !446, file: !420, line: 783, type: !343)
!446 = distinct !DILexicalBlock(scope: !447, file: !420, line: 782, column: 62)
!447 = distinct !DILexicalBlock(scope: !441, file: !420, line: 782, column: 9)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !449, file: !420, line: 788, type: !5)
!449 = distinct !DILexicalBlock(scope: !450, file: !420, line: 787, column: 120)
!450 = distinct !DILexicalBlock(scope: !447, file: !420, line: 787, column: 14)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !452, file: !420, line: 793, type: !5)
!452 = distinct !DILexicalBlock(scope: !449, file: !420, line: 793, column: 12)
!453 = !DISubprogram(name: "PyMemoryView_GetContiguous", scope: !420, file: !420, line: 910, type: !454, isLocal: false, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32, i8)* @PyMemoryView_GetContiguous, variables: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!5, !5, !44, !31}
!456 = !{!457, !458, !459, !460, !461, !462, !463, !467, !471}
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !453, file: !420, line: 910, type: !5)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffertype", arg: 2, scope: !453, file: !420, line: 910, type: !44)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 3, scope: !453, file: !420, line: 910, type: !31)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !453, file: !420, line: 912, type: !343)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !453, file: !420, line: 913, type: !5)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !453, file: !420, line: 914, type: !235)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !420, line: 927, type: !5)
!464 = distinct !DILexicalBlock(scope: !465, file: !420, line: 927, column: 12)
!465 = distinct !DILexicalBlock(scope: !466, file: !420, line: 924, column: 48)
!466 = distinct !DILexicalBlock(scope: !453, file: !420, line: 924, column: 9)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !420, line: 938, type: !5)
!468 = distinct !DILexicalBlock(scope: !469, file: !420, line: 938, column: 12)
!469 = distinct !DILexicalBlock(scope: !470, file: !420, line: 934, column: 30)
!470 = distinct !DILexicalBlock(scope: !453, file: !420, line: 934, column: 9)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !472, file: !420, line: 943, type: !5)
!472 = distinct !DILexicalBlock(scope: !453, file: !420, line: 943, column: 8)
!473 = !DISubprogram(name: "PyBuffer_ToContiguous", scope: !420, file: !420, line: 973, type: !474, isLocal: false, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.bufferinfo*, i64, i8)* @PyBuffer_ToContiguous, variables: !476)
!474 = !DISubroutineType(types: !475)
!475 = !{!44, !4, !235, !11, !31}
!476 = !{!477, !478, !479, !480, !481, !488}
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !473, file: !420, line: 973, type: !4)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !473, file: !420, line: 973, type: !235)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !473, file: !420, line: 973, type: !11)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 4, scope: !473, file: !420, line: 973, type: !31)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fb", scope: !473, file: !420, line: 975, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer_full", file: !420, line: 970, baseType: !484)
!484 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 967, size: 704, align: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !484, file: !420, line: 968, baseType: !236, size: 640, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !484, file: !420, line: 969, baseType: !368, size: 64, align: 64, offset: 640)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !473, file: !420, line: 976, type: !44)
!489 = !DISubprogram(name: "mbuf_dealloc", scope: !420, file: !420, line: 113, type: !490, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyManagedBufferObject*)* @mbuf_dealloc, variables: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !350}
!492 = !{!493}
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !489, file: !420, line: 113, type: !350)
!494 = !DISubprogram(name: "mbuf_release", scope: !420, file: !420, line: 98, type: !490, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyManagedBufferObject*)* @mbuf_release, variables: !495)
!495 = !{!496, !497}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !494, file: !420, line: 98, type: !350)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !498, file: !420, line: 108, type: !369)
!498 = distinct !DILexicalBlock(scope: !494, file: !420, line: 108, column: 8)
!499 = !DISubprogram(name: "mbuf_traverse", scope: !420, file: !420, line: 123, type: !500, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyManagedBufferObject*, i32 (%struct._object*, i8*)*, i8*)* @mbuf_traverse, variables: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{!44, !350, !263, !4}
!502 = !{!503, !504, !505, !506}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !499, file: !420, line: 123, type: !350)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !499, file: !420, line: 123, type: !263)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !499, file: !420, line: 123, type: !4)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !507, file: !420, line: 125, type: !44)
!507 = distinct !DILexicalBlock(scope: !508, file: !420, line: 125, column: 32)
!508 = distinct !DILexicalBlock(scope: !509, file: !420, line: 125, column: 14)
!509 = distinct !DILexicalBlock(scope: !499, file: !420, line: 125, column: 8)
!510 = !DISubprogram(name: "mbuf_clear", scope: !420, file: !420, line: 130, type: !511, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyManagedBufferObject*)* @mbuf_clear, variables: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!44, !350}
!513 = !{!514}
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !510, file: !420, line: 130, type: !350)
!515 = !DISubprogram(name: "mbuf_alloc", scope: !420, file: !420, line: 63, type: !516, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: %struct._PyManagedBufferObject* ()* @mbuf_alloc, variables: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!350}
!518 = !{!519, !520}
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !515, file: !420, line: 65, type: !350)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !521, file: !420, line: 74, type: !369)
!521 = distinct !DILexicalBlock(scope: !515, file: !420, line: 74, column: 8)
!522 = !DISubprogram(name: "mbuf_add_view", scope: !420, file: !420, line: 652, type: !523, isLocal: true, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyManagedBufferObject*, %struct.bufferinfo*)* @mbuf_add_view, variables: !527)
!523 = !DISubroutineType(types: !524)
!524 = !{!5, !350, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!527 = !{!528, !529, !530, !531}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbuf", arg: 1, scope: !522, file: !420, line: 652, type: !350)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !522, file: !420, line: 652, type: !525)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !522, file: !420, line: 654, type: !343)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !522, file: !420, line: 655, type: !235)
!532 = !DISubprogram(name: "memory_alloc", scope: !420, file: !420, line: 620, type: !533, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyMemoryViewObject* (i32)* @memory_alloc, variables: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!343, !44}
!535 = !{!536, !537, !538}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 1, scope: !532, file: !420, line: 620, type: !44)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !532, file: !420, line: 622, type: !343)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !539, file: !420, line: 639, type: !369)
!539 = distinct !DILexicalBlock(scope: !532, file: !420, line: 639, column: 8)
!540 = !DISubprogram(name: "init_flags", scope: !420, file: !420, line: 587, type: !541, isLocal: true, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyMemoryViewObject*)* @init_flags, variables: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !343}
!543 = !{!544, !545, !546}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv", arg: 1, scope: !540, file: !420, line: 587, type: !343)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !540, file: !420, line: 589, type: !525)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !540, file: !420, line: 590, type: !44)
!547 = !DISubprogram(name: "_PyManagedBuffer_FromObject", scope: !420, file: !420, line: 80, type: !116, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @_PyManagedBuffer_FromObject, variables: !548)
!548 = !{!549, !550, !551}
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !547, file: !420, line: 80, type: !5)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !547, file: !420, line: 82, type: !350)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !552, file: !420, line: 90, type: !5)
!552 = distinct !DILexicalBlock(scope: !553, file: !420, line: 90, column: 12)
!553 = distinct !DILexicalBlock(scope: !554, file: !420, line: 88, column: 95)
!554 = distinct !DILexicalBlock(scope: !547, file: !420, line: 88, column: 9)
!555 = !DISubprogram(name: "memory_from_contiguous_copy", scope: !420, file: !420, line: 833, type: !556, isLocal: true, isDefinition: true, scopeLine: 834, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.bufferinfo*, i8)* @memory_from_contiguous_copy, variables: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{!5, !235, !31}
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !568, !572, !574}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !555, file: !420, line: 833, type: !235)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !555, file: !420, line: 833, type: !31)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !555, file: !420, line: 835, type: !350)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !555, file: !420, line: 836, type: !343)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !555, file: !420, line: 837, type: !5)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !555, file: !420, line: 838, type: !235)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !555, file: !420, line: 839, type: !44)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !567, file: !420, line: 849, type: !5)
!567 = distinct !DILexicalBlock(scope: !555, file: !420, line: 849, column: 8)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !420, line: 854, type: !5)
!569 = distinct !DILexicalBlock(scope: !570, file: !420, line: 854, column: 12)
!570 = distinct !DILexicalBlock(scope: !571, file: !420, line: 853, column: 50)
!571 = distinct !DILexicalBlock(scope: !555, file: !420, line: 853, column: 9)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !573, file: !420, line: 859, type: !5)
!573 = distinct !DILexicalBlock(scope: !555, file: !420, line: 859, column: 8)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !420, line: 885, type: !5)
!575 = distinct !DILexicalBlock(scope: !576, file: !420, line: 885, column: 12)
!576 = distinct !DILexicalBlock(scope: !577, file: !420, line: 884, column: 37)
!577 = distinct !DILexicalBlock(scope: !555, file: !420, line: 884, column: 9)
!578 = !DISubprogram(name: "mbuf_copy_format", scope: !420, file: !420, line: 805, type: !579, isLocal: true, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyManagedBufferObject*, i8*)* @mbuf_copy_format, variables: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{!44, !350, !29}
!581 = !{!582, !583, !584}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbuf", arg: 1, scope: !578, file: !420, line: 805, type: !350)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !578, file: !420, line: 805, type: !29)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !585, file: !420, line: 808, type: !52)
!585 = distinct !DILexicalBlock(scope: !586, file: !420, line: 807, column: 28)
!586 = distinct !DILexicalBlock(scope: !578, file: !420, line: 807, column: 9)
!587 = !DISubprogram(name: "mbuf_add_incomplete_view", scope: !420, file: !420, line: 690, type: !588, isLocal: true, isDefinition: true, scopeLine: 692, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyManagedBufferObject*, %struct.bufferinfo*, i32)* @mbuf_add_incomplete_view, variables: !590)
!588 = !DISubroutineType(types: !589)
!589 = !{!5, !350, !525, !44}
!590 = !{!591, !592, !593, !594, !595}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbuf", arg: 1, scope: !587, file: !420, line: 690, type: !350)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !587, file: !420, line: 690, type: !525)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 3, scope: !587, file: !420, line: 691, type: !44)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !587, file: !420, line: 693, type: !343)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !587, file: !420, line: 694, type: !235)
!596 = !DISubprogram(name: "init_strides_from_shape", scope: !420, file: !420, line: 444, type: !597, isLocal: true, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*)* @init_strides_from_shape, variables: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !235}
!599 = !{!600, !601}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !596, file: !420, line: 444, type: !235)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !596, file: !420, line: 446, type: !11)
!602 = !DISubprogram(name: "init_fortran_strides_from_shape", scope: !420, file: !420, line: 457, type: !597, isLocal: true, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*)* @init_fortran_strides_from_shape, variables: !603)
!603 = !{!604, !605}
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !602, file: !420, line: 457, type: !235)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !602, file: !420, line: 459, type: !11)
!606 = !DISubprogram(name: "copy_buffer", scope: !420, file: !420, line: 414, type: !607, isLocal: true, isDefinition: true, scopeLine: 415, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @copy_buffer, variables: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{!44, !235, !235}
!609 = !{!610, !611, !612}
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !606, file: !420, line: 414, type: !235)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !606, file: !420, line: 414, type: !235)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mem", scope: !606, file: !420, line: 416, type: !52)
!613 = !DISubprogram(name: "equiv_structure", scope: !420, file: !420, line: 305, type: !614, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @equiv_structure, variables: !616)
!614 = !DISubroutineType(types: !615)
!615 = !{!44, !525, !525}
!616 = !{!617, !618}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !613, file: !420, line: 305, type: !525)
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !613, file: !420, line: 305, type: !525)
!619 = !DISubprogram(name: "equiv_format", scope: !420, file: !420, line: 265, type: !614, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @equiv_format, variables: !620)
!620 = !{!621, !622, !623, !624, !625, !628}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !619, file: !420, line: 265, type: !525)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !619, file: !420, line: 265, type: !525)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dfmt", scope: !619, file: !420, line: 267, type: !29)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sfmt", scope: !619, file: !420, line: 267, type: !29)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !626, file: !420, line: 273, type: !94)
!626 = distinct !DILexicalBlock(scope: !627, file: !420, line: 273, column: 24)
!627 = distinct !DILexicalBlock(scope: !619, file: !420, line: 273, column: 9)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !626, file: !420, line: 273, type: !94)
!629 = !DISubprogram(name: "equiv_shape", scope: !420, file: !420, line: 285, type: !614, isLocal: true, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @equiv_shape, variables: !630)
!630 = !{!631, !632, !633}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !629, file: !420, line: 285, type: !525)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !629, file: !420, line: 285, type: !525)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !629, file: !420, line: 287, type: !44)
!634 = !DISubprogram(name: "last_dim_is_contiguous", scope: !420, file: !420, line: 249, type: !614, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @last_dim_is_contiguous, variables: !635)
!635 = !{!636, !637}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !634, file: !420, line: 249, type: !525)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !634, file: !420, line: 249, type: !525)
!638 = !DISubprogram(name: "copy_rec", scope: !420, file: !420, line: 352, type: !639, isLocal: true, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (i64*, i64, i64, i8*, i64*, i64*, i8*, i64*, i64*, i8*)* @copy_rec, variables: !643)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641, !11, !11, !52, !641, !641, !52, !641, !641, !52}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !659}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 1, scope: !638, file: !420, line: 352, type: !641)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 2, scope: !638, file: !420, line: 352, type: !11)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 3, scope: !638, file: !420, line: 352, type: !11)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dptr", arg: 4, scope: !638, file: !420, line: 353, type: !52)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstrides", arg: 5, scope: !638, file: !420, line: 353, type: !641)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsuboffsets", arg: 6, scope: !638, file: !420, line: 353, type: !641)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sptr", arg: 7, scope: !638, file: !420, line: 354, type: !52)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sstrides", arg: 8, scope: !638, file: !420, line: 354, type: !641)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssuboffsets", arg: 9, scope: !638, file: !420, line: 354, type: !641)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 10, scope: !638, file: !420, line: 355, type: !52)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !638, file: !420, line: 357, type: !11)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdptr", scope: !656, file: !420, line: 370, type: !52)
!656 = distinct !DILexicalBlock(scope: !657, file: !420, line: 369, column: 74)
!657 = distinct !DILexicalBlock(scope: !658, file: !420, line: 369, column: 5)
!658 = distinct !DILexicalBlock(scope: !638, file: !420, line: 369, column: 5)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsptr", scope: !656, file: !420, line: 371, type: !52)
!660 = !DISubprogram(name: "copy_base", scope: !420, file: !420, line: 322, type: !661, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: void (i64*, i64, i8*, i64*, i64*, i8*, i64*, i64*, i8*)* @copy_base, variables: !663)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !641, !11, !52, !641, !641, !52, !641, !641, !52}
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !676, !678, !679, !683}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 1, scope: !660, file: !420, line: 322, type: !641)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 2, scope: !660, file: !420, line: 322, type: !11)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dptr", arg: 3, scope: !660, file: !420, line: 323, type: !52)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstrides", arg: 4, scope: !660, file: !420, line: 323, type: !641)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsuboffsets", arg: 5, scope: !660, file: !420, line: 323, type: !641)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sptr", arg: 6, scope: !660, file: !420, line: 324, type: !52)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sstrides", arg: 7, scope: !660, file: !420, line: 324, type: !641)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssuboffsets", arg: 8, scope: !660, file: !420, line: 324, type: !641)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 9, scope: !660, file: !420, line: 325, type: !52)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !674, file: !420, line: 328, type: !11)
!674 = distinct !DILexicalBlock(scope: !675, file: !420, line: 327, column: 28)
!675 = distinct !DILexicalBlock(scope: !660, file: !420, line: 327, column: 9)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !677, file: !420, line: 335, type: !52)
!677 = distinct !DILexicalBlock(scope: !675, file: !420, line: 334, column: 10)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !677, file: !420, line: 336, type: !11)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsptr", scope: !680, file: !420, line: 338, type: !52)
!680 = distinct !DILexicalBlock(scope: !681, file: !420, line: 337, column: 77)
!681 = distinct !DILexicalBlock(scope: !682, file: !420, line: 337, column: 9)
!682 = distinct !DILexicalBlock(scope: !677, file: !420, line: 337, column: 9)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdptr", scope: !684, file: !420, line: 342, type: !52)
!684 = distinct !DILexicalBlock(scope: !685, file: !420, line: 341, column: 77)
!685 = distinct !DILexicalBlock(scope: !686, file: !420, line: 341, column: 9)
!686 = distinct !DILexicalBlock(scope: !677, file: !420, line: 341, column: 9)
!687 = !DISubprogram(name: "init_shared_values", scope: !420, file: !420, line: 519, type: !688, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*, %struct.bufferinfo*)* @init_shared_values, variables: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !235, !525}
!690 = !{!691, !692}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !687, file: !420, line: 519, type: !235)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !687, file: !420, line: 519, type: !525)
!693 = !DISubprogram(name: "init_shape_strides", scope: !420, file: !420, line: 532, type: !688, isLocal: true, isDefinition: true, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*, %struct.bufferinfo*)* @init_shape_strides, variables: !694)
!694 = !{!695, !696, !697}
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !693, file: !420, line: 532, type: !235)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !693, file: !420, line: 532, type: !525)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !693, file: !420, line: 534, type: !11)
!698 = !DISubprogram(name: "init_suboffsets", scope: !420, file: !420, line: 559, type: !688, isLocal: true, isDefinition: true, scopeLine: 560, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*, %struct.bufferinfo*)* @init_suboffsets, variables: !699)
!699 = !{!700, !701, !702}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !698, file: !420, line: 559, type: !235)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !698, file: !420, line: 559, type: !525)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !698, file: !420, line: 561, type: !11)
!703 = !DISubprogram(name: "buffer_to_contiguous", scope: !420, file: !420, line: 472, type: !704, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.bufferinfo*, i8)* @buffer_to_contiguous, variables: !706)
!704 = !DISubroutineType(types: !705)
!705 = !{!44, !52, !235, !31}
!706 = !{!707, !708, !709, !710, !711, !712}
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 1, scope: !703, file: !420, line: 472, type: !52)
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !703, file: !420, line: 472, type: !235)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 3, scope: !703, file: !420, line: 472, type: !31)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !703, file: !420, line: 474, type: !236)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strides", scope: !703, file: !420, line: 475, type: !247)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !703, file: !420, line: 476, type: !44)
!713 = !DISubprogram(name: "memory_dealloc", scope: !420, file: !420, line: 1057, type: !541, isLocal: true, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyMemoryViewObject*)* @memory_dealloc, variables: !714)
!714 = !{!715, !716, !718, !720}
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !713, file: !420, line: 1057, type: !343)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !717, file: !420, line: 1060, type: !369)
!717 = distinct !DILexicalBlock(scope: !713, file: !420, line: 1060, column: 8)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !719, file: !420, line: 1062, type: !5)
!719 = distinct !DILexicalBlock(scope: !713, file: !420, line: 1062, column: 8)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !420, line: 1062, type: !5)
!721 = distinct !DILexicalBlock(scope: !722, file: !420, line: 1062, column: 115)
!722 = distinct !DILexicalBlock(scope: !723, file: !420, line: 1062, column: 83)
!723 = distinct !DILexicalBlock(scope: !719, file: !420, line: 1062, column: 60)
!724 = !DISubprogram(name: "_memory_release", scope: !420, file: !420, line: 1025, type: !725, isLocal: true, isDefinition: true, scopeLine: 1026, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyMemoryViewObject*)* @_memory_release, variables: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{!44, !343}
!727 = !{!728}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !724, file: !420, line: 1025, type: !343)
!729 = !DISubprogram(name: "memory_repr", scope: !420, file: !420, line: 2116, type: !730, isLocal: true, isDefinition: true, scopeLine: 2117, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemoryViewObject*)* @memory_repr, variables: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!5, !343}
!732 = !{!733}
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !729, file: !420, line: 2116, type: !343)
!734 = !DISubprogram(name: "memory_length", scope: !420, file: !420, line: 2390, type: !735, isLocal: true, isDefinition: true, scopeLine: 2391, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyMemoryViewObject*)* @memory_length, variables: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!11, !343}
!737 = !{!738}
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !734, file: !420, line: 2390, type: !343)
!739 = !DISubprogram(name: "memory_item", scope: !420, file: !420, line: 2160, type: !740, isLocal: true, isDefinition: true, scopeLine: 2161, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemoryViewObject*, i64)* @memory_item, variables: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{!5, !343, !11}
!742 = !{!743, !744, !745, !746, !747}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !739, file: !420, line: 2160, type: !343)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !739, file: !420, line: 2160, type: !11)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !739, file: !420, line: 2162, type: !235)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !739, file: !420, line: 2163, type: !29)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !748, file: !420, line: 2176, type: !52)
!748 = distinct !DILexicalBlock(scope: !749, file: !420, line: 2175, column: 26)
!749 = distinct !DILexicalBlock(scope: !739, file: !420, line: 2175, column: 9)
!750 = !DISubprogram(name: "adjust_fmt", scope: !420, file: !420, line: 1988, type: !751, isLocal: true, isDefinition: true, scopeLine: 1989, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.bufferinfo*)* @adjust_fmt, variables: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!29, !525}
!753 = !{!754, !755}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !750, file: !420, line: 1988, type: !525)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !750, file: !420, line: 1990, type: !29)
!756 = !DISubprogram(name: "ptr_from_index", scope: !420, file: !420, line: 2131, type: !757, isLocal: true, isDefinition: true, scopeLine: 2132, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.bufferinfo*, i64)* @ptr_from_index, variables: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{!52, !235, !11}
!759 = !{!760, !761, !762, !763}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !756, file: !420, line: 2131, type: !235)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !756, file: !420, line: 2131, type: !11)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !756, file: !420, line: 2133, type: !52)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !756, file: !420, line: 2134, type: !11)
!764 = !DISubprogram(name: "unpack_single", scope: !420, file: !420, line: 1620, type: !765, isLocal: true, isDefinition: true, scopeLine: 1621, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @unpack_single, variables: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!5, !29, !29}
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !782, !784, !786, !788, !790, !792, !794, !796, !798, !800, !802, !804, !806}
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !764, file: !420, line: 1620, type: !29)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !764, file: !420, line: 1620, type: !29)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "llu", scope: !764, file: !420, line: 1622, type: !398)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lu", scope: !764, file: !420, line: 1623, type: !96)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zu", scope: !764, file: !420, line: 1624, type: !94)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lld", scope: !764, file: !420, line: 1625, type: !397)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ld", scope: !764, file: !420, line: 1626, type: !17)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zd", scope: !764, file: !420, line: 1627, type: !11)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !764, file: !420, line: 1628, type: !382)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uc", scope: !764, file: !420, line: 1629, type: !385)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !764, file: !420, line: 1630, type: !4)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !780, file: !420, line: 1637, type: !396)
!780 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1637, column: 18)
!781 = distinct !DILexicalBlock(scope: !764, file: !420, line: 1632, column: 21)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !783, file: !420, line: 1638, type: !44)
!783 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1638, column: 18)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !785, file: !420, line: 1639, type: !17)
!785 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1639, column: 18)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !787, file: !420, line: 1643, type: !400)
!787 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1643, column: 18)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !789, file: !420, line: 1649, type: !77)
!789 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1649, column: 18)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !791, file: !420, line: 1650, type: !341)
!791 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1650, column: 18)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !793, file: !420, line: 1651, type: !96)
!793 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1651, column: 18)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !795, file: !420, line: 1655, type: !397)
!795 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1655, column: 18)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !797, file: !420, line: 1656, type: !398)
!797 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1656, column: 18)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !799, file: !420, line: 1660, type: !11)
!799 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1660, column: 18)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !801, file: !420, line: 1661, type: !94)
!801 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1661, column: 18)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !803, file: !420, line: 1664, type: !399)
!803 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1664, column: 18)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !805, file: !420, line: 1665, type: !382)
!805 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1665, column: 18)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !807, file: !420, line: 1671, type: !4)
!807 = distinct !DILexicalBlock(scope: !781, file: !420, line: 1671, column: 18)
!808 = !DISubprogram(name: "memory_subscript", scope: !420, file: !420, line: 2242, type: !809, isLocal: true, isDefinition: true, scopeLine: 2243, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemoryViewObject*, %struct._object*)* @memory_subscript, variables: !811)
!809 = !DISubroutineType(types: !810)
!810 = !{!5, !343, !5}
!811 = !{!812, !813, !814, !815, !820, !823, !826}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !808, file: !420, line: 2242, type: !343)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !808, file: !420, line: 2242, type: !5)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !808, file: !420, line: 2244, type: !235)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !816, file: !420, line: 2251, type: !29)
!816 = distinct !DILexicalBlock(scope: !817, file: !420, line: 2250, column: 122)
!817 = distinct !DILexicalBlock(scope: !818, file: !420, line: 2250, column: 13)
!818 = distinct !DILexicalBlock(scope: !819, file: !420, line: 2249, column: 26)
!819 = distinct !DILexicalBlock(scope: !808, file: !420, line: 2249, column: 9)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !821, file: !420, line: 2268, type: !11)
!821 = distinct !DILexicalBlock(scope: !822, file: !420, line: 2267, column: 111)
!822 = distinct !DILexicalBlock(scope: !808, file: !420, line: 2267, column: 9)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sliced", scope: !824, file: !420, line: 2275, type: !343)
!824 = distinct !DILexicalBlock(scope: !825, file: !420, line: 2274, column: 64)
!825 = distinct !DILexicalBlock(scope: !822, file: !420, line: 2274, column: 14)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !827, file: !420, line: 2282, type: !5)
!827 = distinct !DILexicalBlock(scope: !828, file: !420, line: 2282, column: 16)
!828 = distinct !DILexicalBlock(scope: !829, file: !420, line: 2281, column: 52)
!829 = distinct !DILexicalBlock(scope: !824, file: !420, line: 2281, column: 13)
!830 = !DISubprogram(name: "init_slice", scope: !420, file: !420, line: 2188, type: !831, isLocal: true, isDefinition: true, scopeLine: 2189, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct._object*, i32)* @init_slice, variables: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!44, !235, !5, !44}
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !830, file: !420, line: 2188, type: !235)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !830, file: !420, line: 2188, type: !5)
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !830, file: !420, line: 2188, type: !44)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !830, file: !420, line: 2190, type: !11)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !830, file: !420, line: 2190, type: !11)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !830, file: !420, line: 2190, type: !11)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !830, file: !420, line: 2190, type: !11)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !842, file: !420, line: 2203, type: !11)
!842 = distinct !DILexicalBlock(scope: !843, file: !420, line: 2202, column: 10)
!843 = distinct !DILexicalBlock(scope: !830, file: !420, line: 2198, column: 9)
!844 = !DISubprogram(name: "init_len", scope: !420, file: !420, line: 573, type: !597, isLocal: true, isDefinition: true, scopeLine: 574, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*)* @init_len, variables: !845)
!845 = !{!846, !847, !848}
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !844, file: !420, line: 573, type: !235)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !844, file: !420, line: 575, type: !11)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !844, file: !420, line: 575, type: !11)
!849 = !DISubprogram(name: "is_multislice", scope: !420, file: !420, line: 2217, type: !144, isLocal: true, isDefinition: true, scopeLine: 2218, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @is_multislice, variables: !850)
!850 = !{!851, !852, !853, !854}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !849, file: !420, line: 2217, type: !5)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !849, file: !420, line: 2219, type: !11)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !849, file: !420, line: 2219, type: !11)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !855, file: !420, line: 2228, type: !5)
!855 = distinct !DILexicalBlock(scope: !856, file: !420, line: 2227, column: 32)
!856 = distinct !DILexicalBlock(scope: !857, file: !420, line: 2227, column: 5)
!857 = distinct !DILexicalBlock(scope: !849, file: !420, line: 2227, column: 5)
!858 = !DISubprogram(name: "memory_ass_sub", scope: !420, file: !420, line: 2301, type: !859, isLocal: true, isDefinition: true, scopeLine: 2302, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyMemoryViewObject*, %struct._object*, %struct._object*)* @memory_ass_sub, variables: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!44, !343, !5, !5}
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !872, !875, !877}
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !858, file: !420, line: 2301, type: !343)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !858, file: !420, line: 2301, type: !5)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !858, file: !420, line: 2301, type: !5)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !858, file: !420, line: 2303, type: !235)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !858, file: !420, line: 2304, type: !236)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !858, file: !420, line: 2305, type: !29)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !858, file: !420, line: 2306, type: !52)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !870, file: !420, line: 2341, type: !11)
!870 = distinct !DILexicalBlock(scope: !871, file: !420, line: 2340, column: 111)
!871 = distinct !DILexicalBlock(scope: !858, file: !420, line: 2340, column: 9)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !873, file: !420, line: 2351, type: !236)
!873 = distinct !DILexicalBlock(scope: !874, file: !420, line: 2350, column: 78)
!874 = distinct !DILexicalBlock(scope: !858, file: !420, line: 2350, column: 9)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arrays", scope: !873, file: !420, line: 2352, type: !876)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, align: 64, elements: !364)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !873, file: !420, line: 2353, type: !44)
!878 = !DISubprogram(name: "pack_single", scope: !420, file: !420, line: 1716, type: !879, isLocal: true, isDefinition: true, scopeLine: 1717, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, i8*)* @pack_single, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!44, !52, !5, !29}
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !897, !899, !901, !904, !906, !908, !910, !912, !914, !916, !920, !923, !925}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !878, file: !420, line: 1716, type: !52)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !878, file: !420, line: 1716, type: !5)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !878, file: !420, line: 1716, type: !29)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "llu", scope: !878, file: !420, line: 1718, type: !398)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lu", scope: !878, file: !420, line: 1719, type: !96)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zu", scope: !878, file: !420, line: 1720, type: !94)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lld", scope: !878, file: !420, line: 1721, type: !397)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ld", scope: !878, file: !420, line: 1722, type: !17)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zd", scope: !878, file: !420, line: 1723, type: !11)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !878, file: !420, line: 1724, type: !382)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !878, file: !420, line: 1725, type: !4)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !894, file: !420, line: 1739, type: !396)
!894 = distinct !DILexicalBlock(scope: !895, file: !420, line: 1739, column: 16)
!895 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1733, column: 25)
!896 = distinct !DILexicalBlock(scope: !878, file: !420, line: 1727, column: 21)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !898, file: !420, line: 1742, type: !44)
!898 = distinct !DILexicalBlock(scope: !895, file: !420, line: 1742, column: 16)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !900, file: !420, line: 1744, type: !17)
!900 = distinct !DILexicalBlock(scope: !895, file: !420, line: 1744, column: 16)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !902, file: !420, line: 1759, type: !77)
!902 = distinct !DILexicalBlock(scope: !903, file: !420, line: 1759, column: 16)
!903 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1753, column: 25)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !905, file: !420, line: 1762, type: !341)
!905 = distinct !DILexicalBlock(scope: !903, file: !420, line: 1762, column: 16)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !907, file: !420, line: 1764, type: !96)
!907 = distinct !DILexicalBlock(scope: !903, file: !420, line: 1764, column: 16)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !909, file: !420, line: 1774, type: !397)
!909 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1774, column: 12)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !911, file: !420, line: 1780, type: !398)
!911 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1780, column: 12)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !913, file: !420, line: 1789, type: !11)
!913 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1789, column: 12)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !915, file: !420, line: 1795, type: !94)
!915 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1795, column: 12)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !917, file: !420, line: 1804, type: !399)
!917 = distinct !DILexicalBlock(scope: !918, file: !420, line: 1804, column: 16)
!918 = distinct !DILexicalBlock(scope: !919, file: !420, line: 1803, column: 28)
!919 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1803, column: 13)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !921, file: !420, line: 1807, type: !382)
!921 = distinct !DILexicalBlock(scope: !922, file: !420, line: 1807, column: 16)
!922 = distinct !DILexicalBlock(scope: !919, file: !420, line: 1806, column: 14)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !924, file: !420, line: 1817, type: !400)
!924 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1817, column: 12)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !926, file: !420, line: 1837, type: !4)
!926 = distinct !DILexicalBlock(scope: !896, file: !420, line: 1837, column: 12)
!927 = !DISubprogram(name: "pylong_as_ld", scope: !420, file: !420, line: 1515, type: !928, isLocal: true, isDefinition: true, scopeLine: 1516, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @pylong_as_ld, variables: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{!17, !5}
!930 = !{!931, !932, !933, !934}
!931 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !927, file: !420, line: 1515, type: !5)
!932 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !927, file: !420, line: 1517, type: !5)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ld", scope: !927, file: !420, line: 1518, type: !17)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !935, file: !420, line: 1525, type: !5)
!935 = distinct !DILexicalBlock(scope: !927, file: !420, line: 1525, column: 8)
