; ModuleID = 'programs_new/Python-new/mmapmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!154 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!155 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!156 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!157 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!158 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!159 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!160 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!161 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!162 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!163 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!164 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!165 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!166 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!167 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!168 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!169 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!170 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!171 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!172 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!173 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!174 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!175 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!176 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!177 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!178 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!179 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!180 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!181 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!182 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!183 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!184 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!185 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!186 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!187 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!188 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!189 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!190 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!191 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!192 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!193 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!194 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!195 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!196 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!197 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!198 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!199 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!200 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!201 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!202 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!203 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!204 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!205 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!206 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!207 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!208 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!209 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!210 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!211 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!212 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!213 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!214 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!215 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!216 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!217 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!218 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!219 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!220 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!221 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!222 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!223 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!224 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!225 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!226 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!227 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!228 = !{!229, !230, !242, !319, !575, !277, !256, !236, !472, !269, !576, !577}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !232, line: 109, baseType: !233)
!232 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !232, line: 105, size: 128, align: 64, elements: !234)
!234 = !{!235, !243}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !233, file: !232, line: 107, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !237, line: 177, baseType: !238)
!237 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !239, line: 102, baseType: !240)
!239 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !241, line: 181, baseType: !242)
!241 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!242 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !233, file: !232, line: 108, baseType: !244, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !232, line: 334, size: 3200, align: 64, elements: !246)
!246 = !{!247, !253, !257, !258, !259, !264, !327, !332, !337, !338, !343, !395, !426, !438, !444, !445, !446, !448, !450, !481, !482, !483, !492, !493, !498, !499, !501, !503, !513, !523, !541, !542, !543, !545, !547, !548, !550, !555, !560, !565, !566, !567, !568, !569, !570, !571, !572, !574}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !245, file: !232, line: 335, baseType: !248, size: 192, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !232, line: 114, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 111, size: 192, align: 64, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !249, file: !232, line: 112, baseType: !231, size: 128, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !249, file: !232, line: 113, baseType: !236, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !245, file: !232, line: 336, baseType: !254, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !245, file: !232, line: 337, baseType: !236, size: 64, align: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !245, file: !232, line: 337, baseType: !236, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !245, file: !232, line: 341, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !232, line: 308, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !230}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !245, file: !232, line: 342, baseType: !265, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !232, line: 314, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !230, !270, !269}
!269 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !239, line: 48, baseType: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !273, line: 246, size: 1728, align: 64, elements: !274)
!273 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!274 = !{!275, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !296, !297, !298, !299, !301, !303, !305, !309, !312, !314, !315, !316, !317, !318, !322, !323}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !272, file: !273, line: 247, baseType: !269, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !272, file: !273, line: 252, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !272, file: !273, line: 253, baseType: !277, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !272, file: !273, line: 254, baseType: !277, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !272, file: !273, line: 255, baseType: !277, size: 64, align: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !272, file: !273, line: 256, baseType: !277, size: 64, align: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !272, file: !273, line: 257, baseType: !277, size: 64, align: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !272, file: !273, line: 258, baseType: !277, size: 64, align: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !272, file: !273, line: 259, baseType: !277, size: 64, align: 64, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !272, file: !273, line: 261, baseType: !277, size: 64, align: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !272, file: !273, line: 262, baseType: !277, size: 64, align: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !272, file: !273, line: 263, baseType: !277, size: 64, align: 64, offset: 704)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !272, file: !273, line: 265, baseType: !289, size: 64, align: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !273, line: 161, size: 192, align: 64, elements: !291)
!291 = !{!292, !293, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !290, file: !273, line: 162, baseType: !289, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !290, file: !273, line: 163, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !290, file: !273, line: 167, baseType: !269, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !272, file: !273, line: 267, baseType: !294, size: 64, align: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !272, file: !273, line: 269, baseType: !269, size: 32, align: 32, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !272, file: !273, line: 273, baseType: !269, size: 32, align: 32, offset: 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !272, file: !273, line: 275, baseType: !300, size: 64, align: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !241, line: 140, baseType: !242)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !272, file: !273, line: 279, baseType: !302, size: 16, align: 16, offset: 1024)
!302 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !272, file: !273, line: 280, baseType: !304, size: 8, align: 8, offset: 1040)
!304 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !272, file: !273, line: 281, baseType: !306, size: 8, align: 8, offset: 1048)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 8, align: 8, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 1)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !272, file: !273, line: 285, baseType: !310, size: 64, align: 64, offset: 1088)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !273, line: 155, baseType: null)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !272, file: !273, line: 294, baseType: !313, size: 64, align: 64, offset: 1152)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !241, line: 141, baseType: !242)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !272, file: !273, line: 303, baseType: !229, size: 64, align: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !272, file: !273, line: 304, baseType: !229, size: 64, align: 64, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !272, file: !273, line: 305, baseType: !229, size: 64, align: 64, offset: 1344)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !272, file: !273, line: 306, baseType: !229, size: 64, align: 64, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !272, file: !273, line: 307, baseType: !319, size: 64, align: 64, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 62, baseType: !321)
!320 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!321 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !272, file: !273, line: 309, baseType: !269, size: 32, align: 32, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !272, file: !273, line: 311, baseType: !324, size: 160, align: 8, offset: 1568)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 160, align: 8, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 20)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !245, file: !232, line: 343, baseType: !328, size: 64, align: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !232, line: 316, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!230, !230, !277}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !245, file: !232, line: 344, baseType: !333, size: 64, align: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !232, line: 318, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!269, !230, !277, !230}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !245, file: !232, line: 345, baseType: !229, size: 64, align: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !245, file: !232, line: 346, baseType: !339, size: 64, align: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !232, line: 320, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!230, !230}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !245, file: !232, line: 350, baseType: !344, size: 64, align: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !232, line: 278, baseType: !346)
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 236, size: 2176, align: 64, elements: !347)
!347 = !{!348, !353, !354, !355, !356, !357, !362, !364, !365, !366, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !346, file: !232, line: 241, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !232, line: 166, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!230, !230, !230}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !346, file: !232, line: 242, baseType: !349, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !346, file: !232, line: 243, baseType: !349, size: 64, align: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !346, file: !232, line: 244, baseType: !349, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !346, file: !232, line: 245, baseType: !349, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !346, file: !232, line: 246, baseType: !358, size: 64, align: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !232, line: 167, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!230, !230, !230, !230}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !346, file: !232, line: 247, baseType: !363, size: 64, align: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !232, line: 165, baseType: !340)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !346, file: !232, line: 248, baseType: !363, size: 64, align: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !346, file: !232, line: 249, baseType: !363, size: 64, align: 64, offset: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !346, file: !232, line: 250, baseType: !367, size: 64, align: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !232, line: 168, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!269, !230}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !346, file: !232, line: 251, baseType: !363, size: 64, align: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !346, file: !232, line: 252, baseType: !349, size: 64, align: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !346, file: !232, line: 253, baseType: !349, size: 64, align: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !346, file: !232, line: 254, baseType: !349, size: 64, align: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !346, file: !232, line: 255, baseType: !349, size: 64, align: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !346, file: !232, line: 256, baseType: !349, size: 64, align: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !346, file: !232, line: 257, baseType: !363, size: 64, align: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !346, file: !232, line: 258, baseType: !229, size: 64, align: 64, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !346, file: !232, line: 259, baseType: !363, size: 64, align: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !346, file: !232, line: 261, baseType: !349, size: 64, align: 64, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !346, file: !232, line: 262, baseType: !349, size: 64, align: 64, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !346, file: !232, line: 263, baseType: !349, size: 64, align: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !346, file: !232, line: 264, baseType: !349, size: 64, align: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !346, file: !232, line: 265, baseType: !358, size: 64, align: 64, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !346, file: !232, line: 266, baseType: !349, size: 64, align: 64, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !346, file: !232, line: 267, baseType: !349, size: 64, align: 64, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !346, file: !232, line: 268, baseType: !349, size: 64, align: 64, offset: 1664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !346, file: !232, line: 269, baseType: !349, size: 64, align: 64, offset: 1728)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !346, file: !232, line: 270, baseType: !349, size: 64, align: 64, offset: 1792)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !346, file: !232, line: 272, baseType: !349, size: 64, align: 64, offset: 1856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !346, file: !232, line: 273, baseType: !349, size: 64, align: 64, offset: 1920)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !346, file: !232, line: 274, baseType: !349, size: 64, align: 64, offset: 1984)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !346, file: !232, line: 275, baseType: !349, size: 64, align: 64, offset: 2048)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !346, file: !232, line: 277, baseType: !363, size: 64, align: 64, offset: 2112)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !245, file: !232, line: 351, baseType: !396, size: 64, align: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !232, line: 292, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 280, size: 640, align: 64, elements: !399)
!399 = !{!400, !405, !406, !411, !412, !413, !418, !419, !424, !425}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !398, file: !232, line: 281, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !232, line: 169, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!236, !230}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !398, file: !232, line: 282, baseType: !349, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !398, file: !232, line: 283, baseType: !407, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !232, line: 170, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!230, !230, !236}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !398, file: !232, line: 284, baseType: !407, size: 64, align: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !398, file: !232, line: 285, baseType: !229, size: 64, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !398, file: !232, line: 286, baseType: !414, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !232, line: 172, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!269, !230, !236, !230}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !398, file: !232, line: 287, baseType: !229, size: 64, align: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !398, file: !232, line: 288, baseType: !420, size: 64, align: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !232, line: 231, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!269, !230, !230}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !398, file: !232, line: 290, baseType: !349, size: 64, align: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !398, file: !232, line: 291, baseType: !407, size: 64, align: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !245, file: !232, line: 352, baseType: !427, size: 64, align: 64, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !232, line: 298, baseType: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 294, size: 192, align: 64, elements: !430)
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !429, file: !232, line: 295, baseType: !401, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !429, file: !232, line: 296, baseType: !349, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !429, file: !232, line: 297, baseType: !434, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !232, line: 174, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!269, !230, !230, !230}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !245, file: !232, line: 356, baseType: !439, size: 64, align: 64, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !232, line: 321, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!443, !230}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !237, line: 186, baseType: !236)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !245, file: !232, line: 357, baseType: !358, size: 64, align: 64, offset: 1024)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !245, file: !232, line: 358, baseType: !339, size: 64, align: 64, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !245, file: !232, line: 359, baseType: !447, size: 64, align: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !232, line: 317, baseType: !350)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !245, file: !232, line: 360, baseType: !449, size: 64, align: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !232, line: 319, baseType: !435)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !245, file: !232, line: 363, baseType: !451, size: 64, align: 64, offset: 1280)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !232, line: 304, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 301, size: 128, align: 64, elements: !454)
!454 = !{!455, !476}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !453, file: !232, line: 302, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !232, line: 193, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!269, !230, !460, !269}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !232, line: 191, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !232, line: 178, size: 640, align: 64, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !473, !474, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !462, file: !232, line: 179, baseType: !229, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !462, file: !232, line: 180, baseType: !230, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !462, file: !232, line: 181, baseType: !236, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !462, file: !232, line: 182, baseType: !236, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !462, file: !232, line: 184, baseType: !269, size: 32, align: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !462, file: !232, line: 185, baseType: !269, size: 32, align: 32, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !462, file: !232, line: 186, baseType: !277, size: 64, align: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !462, file: !232, line: 187, baseType: !472, size: 64, align: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !462, file: !232, line: 188, baseType: !472, size: 64, align: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !462, file: !232, line: 189, baseType: !472, size: 64, align: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !462, file: !232, line: 190, baseType: !229, size: 64, align: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !453, file: !232, line: 303, baseType: !477, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !232, line: 194, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !230, !460}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !245, file: !232, line: 366, baseType: !321, size: 64, align: 64, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !245, file: !232, line: 368, baseType: !254, size: 64, align: 64, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !245, file: !232, line: 372, baseType: !484, size: 64, align: 64, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !232, line: 233, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!269, !230, !488, !229}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !232, line: 232, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!269, !230, !229}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !245, file: !232, line: 375, baseType: !367, size: 64, align: 64, offset: 1536)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !245, file: !232, line: 379, baseType: !494, size: 64, align: 64, offset: 1600)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !232, line: 322, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!230, !230, !230, !269}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !245, file: !232, line: 382, baseType: !236, size: 64, align: 64, offset: 1664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !245, file: !232, line: 385, baseType: !500, size: 64, align: 64, offset: 1728)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !232, line: 323, baseType: !340)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !245, file: !232, line: 386, baseType: !502, size: 64, align: 64, offset: 1792)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !232, line: 324, baseType: !340)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !245, file: !232, line: 389, baseType: !504, size: 64, align: 64, offset: 1856)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !506, line: 40, size: 256, align: 64, elements: !507)
!506 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!507 = !{!508, !509, !511, !512}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !505, file: !506, line: 41, baseType: !254, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !505, file: !506, line: 42, baseType: !510, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !506, line: 18, baseType: !350)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !505, file: !506, line: 43, baseType: !269, size: 32, align: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !505, file: !506, line: 45, baseType: !254, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !245, file: !232, line: 390, baseType: !514, size: 64, align: 64, offset: 1920)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !516, line: 18, size: 320, align: 64, elements: !517)
!516 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!517 = !{!518, !519, !520, !521, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !515, file: !516, line: 19, baseType: !277, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !515, file: !516, line: 20, baseType: !269, size: 32, align: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !515, file: !516, line: 21, baseType: !236, size: 64, align: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !515, file: !516, line: 22, baseType: !269, size: 32, align: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !515, file: !516, line: 23, baseType: !277, size: 64, align: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !245, file: !232, line: 391, baseType: !524, size: 64, align: 64, offset: 1984)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !526, line: 11, size: 320, align: 64, elements: !527)
!526 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!527 = !{!528, !529, !534, !539, !540}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !525, file: !526, line: 12, baseType: !277, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !525, file: !526, line: 13, baseType: !530, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !526, line: 8, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!230, !230, !229}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !525, file: !526, line: 14, baseType: !535, size: 64, align: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !526, line: 9, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!269, !230, !230, !229}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !525, file: !526, line: 15, baseType: !277, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !525, file: !526, line: 16, baseType: !229, size: 64, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !245, file: !232, line: 392, baseType: !244, size: 64, align: 64, offset: 2048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !245, file: !232, line: 393, baseType: !230, size: 64, align: 64, offset: 2112)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !245, file: !232, line: 394, baseType: !544, size: 64, align: 64, offset: 2176)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !232, line: 325, baseType: !359)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !245, file: !232, line: 395, baseType: !546, size: 64, align: 64, offset: 2240)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !232, line: 326, baseType: !435)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !245, file: !232, line: 396, baseType: !236, size: 64, align: 64, offset: 2304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !245, file: !232, line: 397, baseType: !549, size: 64, align: 64, offset: 2368)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !232, line: 327, baseType: !435)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !245, file: !232, line: 398, baseType: !551, size: 64, align: 64, offset: 2432)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !232, line: 329, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!230, !244, !236}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !245, file: !232, line: 399, baseType: !556, size: 64, align: 64, offset: 2496)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !232, line: 328, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!230, !244, !230, !230}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !245, file: !232, line: 400, baseType: !561, size: 64, align: 64, offset: 2560)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !232, line: 307, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !229}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !245, file: !232, line: 401, baseType: !367, size: 64, align: 64, offset: 2624)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !245, file: !232, line: 402, baseType: !230, size: 64, align: 64, offset: 2688)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !245, file: !232, line: 403, baseType: !230, size: 64, align: 64, offset: 2752)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !245, file: !232, line: 404, baseType: !230, size: 64, align: 64, offset: 2816)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !245, file: !232, line: 405, baseType: !230, size: 64, align: 64, offset: 2880)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !245, file: !232, line: 406, baseType: !230, size: 64, align: 64, offset: 2944)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !245, file: !232, line: 407, baseType: !260, size: 64, align: 64, offset: 3008)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !245, file: !232, line: 410, baseType: !573, size: 32, align: 32, offset: 3072)
!573 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !245, file: !232, line: 412, baseType: !260, size: 64, align: 64, offset: 3136)
!575 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "access_mode", file: !4, line: 88, baseType: !3)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmap_object", file: !4, line: 114, baseType: !579)
!579 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 90, size: 576, align: 64, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !587, !588, !589, !590}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !579, file: !4, line: 91, baseType: !231, size: 128, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !579, file: !4, line: 92, baseType: !277, size: 64, align: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !4, line: 93, baseType: !319, size: 64, align: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !579, file: !4, line: 94, baseType: !319, size: 64, align: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !579, file: !4, line: 98, baseType: !586, size: 64, align: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !239, line: 92, baseType: !313)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "exports", scope: !579, file: !4, line: 100, baseType: !269, size: 32, align: 32, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !579, file: !4, line: 109, baseType: !269, size: 32, align: 32, offset: 416)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !579, file: !4, line: 112, baseType: !230, size: 64, align: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !579, file: !4, line: 113, baseType: !576, size: 32, align: 32, offset: 512)
!591 = !{!592, !598, !603, !608, !614, !620, !624, !632, !637, !657, !680, !687, !693, !697, !701, !722, !726, !732, !739, !746, !751, !758, !766, !774, !777, !786, !828, !855, !859, !865, !870, !874, !878, !883, !912, !921, !933}
!592 = !DISubprogram(name: "PyInit_mmap", scope: !4, file: !4, line: 1468, type: !593, isLocal: false, isDefinition: true, scopeLine: 1469, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_mmap, variables: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{!230}
!595 = !{!596, !597}
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !592, file: !4, line: 1470, type: !230)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !592, file: !4, line: 1470, type: !230)
!598 = !DISubprogram(name: "mmap_object_dealloc", scope: !4, file: !4, line: 118, type: !599, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mmap_object*)* @mmap_object_dealloc, variables: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !577}
!601 = !{!602}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m_obj", arg: 1, scope: !598, file: !4, line: 118, type: !577)
!603 = !DISubprogram(name: "mmap_length", scope: !4, file: !4, line: 758, type: !604, isLocal: true, isDefinition: true, scopeLine: 759, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mmap_object*)* @mmap_length, variables: !606)
!604 = !DISubroutineType(types: !605)
!605 = !{!236, !577}
!606 = !{!607}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !603, file: !4, line: 758, type: !577)
!608 = !DISubprogram(name: "mmap_concat", scope: !4, file: !4, line: 830, type: !609, isLocal: true, isDefinition: true, scopeLine: 831, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_concat, variables: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{!230, !577, !230}
!611 = !{!612, !613}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !608, file: !4, line: 830, type: !577)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bb", arg: 2, scope: !608, file: !4, line: 830, type: !230)
!614 = !DISubprogram(name: "mmap_repeat", scope: !4, file: !4, line: 839, type: !615, isLocal: true, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, i64)* @mmap_repeat, variables: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{!230, !577, !236}
!617 = !{!618, !619}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !614, file: !4, line: 839, type: !577)
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !614, file: !4, line: 839, type: !236)
!620 = !DISubprogram(name: "mmap_item", scope: !4, file: !4, line: 765, type: !615, isLocal: true, isDefinition: true, scopeLine: 766, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, i64)* @mmap_item, variables: !621)
!621 = !{!622, !623}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !620, file: !4, line: 765, type: !577)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !620, file: !4, line: 765, type: !236)
!624 = !DISubprogram(name: "mmap_ass_item", scope: !4, file: !4, line: 848, type: !625, isLocal: true, isDefinition: true, scopeLine: 849, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mmap_object*, i64, %struct._object*)* @mmap_ass_item, variables: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!269, !577, !236, !230}
!627 = !{!628, !629, !630, !631}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !624, file: !4, line: 848, type: !577)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !624, file: !4, line: 848, type: !236)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !624, file: !4, line: 848, type: !230)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !624, file: !4, line: 850, type: !254)
!632 = !DISubprogram(name: "is_writable", scope: !4, file: !4, line: 360, type: !633, isLocal: true, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mmap_object*)* @is_writable, variables: !635)
!633 = !DISubroutineType(types: !634)
!634 = !{!269, !577}
!635 = !{!636}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !632, file: !4, line: 360, type: !577)
!637 = !DISubprogram(name: "mmap_subscript", scope: !4, file: !4, line: 776, type: !609, isLocal: true, isDefinition: true, scopeLine: 777, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_subscript, variables: !638)
!638 = !{!639, !640, !641, !644, !647, !648, !649, !650, !654, !655, !656}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !637, file: !4, line: 776, type: !577)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !637, file: !4, line: 776, type: !230)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !642, file: !4, line: 780, type: !236)
!642 = distinct !DILexicalBlock(scope: !643, file: !4, line: 779, column: 113)
!643 = distinct !DILexicalBlock(scope: !637, file: !4, line: 779, column: 9)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !645, file: !4, line: 793, type: !236)
!645 = distinct !DILexicalBlock(scope: !646, file: !4, line: 792, column: 65)
!646 = distinct !DILexicalBlock(scope: !643, file: !4, line: 792, column: 14)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !645, file: !4, line: 793, type: !236)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !645, file: !4, line: 793, type: !236)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelen", scope: !645, file: !4, line: 793, type: !236)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_buf", scope: !651, file: !4, line: 806, type: !277)
!651 = distinct !DILexicalBlock(scope: !652, file: !4, line: 805, column: 14)
!652 = distinct !DILexicalBlock(scope: !653, file: !4, line: 802, column: 18)
!653 = distinct !DILexicalBlock(scope: !645, file: !4, line: 800, column: 13)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !651, file: !4, line: 807, type: !236)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !651, file: !4, line: 807, type: !236)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !651, file: !4, line: 808, type: !230)
!657 = !DISubprogram(name: "mmap_ass_subscript", scope: !4, file: !4, line: 875, type: !658, isLocal: true, isDefinition: true, scopeLine: 876, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mmap_object*, %struct._object*, %struct._object*)* @mmap_ass_subscript, variables: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{!269, !577, !230, !230}
!660 = !{!661, !662, !663, !664, !667, !668, !671, !672, !673, !674, !675, !679}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !657, file: !4, line: 875, type: !577)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !657, file: !4, line: 875, type: !230)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !657, file: !4, line: 875, type: !230)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !665, file: !4, line: 883, type: !236)
!665 = distinct !DILexicalBlock(scope: !666, file: !4, line: 882, column: 113)
!666 = distinct !DILexicalBlock(scope: !657, file: !4, line: 882, column: 9)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !665, file: !4, line: 884, type: !236)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !669, file: !4, line: 918, type: !236)
!669 = distinct !DILexicalBlock(scope: !670, file: !4, line: 917, column: 65)
!670 = distinct !DILexicalBlock(scope: !666, file: !4, line: 917, column: 14)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !669, file: !4, line: 918, type: !236)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !669, file: !4, line: 918, type: !236)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelen", scope: !669, file: !4, line: 918, type: !236)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vbuf", scope: !669, file: !4, line: 919, type: !461)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !676, file: !4, line: 946, type: !236)
!676 = distinct !DILexicalBlock(scope: !677, file: !4, line: 945, column: 14)
!677 = distinct !DILexicalBlock(scope: !678, file: !4, line: 942, column: 18)
!678 = distinct !DILexicalBlock(scope: !669, file: !4, line: 940, column: 13)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !676, file: !4, line: 946, type: !236)
!680 = !DISubprogram(name: "mmap_buffer_getbuf", scope: !4, file: !4, line: 741, type: !681, isLocal: true, isDefinition: true, scopeLine: 742, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mmap_object*, %struct.bufferinfo*, i32)* @mmap_buffer_getbuf, variables: !683)
!681 = !DISubroutineType(types: !682)
!682 = !{!269, !577, !460, !269}
!683 = !{!684, !685, !686}
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !680, file: !4, line: 741, type: !577)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !680, file: !4, line: 741, type: !460)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !680, file: !4, line: 741, type: !269)
!687 = !DISubprogram(name: "mmap_buffer_releasebuf", scope: !4, file: !4, line: 752, type: !688, isLocal: true, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mmap_object*, %struct.bufferinfo*)* @mmap_buffer_releasebuf, variables: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !577, !460}
!690 = !{!691, !692}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !687, file: !4, line: 752, type: !577)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !687, file: !4, line: 752, type: !460)
!693 = !DISubprogram(name: "mmap_close_method", scope: !4, file: !4, line: 145, type: !609, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_close_method, variables: !694)
!694 = !{!695, !696}
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !693, file: !4, line: 145, type: !577)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !693, file: !4, line: 145, type: !230)
!697 = !DISubprogram(name: "mmap_find_method", scope: !4, file: !4, line: 346, type: !609, isLocal: true, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_find_method, variables: !698)
!698 = !{!699, !700}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !697, file: !4, line: 346, type: !577)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !697, file: !4, line: 347, type: !230)
!701 = !DISubprogram(name: "mmap_gfind", scope: !4, file: !4, line: 298, type: !702, isLocal: true, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*, i32)* @mmap_gfind, variables: !704)
!702 = !DISubroutineType(types: !703)
!703 = !{!230, !577, !230, !269}
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !715, !716, !717, !718}
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !701, file: !4, line: 298, type: !577)
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !701, file: !4, line: 299, type: !230)
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reverse", arg: 3, scope: !701, file: !4, line: 300, type: !269)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !701, file: !4, line: 302, type: !236)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !701, file: !4, line: 303, type: !236)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needle", scope: !701, file: !4, line: 304, type: !254)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !701, file: !4, line: 305, type: !236)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !713, file: !4, line: 312, type: !254)
!713 = distinct !DILexicalBlock(scope: !714, file: !4, line: 311, column: 12)
!714 = distinct !DILexicalBlock(scope: !701, file: !4, line: 308, column: 9)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_p", scope: !713, file: !4, line: 312, type: !254)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_p", scope: !713, file: !4, line: 312, type: !254)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !713, file: !4, line: 313, type: !269)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !719, file: !4, line: 334, type: !236)
!719 = distinct !DILexicalBlock(scope: !720, file: !4, line: 333, column: 63)
!720 = distinct !DILexicalBlock(scope: !721, file: !4, line: 332, column: 9)
!721 = distinct !DILexicalBlock(scope: !713, file: !4, line: 332, column: 9)
!722 = !DISubprogram(name: "mmap_rfind_method", scope: !4, file: !4, line: 353, type: !609, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_rfind_method, variables: !723)
!723 = !{!724, !725}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !722, file: !4, line: 353, type: !577)
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !722, file: !4, line: 354, type: !230)
!726 = !DISubprogram(name: "mmap_flush_method", scope: !4, file: !4, line: 589, type: !609, isLocal: true, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_flush_method, variables: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !726, file: !4, line: 589, type: !577)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !726, file: !4, line: 589, type: !230)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !726, file: !4, line: 591, type: !236)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !726, file: !4, line: 592, type: !236)
!732 = !DISubprogram(name: "mmap_move_method", scope: !4, file: !4, line: 663, type: !609, isLocal: true, isDefinition: true, scopeLine: 664, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_move_method, variables: !733)
!733 = !{!734, !735, !736, !737, !738}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !732, file: !4, line: 663, type: !577)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !732, file: !4, line: 663, type: !230)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !732, file: !4, line: 665, type: !321)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !732, file: !4, line: 665, type: !321)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnt", scope: !732, file: !4, line: 665, type: !321)
!739 = !DISubprogram(name: "mmap_read_method", scope: !4, file: !4, line: 268, type: !609, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_read_method, variables: !740)
!740 = !{!741, !742, !743, !744, !745}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !739, file: !4, line: 268, type: !577)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !739, file: !4, line: 269, type: !230)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_bytes", scope: !739, file: !4, line: 271, type: !236)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !739, file: !4, line: 271, type: !236)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !739, file: !4, line: 272, type: !230)
!746 = !DISubprogram(name: "mmap_convert_ssize_t", scope: !4, file: !4, line: 247, type: !490, isLocal: true, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @mmap_convert_ssize_t, variables: !747)
!747 = !{!748, !749, !750}
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !746, file: !4, line: 247, type: !230)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 2, scope: !746, file: !4, line: 247, type: !229)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !746, file: !4, line: 248, type: !236)
!751 = !DISubprogram(name: "mmap_read_byte_method", scope: !4, file: !4, line: 209, type: !609, isLocal: true, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_read_byte_method, variables: !752)
!752 = !{!753, !754, !755}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !751, file: !4, line: 209, type: !577)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !751, file: !4, line: 210, type: !230)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !756, file: !4, line: 214, type: !256)
!756 = distinct !DILexicalBlock(scope: !757, file: !4, line: 213, column: 33)
!757 = distinct !DILexicalBlock(scope: !751, file: !4, line: 213, column: 9)
!758 = !DISubprogram(name: "mmap_read_line_method", scope: !4, file: !4, line: 224, type: !609, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_read_line_method, variables: !759)
!759 = !{!760, !761, !762, !763, !764, !765}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !758, file: !4, line: 224, type: !577)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !758, file: !4, line: 225, type: !230)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !758, file: !4, line: 227, type: !277)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eof", scope: !758, file: !4, line: 228, type: !277)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eol", scope: !758, file: !4, line: 229, type: !277)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !758, file: !4, line: 230, type: !230)
!766 = !DISubprogram(name: "mmap_resize_method", scope: !4, file: !4, line: 486, type: !609, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_resize_method, variables: !767)
!767 = !{!768, !769, !770, !771}
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !766, file: !4, line: 486, type: !577)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !766, file: !4, line: 487, type: !230)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_size", scope: !766, file: !4, line: 489, type: !236)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newmap", scope: !772, file: !4, line: 551, type: !229)
!772 = distinct !DILexicalBlock(scope: !773, file: !4, line: 550, column: 12)
!773 = distinct !DILexicalBlock(scope: !766, file: !4, line: 491, column: 9)
!774 = !DISubprogram(name: "is_resizeable", scope: !4, file: !4, line: 369, type: !633, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mmap_object*)* @is_resizeable, variables: !775)
!775 = !{!776}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !774, file: !4, line: 369, type: !577)
!777 = !DISubprogram(name: "mmap_seek_method", scope: !4, file: !4, line: 621, type: !609, isLocal: true, isDefinition: true, scopeLine: 622, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_seek_method, variables: !778)
!778 = !{!779, !780, !781, !782, !783}
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !777, file: !4, line: 621, type: !577)
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !777, file: !4, line: 621, type: !230)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dist", scope: !777, file: !4, line: 623, type: !236)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "how", scope: !777, file: !4, line: 624, type: !269)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "where", scope: !784, file: !4, line: 629, type: !319)
!784 = distinct !DILexicalBlock(scope: !785, file: !4, line: 628, column: 10)
!785 = distinct !DILexicalBlock(scope: !777, file: !4, line: 626, column: 9)
!786 = !DISubprogram(name: "mmap_size_method", scope: !4, file: !4, line: 434, type: !609, isLocal: true, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_size_method, variables: !787)
!787 = !{!788, !789, !790}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !786, file: !4, line: 434, type: !577)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !786, file: !4, line: 435, type: !230)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !791, file: !4, line: 462, type: !792)
!791 = distinct !DILexicalBlock(scope: !786, file: !4, line: 461, column: 5)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !793, line: 46, size: 1152, align: 64, elements: !794)
!793 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!794 = !{!795, !797, !799, !801, !803, !805, !807, !808, !809, !810, !812, !814, !822, !823, !824}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !792, file: !793, line: 48, baseType: !796, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !241, line: 133, baseType: !321)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !792, file: !793, line: 53, baseType: !798, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !241, line: 136, baseType: !321)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !792, file: !793, line: 61, baseType: !800, size: 64, align: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !241, line: 139, baseType: !321)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !792, file: !793, line: 62, baseType: !802, size: 32, align: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !241, line: 138, baseType: !573)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !792, file: !793, line: 64, baseType: !804, size: 32, align: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !241, line: 134, baseType: !573)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !792, file: !793, line: 65, baseType: !806, size: 32, align: 32, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !241, line: 135, baseType: !573)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !792, file: !793, line: 67, baseType: !269, size: 32, align: 32, offset: 288)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !792, file: !793, line: 69, baseType: !796, size: 64, align: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !792, file: !793, line: 74, baseType: !300, size: 64, align: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !792, file: !793, line: 78, baseType: !811, size: 64, align: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !241, line: 162, baseType: !242)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !792, file: !793, line: 80, baseType: !813, size: 64, align: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !241, line: 167, baseType: !242)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !792, file: !793, line: 91, baseType: !815, size: 128, align: 64, offset: 576)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !816, line: 120, size: 128, align: 64, elements: !817)
!816 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!817 = !{!818, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !815, file: !816, line: 122, baseType: !819, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !241, line: 148, baseType: !242)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !815, file: !816, line: 123, baseType: !821, size: 64, align: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !241, line: 184, baseType: !242)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !792, file: !793, line: 92, baseType: !815, size: 128, align: 64, offset: 704)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !792, file: !793, line: 93, baseType: !815, size: 128, align: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !792, file: !793, line: 106, baseType: !825, size: 192, align: 64, offset: 960)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 192, align: 64, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 3)
!828 = !DISubprogram(name: "fstat64", scope: !829, file: !829, line: 517, type: !830, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.stat64*)* @fstat64, variables: !852)
!829 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!830 = !DISubroutineType(types: !831)
!831 = !{!269, !269, !832}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !793, line: 119, size: 1152, align: 64, elements: !834)
!834 = !{!835, !836, !838, !839, !840, !841, !842, !843, !844, !845, !846, !848, !849, !850, !851}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !833, file: !793, line: 121, baseType: !796, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !833, file: !793, line: 123, baseType: !837, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !241, line: 137, baseType: !321)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !833, file: !793, line: 124, baseType: !800, size: 64, align: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !833, file: !793, line: 125, baseType: !802, size: 32, align: 32, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !833, file: !793, line: 132, baseType: !804, size: 32, align: 32, offset: 224)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !833, file: !793, line: 133, baseType: !806, size: 32, align: 32, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !833, file: !793, line: 135, baseType: !269, size: 32, align: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !833, file: !793, line: 136, baseType: !796, size: 64, align: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !833, file: !793, line: 137, baseType: !300, size: 64, align: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !833, file: !793, line: 143, baseType: !811, size: 64, align: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !833, file: !793, line: 144, baseType: !847, size: 64, align: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !241, line: 168, baseType: !242)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !833, file: !793, line: 152, baseType: !815, size: 128, align: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !833, file: !793, line: 153, baseType: !815, size: 128, align: 64, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !833, file: !793, line: 154, baseType: !815, size: 128, align: 64, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !833, file: !793, line: 164, baseType: !825, size: 192, align: 64, offset: 960)
!852 = !{!853, !854}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !828, file: !829, line: 517, type: !269)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !828, file: !829, line: 517, type: !832)
!855 = !DISubprogram(name: "mmap_tell_method", scope: !4, file: !4, line: 582, type: !609, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_tell_method, variables: !856)
!856 = !{!857, !858}
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !855, file: !4, line: 582, type: !577)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !855, file: !4, line: 582, type: !230)
!859 = !DISubprogram(name: "mmap_write_method", scope: !4, file: !4, line: 385, type: !609, isLocal: true, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_write_method, variables: !860)
!860 = !{!861, !862, !863, !864}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !859, file: !4, line: 385, type: !577)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !859, file: !4, line: 386, type: !230)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !859, file: !4, line: 388, type: !236)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !859, file: !4, line: 389, type: !277)
!865 = !DISubprogram(name: "mmap_write_byte_method", scope: !4, file: !4, line: 409, type: !609, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap_write_byte_method, variables: !866)
!866 = !{!867, !868, !869}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !865, file: !4, line: 409, type: !577)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !865, file: !4, line: 410, type: !230)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !865, file: !4, line: 412, type: !256)
!870 = !DISubprogram(name: "mmap__enter__method", scope: !4, file: !4, line: 696, type: !609, isLocal: true, isDefinition: true, scopeLine: 697, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*, %struct._object*)* @mmap__enter__method, variables: !871)
!871 = !{!872, !873}
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !870, file: !4, line: 696, type: !577)
!873 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !870, file: !4, line: 696, type: !230)
!874 = !DISubprogram(name: "mmap__exit__method", scope: !4, file: !4, line: 705, type: !351, isLocal: true, isDefinition: true, scopeLine: 706, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @mmap__exit__method, variables: !875)
!875 = !{!876, !877}
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !874, file: !4, line: 705, type: !230)
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !874, file: !4, line: 705, type: !230)
!878 = !DISubprogram(name: "mmap_closed_get", scope: !4, file: !4, line: 686, type: !879, isLocal: true, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mmap_object*)* @mmap_closed_get, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!230, !577}
!881 = !{!882}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !878, file: !4, line: 686, type: !577)
!883 = !DISubprogram(name: "new_mmap_object", scope: !4, file: !4, line: 1091, type: !884, isLocal: true, isDefinition: true, scopeLine: 1092, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @new_mmap_object, variables: !888)
!884 = !DISubroutineType(types: !885)
!885 = !{!230, !886, !230, !230}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !232, line: 422, baseType: !245)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !908}
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !883, file: !4, line: 1091, type: !886)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !883, file: !4, line: 1091, type: !230)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !883, file: !4, line: 1091, type: !230)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !883, file: !4, line: 1094, type: !792)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m_obj", scope: !883, file: !4, line: 1096, type: !577)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map_size_obj", scope: !883, file: !4, line: 1097, type: !230)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map_size", scope: !883, file: !4, line: 1098, type: !236)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !883, file: !4, line: 1099, type: !586)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !883, file: !4, line: 1100, type: !269)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !883, file: !4, line: 1100, type: !269)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prot", scope: !883, file: !4, line: 1100, type: !269)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "devzero", scope: !883, file: !4, line: 1101, type: !269)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "access", scope: !883, file: !4, line: 1102, type: !269)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !903, file: !4, line: 1216, type: !230)
!903 = distinct !DILexicalBlock(scope: !904, file: !4, line: 1216, column: 16)
!904 = distinct !DILexicalBlock(scope: !905, file: !4, line: 1215, column: 30)
!905 = distinct !DILexicalBlock(scope: !906, file: !4, line: 1215, column: 13)
!906 = distinct !DILexicalBlock(scope: !907, file: !4, line: 1213, column: 10)
!907 = distinct !DILexicalBlock(scope: !883, file: !4, line: 1194, column: 9)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !909, file: !4, line: 1231, type: !230)
!909 = distinct !DILexicalBlock(scope: !910, file: !4, line: 1231, column: 12)
!910 = distinct !DILexicalBlock(scope: !911, file: !4, line: 1229, column: 36)
!911 = distinct !DILexicalBlock(scope: !883, file: !4, line: 1229, column: 9)
!912 = !DISubprogram(name: "_GetMapSize", scope: !4, file: !4, line: 1062, type: !913, isLocal: true, isDefinition: true, scopeLine: 1063, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, i8*)* @_GetMapSize, variables: !915)
!913 = !DISubroutineType(types: !914)
!914 = !{!236, !230, !254}
!915 = !{!916, !917, !918}
!916 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !912, file: !4, line: 1062, type: !230)
!917 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "param", arg: 2, scope: !912, file: !4, line: 1062, type: !254)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !919, file: !4, line: 1067, type: !236)
!919 = distinct !DILexicalBlock(scope: !920, file: !4, line: 1066, column: 107)
!920 = distinct !DILexicalBlock(scope: !912, file: !4, line: 1066, column: 9)
!921 = !DISubprogram(name: "setint", scope: !4, file: !4, line: 1446, type: !922, isLocal: true, isDefinition: true, scopeLine: 1447, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8*, i64)* @setint, variables: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !230, !254, !242}
!924 = !{!925, !926, !927, !928, !929}
!925 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !921, file: !4, line: 1446, type: !230)
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !921, file: !4, line: 1446, type: !254)
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !921, file: !4, line: 1446, type: !242)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !921, file: !4, line: 1448, type: !230)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !930, file: !4, line: 1450, type: !230)
!930 = distinct !DILexicalBlock(scope: !931, file: !4, line: 1450, column: 12)
!931 = distinct !DILexicalBlock(scope: !932, file: !4, line: 1449, column: 53)
!932 = distinct !DILexicalBlock(scope: !921, file: !4, line: 1449, column: 9)
!933 = !DISubprogram(name: "my_getpagesize", scope: !4, file: !4, line: 59, type: !934, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @my_getpagesize, variables: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!269}
!936 = !{}
!937 = !{!938, !939, !940, !941, !942, !946, !950, !958, !963, !967}
!938 = !DIGlobalVariable(name: "mmap_object_type", scope: !0, file: !4, line: 1013, type: !887, isLocal: true, isDefinition: true, variable: %struct._typeobject* @mmap_object_type)
!939 = !DIGlobalVariable(name: "mmap_as_sequence", scope: !0, file: !4, line: 965, type: !397, isLocal: true, isDefinition: true, variable: %struct.PySequenceMethods* @mmap_as_sequence)
!940 = !DIGlobalVariable(name: "mmap_as_mapping", scope: !0, file: !4, line: 975, type: !428, isLocal: true, isDefinition: true, variable: %struct.PyMappingMethods* @mmap_as_mapping)
!941 = !DIGlobalVariable(name: "mmap_as_buffer", scope: !0, file: !4, line: 981, type: !452, isLocal: true, isDefinition: true, variable: %struct.PyBufferProcs* @mmap_as_buffer)
!942 = !DIGlobalVariable(name: "mmap_doc", scope: !0, file: !4, line: 989, type: !943, isLocal: true, isDefinition: true, variable: [1102 x i8]* @mmap_doc)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 8816, align: 8, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 1102)
!946 = !DIGlobalVariable(name: "mmap_object_methods", scope: !0, file: !4, line: 712, type: !947, isLocal: true, isDefinition: true, variable: [17 x %struct.PyMethodDef]* @mmap_object_methods)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 4352, align: 64, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 17)
!950 = !DIGlobalVariable(name: "PyId_close", scope: !874, file: !4, line: 707, type: !951, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @mmap__exit__method.PyId_close)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !232, line: 144, baseType: !952)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !232, line: 140, size: 192, align: 64, elements: !953)
!953 = !{!954, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !232, line: 141, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !952, file: !232, line: 142, baseType: !254, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !952, file: !232, line: 143, baseType: !230, size: 64, align: 64, offset: 128)
!958 = !DIGlobalVariable(name: "mmap_object_getset", scope: !0, file: !4, line: 732, type: !959, isLocal: true, isDefinition: true, variable: [2 x %struct.PyGetSetDef]* @mmap_object_getset)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 640, align: 64, elements: !961)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !526, line: 17, baseType: !525)
!961 = !{!962}
!962 = !DISubrange(count: 2)
!963 = !DIGlobalVariable(name: "keywords", scope: !883, file: !4, line: 1103, type: !964, isLocal: true, isDefinition: true, variable: [7 x i8*]* @new_mmap_object.keywords)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 448, align: 64, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 7)
!967 = !DIGlobalVariable(name: "mmapmodule", scope: !0, file: !4, line: 1455, type: !968, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @mmapmodule)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !969, line: 47, size: 832, align: 64, elements: !970)
!969 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!970 = !{!971, !980, !981, !982, !983, !986, !987, !988, !989}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !968, file: !969, line: 48, baseType: !972, size: 320, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !969, line: 38, baseType: !973)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !969, line: 33, size: 320, align: 64, elements: !974)
!974 = !{!975, !976, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !973, file: !969, line: 34, baseType: !231, size: 128, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !973, file: !969, line: 35, baseType: !977, size: 64, align: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !973, file: !969, line: 36, baseType: !236, size: 64, align: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !973, file: !969, line: 37, baseType: !230, size: 64, align: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !968, file: !969, line: 49, baseType: !254, size: 64, align: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !968, file: !969, line: 50, baseType: !254, size: 64, align: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !968, file: !969, line: 51, baseType: !236, size: 64, align: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !968, file: !969, line: 52, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !506, line: 47, baseType: !505)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !968, file: !969, line: 53, baseType: !367, size: 64, align: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !968, file: !969, line: 54, baseType: !484, size: 64, align: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !968, file: !969, line: 55, baseType: !367, size: 64, align: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !968, file: !969, line: 56, baseType: !561, size: 64, align: 64, offset: 768)
!990 = !{i32 2, !"Dwarf Version", i32 4}
!991 = !{i32 2, !"Debug Info Version", i32 3}
!992 = !{i32 1, !"PIC Level", i32 2}
!993 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!994 = !DILocation(line: 1470, column: 5, scope: !592)
!995 = !DIExpression()
!996 = !DILocation(line: 1470, column: 15, scope: !592)
!997 = !DILocation(line: 1470, column: 22, scope: !592)
!998 = !DILocation(line: 1472, column: 9, scope: !999)
!999 = distinct !DILexicalBlock(scope: !592, file: !4, line: 1472, column: 9)
!1000 = !DILocation(line: 1472, column: 41, scope: !999)
!1001 = !DILocation(line: 1472, column: 9, scope: !592)
!1002 = !DILocation(line: 1473, column: 9, scope: !999)
!1003 = !DILocation(line: 1475, column: 14, scope: !592)
!1004 = !DILocation(line: 1475, column: 12, scope: !592)
!1005 = !{!1006, !1006, i64 0}
!1006 = !{!"any pointer", !1007, i64 0}
!1007 = !{!"omnipotent char", !1008, i64 0}
!1008 = !{!"Simple C/C++ TBAA"}
!1009 = !DILocation(line: 1476, column: 9, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !592, file: !4, line: 1476, column: 9)
!1011 = !DILocation(line: 1476, column: 16, scope: !1010)
!1012 = !DILocation(line: 1476, column: 9, scope: !592)
!1013 = !DILocation(line: 1477, column: 9, scope: !1010)
!1014 = !DILocation(line: 1478, column: 29, scope: !592)
!1015 = !DILocation(line: 1478, column: 12, scope: !592)
!1016 = !DILocation(line: 1478, column: 10, scope: !592)
!1017 = !DILocation(line: 1479, column: 10, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !592, file: !4, line: 1479, column: 9)
!1019 = !DILocation(line: 1479, column: 9, scope: !592)
!1020 = !DILocation(line: 1480, column: 9, scope: !1018)
!1021 = !DILocation(line: 1481, column: 26, scope: !592)
!1022 = !DILocation(line: 1481, column: 41, scope: !592)
!1023 = !DILocation(line: 1481, column: 5, scope: !592)
!1024 = !DILocation(line: 1482, column: 26, scope: !592)
!1025 = !DILocation(line: 1482, column: 5, scope: !592)
!1026 = !DILocation(line: 1484, column: 12, scope: !592)
!1027 = !DILocation(line: 1484, column: 5, scope: !592)
!1028 = !DILocation(line: 1487, column: 12, scope: !592)
!1029 = !DILocation(line: 1487, column: 5, scope: !592)
!1030 = !DILocation(line: 1490, column: 12, scope: !592)
!1031 = !DILocation(line: 1490, column: 5, scope: !592)
!1032 = !DILocation(line: 1494, column: 12, scope: !592)
!1033 = !DILocation(line: 1494, column: 5, scope: !592)
!1034 = !DILocation(line: 1497, column: 12, scope: !592)
!1035 = !DILocation(line: 1497, column: 5, scope: !592)
!1036 = !DILocation(line: 1500, column: 12, scope: !592)
!1037 = !DILocation(line: 1500, column: 5, scope: !592)
!1038 = !DILocation(line: 1503, column: 12, scope: !592)
!1039 = !DILocation(line: 1503, column: 5, scope: !592)
!1040 = !DILocation(line: 1506, column: 12, scope: !592)
!1041 = !DILocation(line: 1506, column: 5, scope: !592)
!1042 = !DILocation(line: 1507, column: 12, scope: !592)
!1043 = !DILocation(line: 1507, column: 5, scope: !592)
!1044 = !DILocation(line: 1510, column: 12, scope: !592)
!1045 = !DILocation(line: 1510, column: 36, scope: !592)
!1046 = !DILocation(line: 1510, column: 30, scope: !592)
!1047 = !DILocation(line: 1510, column: 5, scope: !592)
!1048 = !DILocation(line: 1512, column: 12, scope: !592)
!1049 = !DILocation(line: 1512, column: 49, scope: !592)
!1050 = !DILocation(line: 1512, column: 43, scope: !592)
!1051 = !DILocation(line: 1512, column: 5, scope: !592)
!1052 = !DILocation(line: 1514, column: 12, scope: !592)
!1053 = !DILocation(line: 1514, column: 5, scope: !592)
!1054 = !DILocation(line: 1515, column: 12, scope: !592)
!1055 = !DILocation(line: 1515, column: 5, scope: !592)
!1056 = !DILocation(line: 1516, column: 12, scope: !592)
