; ModuleID = 'programs_new/Python-new/moduleobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !510, globals: !787)
!1 = !DIFile(filename: "moduleobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !11, line: 23, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !{!13, !14, !15, !16, !17}
!13 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!14 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!15 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!16 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!17 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!18 = !{!19, !110, !58, !401, !402, !420, !424, !432, !448, !450, !452}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleObject", file: !21, line: 16, baseType: !22)
!21 = !DIFile(filename: "Objects/moduleobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 9, size: 448, align: 64, elements: !23)
!23 = !{!24, !371, !372, !398, !399, !400}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !22, file: !21, line: 10, baseType: !25, size: 128, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !26, line: 109, baseType: !27)
!26 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !26, line: 105, size: 128, align: 64, elements: !28)
!28 = !{!29, !37}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !27, file: !26, line: 107, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !31, line: 177, baseType: !32)
!31 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !33, line: 102, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !35, line: 181, baseType: !36)
!35 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!36 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !27, file: !26, line: 108, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !26, line: 334, size: 3200, align: 64, elements: !40)
!40 = !{!41, !47, !51, !52, !53, !59, !123, !128, !133, !134, !139, !191, !222, !234, !240, !241, !242, !244, !246, !277, !278, !279, !288, !289, !294, !295, !297, !299, !309, !319, !337, !338, !339, !341, !343, !344, !346, !351, !356, !361, !362, !363, !364, !365, !366, !367, !368, !370}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !39, file: !26, line: 335, baseType: !42, size: 192, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !26, line: 114, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 111, size: 192, align: 64, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !43, file: !26, line: 112, baseType: !25, size: 128, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !43, file: !26, line: 113, baseType: !30, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !39, file: !26, line: 336, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !39, file: !26, line: 337, baseType: !30, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !39, file: !26, line: 337, baseType: !30, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !39, file: !26, line: 341, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !26, line: 308, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !39, file: !26, line: 342, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !26, line: 314, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !58, !65, !64}
!64 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 48, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 246, size: 1728, align: 64, elements: !69)
!68 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!69 = !{!70, !71, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !91, !92, !93, !94, !96, !98, !100, !104, !107, !109, !111, !112, !113, !114, !118, !119}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 247, baseType: !64, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 252, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 253, baseType: !72, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 254, baseType: !72, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 255, baseType: !72, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 256, baseType: !72, size: 64, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 257, baseType: !72, size: 64, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 258, baseType: !72, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 259, baseType: !72, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 261, baseType: !72, size: 64, align: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 262, baseType: !72, size: 64, align: 64, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 263, baseType: !72, size: 64, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 265, baseType: !84, size: 64, align: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 161, size: 192, align: 64, elements: !86)
!86 = !{!87, !88, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !85, file: !68, line: 162, baseType: !84, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !85, file: !68, line: 163, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !85, file: !68, line: 167, baseType: !64, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 267, baseType: !89, size: 64, align: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 269, baseType: !64, size: 32, align: 32, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 273, baseType: !64, size: 32, align: 32, offset: 928)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 275, baseType: !95, size: 64, align: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !35, line: 140, baseType: !36)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 279, baseType: !97, size: 16, align: 16, offset: 1024)
!97 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 280, baseType: !99, size: 8, align: 8, offset: 1040)
!99 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 281, baseType: !101, size: 8, align: 8, offset: 1048)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 285, baseType: !105, size: 64, align: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 155, baseType: null)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 294, baseType: !108, size: 64, align: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !35, line: 141, baseType: !36)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !67, file: !68, line: 303, baseType: !110, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !67, file: !68, line: 304, baseType: !110, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !67, file: !68, line: 305, baseType: !110, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !67, file: !68, line: 306, baseType: !110, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 307, baseType: !115, size: 64, align: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 62, baseType: !117)
!116 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!117 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 309, baseType: !64, size: 32, align: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 311, baseType: !120, size: 160, align: 8, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !39, file: !26, line: 343, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !26, line: 316, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!58, !58, !72}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !39, file: !26, line: 344, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !26, line: 318, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!64, !58, !72, !58}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !39, file: !26, line: 345, baseType: !110, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !39, file: !26, line: 346, baseType: !135, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !26, line: 320, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!58, !58}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !39, file: !26, line: 350, baseType: !140, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !26, line: 278, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 236, size: 2176, align: 64, elements: !143)
!143 = !{!144, !149, !150, !151, !152, !153, !158, !160, !161, !162, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !142, file: !26, line: 241, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !26, line: 166, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!58, !58, !58}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !142, file: !26, line: 242, baseType: !145, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !142, file: !26, line: 243, baseType: !145, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !142, file: !26, line: 244, baseType: !145, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !142, file: !26, line: 245, baseType: !145, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !142, file: !26, line: 246, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !26, line: 167, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!58, !58, !58, !58}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !142, file: !26, line: 247, baseType: !159, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !26, line: 165, baseType: !136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !142, file: !26, line: 248, baseType: !159, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !142, file: !26, line: 249, baseType: !159, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !142, file: !26, line: 250, baseType: !163, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !26, line: 168, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!64, !58}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !142, file: !26, line: 251, baseType: !159, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !142, file: !26, line: 252, baseType: !145, size: 64, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !142, file: !26, line: 253, baseType: !145, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !142, file: !26, line: 254, baseType: !145, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !142, file: !26, line: 255, baseType: !145, size: 64, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !142, file: !26, line: 256, baseType: !145, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !142, file: !26, line: 257, baseType: !159, size: 64, align: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !142, file: !26, line: 258, baseType: !110, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !142, file: !26, line: 259, baseType: !159, size: 64, align: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !142, file: !26, line: 261, baseType: !145, size: 64, align: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !142, file: !26, line: 262, baseType: !145, size: 64, align: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !142, file: !26, line: 263, baseType: !145, size: 64, align: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !142, file: !26, line: 264, baseType: !145, size: 64, align: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !142, file: !26, line: 265, baseType: !154, size: 64, align: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !142, file: !26, line: 266, baseType: !145, size: 64, align: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !142, file: !26, line: 267, baseType: !145, size: 64, align: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !142, file: !26, line: 268, baseType: !145, size: 64, align: 64, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !142, file: !26, line: 269, baseType: !145, size: 64, align: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !142, file: !26, line: 270, baseType: !145, size: 64, align: 64, offset: 1792)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !142, file: !26, line: 272, baseType: !145, size: 64, align: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !142, file: !26, line: 273, baseType: !145, size: 64, align: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !142, file: !26, line: 274, baseType: !145, size: 64, align: 64, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !142, file: !26, line: 275, baseType: !145, size: 64, align: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !142, file: !26, line: 277, baseType: !159, size: 64, align: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !39, file: !26, line: 351, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !26, line: 292, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 280, size: 640, align: 64, elements: !195)
!195 = !{!196, !201, !202, !207, !208, !209, !214, !215, !220, !221}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !194, file: !26, line: 281, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !26, line: 169, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!30, !58}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !194, file: !26, line: 282, baseType: !145, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !194, file: !26, line: 283, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !26, line: 170, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!58, !58, !30}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !194, file: !26, line: 284, baseType: !203, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !194, file: !26, line: 285, baseType: !110, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !194, file: !26, line: 286, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !26, line: 172, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!64, !58, !30, !58}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !194, file: !26, line: 287, baseType: !110, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !194, file: !26, line: 288, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !26, line: 231, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!64, !58, !58}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !194, file: !26, line: 290, baseType: !145, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !194, file: !26, line: 291, baseType: !203, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !39, file: !26, line: 352, baseType: !223, size: 64, align: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !26, line: 298, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 294, size: 192, align: 64, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !225, file: !26, line: 295, baseType: !197, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !225, file: !26, line: 296, baseType: !145, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !225, file: !26, line: 297, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !26, line: 174, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!64, !58, !58, !58}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !39, file: !26, line: 356, baseType: !235, size: 64, align: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !26, line: 321, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !58}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !31, line: 186, baseType: !30)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !39, file: !26, line: 357, baseType: !154, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !39, file: !26, line: 358, baseType: !135, size: 64, align: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !39, file: !26, line: 359, baseType: !243, size: 64, align: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !26, line: 317, baseType: !146)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !39, file: !26, line: 360, baseType: !245, size: 64, align: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !26, line: 319, baseType: !231)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !39, file: !26, line: 363, baseType: !247, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !26, line: 304, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 301, size: 128, align: 64, elements: !250)
!250 = !{!251, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !249, file: !26, line: 302, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !26, line: 193, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!64, !58, !256, !64}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !26, line: 191, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !26, line: 178, size: 640, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !26, line: 179, baseType: !110, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !258, file: !26, line: 180, baseType: !58, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !26, line: 181, baseType: !30, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !258, file: !26, line: 182, baseType: !30, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !258, file: !26, line: 184, baseType: !64, size: 32, align: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !258, file: !26, line: 185, baseType: !64, size: 32, align: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !258, file: !26, line: 186, baseType: !72, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !258, file: !26, line: 187, baseType: !268, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !258, file: !26, line: 188, baseType: !268, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !258, file: !26, line: 189, baseType: !268, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !258, file: !26, line: 190, baseType: !110, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !249, file: !26, line: 303, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !26, line: 194, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !58, !256}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !39, file: !26, line: 366, baseType: !117, size: 64, align: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !39, file: !26, line: 368, baseType: !48, size: 64, align: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !39, file: !26, line: 372, baseType: !280, size: 64, align: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !26, line: 233, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!64, !58, !284, !110}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !26, line: 232, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!64, !58, !110}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !39, file: !26, line: 375, baseType: !163, size: 64, align: 64, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !39, file: !26, line: 379, baseType: !290, size: 64, align: 64, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !26, line: 322, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!58, !58, !58, !64}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !39, file: !26, line: 382, baseType: !30, size: 64, align: 64, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !39, file: !26, line: 385, baseType: !296, size: 64, align: 64, offset: 1728)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !26, line: 323, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !39, file: !26, line: 386, baseType: !298, size: 64, align: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !26, line: 324, baseType: !136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !39, file: !26, line: 389, baseType: !300, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !302, line: 40, size: 256, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!303 = !{!304, !305, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !301, file: !302, line: 41, baseType: !48, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !301, file: !302, line: 42, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !302, line: 18, baseType: !146)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !301, file: !302, line: 43, baseType: !64, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !301, file: !302, line: 45, baseType: !48, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !39, file: !26, line: 390, baseType: !310, size: 64, align: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !312, line: 18, size: 320, align: 64, elements: !313)
!312 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!313 = !{!314, !315, !316, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !312, line: 19, baseType: !72, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !312, line: 20, baseType: !64, size: 32, align: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !311, file: !312, line: 21, baseType: !30, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !312, line: 22, baseType: !64, size: 32, align: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !311, file: !312, line: 23, baseType: !72, size: 64, align: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !39, file: !26, line: 391, baseType: !320, size: 64, align: 64, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !322, line: 11, size: 320, align: 64, elements: !323)
!322 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!323 = !{!324, !325, !330, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !322, line: 12, baseType: !72, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !321, file: !322, line: 13, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !322, line: 8, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!58, !58, !110}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !321, file: !322, line: 14, baseType: !331, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !322, line: 9, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!64, !58, !58, !110}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !321, file: !322, line: 15, baseType: !72, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !321, file: !322, line: 16, baseType: !110, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !39, file: !26, line: 392, baseType: !38, size: 64, align: 64, offset: 2048)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !39, file: !26, line: 393, baseType: !58, size: 64, align: 64, offset: 2112)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !39, file: !26, line: 394, baseType: !340, size: 64, align: 64, offset: 2176)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !26, line: 325, baseType: !155)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !39, file: !26, line: 395, baseType: !342, size: 64, align: 64, offset: 2240)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !26, line: 326, baseType: !231)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !39, file: !26, line: 396, baseType: !30, size: 64, align: 64, offset: 2304)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !39, file: !26, line: 397, baseType: !345, size: 64, align: 64, offset: 2368)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !26, line: 327, baseType: !231)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !39, file: !26, line: 398, baseType: !347, size: 64, align: 64, offset: 2432)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !26, line: 329, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!58, !38, !30}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !39, file: !26, line: 399, baseType: !352, size: 64, align: 64, offset: 2496)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !26, line: 328, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!58, !38, !58, !58}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !39, file: !26, line: 400, baseType: !357, size: 64, align: 64, offset: 2560)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !26, line: 307, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !110}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !39, file: !26, line: 401, baseType: !163, size: 64, align: 64, offset: 2624)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !39, file: !26, line: 402, baseType: !58, size: 64, align: 64, offset: 2688)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !39, file: !26, line: 403, baseType: !58, size: 64, align: 64, offset: 2752)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !39, file: !26, line: 404, baseType: !58, size: 64, align: 64, offset: 2816)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !39, file: !26, line: 405, baseType: !58, size: 64, align: 64, offset: 2880)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !39, file: !26, line: 406, baseType: !58, size: 64, align: 64, offset: 2944)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !39, file: !26, line: 407, baseType: !54, size: 64, align: 64, offset: 3008)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !39, file: !26, line: 410, baseType: !369, size: 32, align: 32, offset: 3072)
!369 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !39, file: !26, line: 412, baseType: !54, size: 64, align: 64, offset: 3136)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "md_dict", scope: !22, file: !21, line: 11, baseType: !58, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "md_def", scope: !22, file: !21, line: 12, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !375, line: 47, size: 832, align: 64, elements: !376)
!375 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!376 = !{!377, !388, !389, !390, !391, !394, !395, !396, !397}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !374, file: !375, line: 48, baseType: !378, size: 320, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !375, line: 38, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !375, line: 33, size: 320, align: 64, elements: !380)
!380 = !{!381, !382, !386, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !379, file: !375, line: 34, baseType: !25, size: 128, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !379, file: !375, line: 35, baseType: !383, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!58}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !379, file: !375, line: 36, baseType: !30, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !379, file: !375, line: 37, baseType: !58, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !374, file: !375, line: 49, baseType: !48, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !374, file: !375, line: 50, baseType: !48, size: 64, align: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !374, file: !375, line: 51, baseType: !30, size: 64, align: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !374, file: !375, line: 52, baseType: !392, size: 64, align: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !302, line: 47, baseType: !301)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !374, file: !375, line: 53, baseType: !163, size: 64, align: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !374, file: !375, line: 54, baseType: !280, size: 64, align: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !374, file: !375, line: 55, baseType: !163, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !374, file: !375, line: 56, baseType: !357, size: 64, align: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "md_state", scope: !22, file: !21, line: 13, baseType: !110, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "md_weaklist", scope: !22, file: !21, line: 14, baseType: !58, size: 64, align: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "md_name", scope: !22, file: !21, line: 15, baseType: !58, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !369)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !405)
!405 = !{!406, !407, !408, !409, !417}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !4, line: 291, baseType: !25, size: 128, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !404, file: !4, line: 292, baseType: !30, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !404, file: !4, line: 293, baseType: !239, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !4, line: 349, baseType: !410, size: 32, align: 32, offset: 256)
!410 = !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !4, line: 294, size: 32, align: 32, elements: !411)
!411 = !{!412, !413, !414, !415, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !410, file: !4, line: 303, baseType: !369, size: 2, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !410, file: !4, line: 331, baseType: !369, size: 3, align: 32, offset: 2)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !410, file: !4, line: 336, baseType: !369, size: 1, align: 32, offset: 5)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !410, file: !4, line: 340, baseType: !369, size: 1, align: 32, offset: 6)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !410, file: !4, line: 345, baseType: !369, size: 1, align: 32, offset: 7)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !404, file: !4, line: 350, baseType: !418, size: 64, align: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !116, line: 90, baseType: !64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !423)
!423 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !426, file: !4, line: 357, baseType: !403, size: 384, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !426, file: !4, line: 358, baseType: !30, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !426, file: !4, line: 360, baseType: !72, size: 64, align: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !426, file: !4, line: 361, baseType: !30, size: 64, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !434)
!434 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !434, file: !4, line: 369, baseType: !425, size: 576, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !434, file: !4, line: 375, baseType: !438, size: 64, align: 64, offset: 576)
!438 = !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !4, line: 370, size: 64, align: 64, elements: !439)
!439 = !{!440, !441, !443, !446}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !438, file: !4, line: 371, baseType: !110, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !438, file: !4, line: 372, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !438, file: !4, line: 373, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !97)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !438, file: !4, line: 374, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !454, line: 139, baseType: !455)
!454 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !454, line: 69, size: 1536, align: 64, elements: !456)
!456 = !{!457, !459, !460, !480, !483, !484, !485, !486, !487, !488, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !454, line: 72, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !454, line: 73, baseType: !458, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !455, file: !454, line: 74, baseType: !461, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !454, line: 44, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !454, line: 19, size: 832, align: 64, elements: !464)
!464 = !{!465, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !454, line: 21, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !463, file: !454, line: 22, baseType: !458, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !463, file: !454, line: 24, baseType: !58, size: 64, align: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !463, file: !454, line: 25, baseType: !58, size: 64, align: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !463, file: !454, line: 26, baseType: !58, size: 64, align: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !463, file: !454, line: 27, baseType: !58, size: 64, align: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !463, file: !454, line: 28, baseType: !58, size: 64, align: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !463, file: !454, line: 30, baseType: !58, size: 64, align: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !463, file: !454, line: 31, baseType: !58, size: 64, align: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !463, file: !454, line: 32, baseType: !58, size: 64, align: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !463, file: !454, line: 33, baseType: !64, size: 32, align: 32, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !463, file: !454, line: 34, baseType: !64, size: 32, align: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !463, file: !454, line: 37, baseType: !64, size: 32, align: 32, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !463, file: !454, line: 43, baseType: !58, size: 64, align: 64, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !455, file: !454, line: 76, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !454, line: 50, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !455, file: !454, line: 77, baseType: !64, size: 32, align: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !455, file: !454, line: 78, baseType: !50, size: 8, align: 8, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !455, file: !454, line: 80, baseType: !50, size: 8, align: 8, offset: 296)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !455, file: !454, line: 85, baseType: !64, size: 32, align: 32, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !455, file: !454, line: 86, baseType: !64, size: 32, align: 32, offset: 352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !455, file: !454, line: 88, baseType: !489, size: 64, align: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !454, line: 54, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!64, !58, !481, !64, !58}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !455, file: !454, line: 89, baseType: !489, size: 64, align: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !455, file: !454, line: 90, baseType: !58, size: 64, align: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !455, file: !454, line: 91, baseType: !58, size: 64, align: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !455, file: !454, line: 93, baseType: !58, size: 64, align: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !455, file: !454, line: 94, baseType: !58, size: 64, align: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !455, file: !454, line: 95, baseType: !58, size: 64, align: 64, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !455, file: !454, line: 97, baseType: !58, size: 64, align: 64, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !455, file: !454, line: 98, baseType: !58, size: 64, align: 64, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !455, file: !454, line: 99, baseType: !58, size: 64, align: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !455, file: !454, line: 101, baseType: !58, size: 64, align: 64, offset: 1024)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !455, file: !454, line: 103, baseType: !64, size: 32, align: 32, offset: 1088)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !455, file: !454, line: 105, baseType: !58, size: 64, align: 64, offset: 1152)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !455, file: !454, line: 106, baseType: !36, size: 64, align: 64, offset: 1216)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !455, file: !454, line: 108, baseType: !64, size: 32, align: 32, offset: 1280)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !455, file: !454, line: 109, baseType: !58, size: 64, align: 64, offset: 1344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !455, file: !454, line: 134, baseType: !358, size: 64, align: 64, offset: 1408)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !455, file: !454, line: 135, baseType: !110, size: 64, align: 64, offset: 1472)
!510 = !{!511, !517, !526, !601, !605, !610, !618, !623, !630, !635, !640, !644, !666, !681, !696, !716, !725, !730, !733, !747, !761, !777}
!511 = !DISubprogram(name: "PyModule_NewObject", scope: !21, file: !21, line: 61, type: !137, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_NewObject, variables: !512)
!512 = !{!513, !514, !515}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !511, file: !21, line: 61, type: !58)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !511, file: !21, line: 63, type: !19)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !516, file: !21, line: 78, type: !58)
!516 = distinct !DILexicalBlock(scope: !511, file: !21, line: 78, column: 8)
!517 = !DISubprogram(name: "PyModule_New", scope: !21, file: !21, line: 83, type: !518, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyModule_New, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!58, !48}
!520 = !{!521, !522, !523, !524}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !517, file: !21, line: 83, type: !48)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !517, file: !21, line: 85, type: !58)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !517, file: !21, line: 85, type: !58)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !525, file: !21, line: 90, type: !58)
!525 = distinct !DILexicalBlock(scope: !517, file: !21, line: 90, column: 8)
!526 = !DISubprogram(name: "PyModule_Create2", scope: !21, file: !21, line: 96, type: !527, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, i32)* @PyModule_Create2, variables: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{!58, !373, !64}
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !542, !545, !548, !549, !555, !561, !568, !570, !574, !576, !580, !582, !584, !586, !588, !594, !597, !599}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !526, file: !21, line: 96, type: !373)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module_api_version", arg: 2, scope: !526, file: !21, line: 96, type: !64)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !526, file: !21, line: 98, type: !58)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !526, file: !21, line: 98, type: !58)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !526, file: !21, line: 98, type: !58)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ml", scope: !526, file: !21, line: 99, type: !392)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !526, file: !21, line: 100, type: !48)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !526, file: !21, line: 101, type: !19)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !526, file: !21, line: 102, type: !461)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !540, file: !21, line: 115, type: !64)
!540 = distinct !DILexicalBlock(scope: !541, file: !21, line: 114, column: 64)
!541 = distinct !DILexicalBlock(scope: !526, file: !21, line: 114, column: 9)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !543, file: !21, line: 134, type: !72)
!543 = distinct !DILexicalBlock(scope: !544, file: !21, line: 133, column: 43)
!544 = distinct !DILexicalBlock(scope: !526, file: !21, line: 133, column: 9)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !546, file: !21, line: 135, type: !115)
!546 = distinct !DILexicalBlock(scope: !547, file: !21, line: 135, column: 47)
!547 = distinct !DILexicalBlock(scope: !543, file: !21, line: 135, column: 13)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !546, file: !21, line: 135, type: !115)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !550, file: !21, line: 147, type: !58)
!550 = distinct !DILexicalBlock(scope: !551, file: !21, line: 147, column: 16)
!551 = distinct !DILexicalBlock(scope: !552, file: !21, line: 145, column: 27)
!552 = distinct !DILexicalBlock(scope: !553, file: !21, line: 145, column: 13)
!553 = distinct !DILexicalBlock(scope: !554, file: !21, line: 143, column: 29)
!554 = distinct !DILexicalBlock(scope: !526, file: !21, line: 143, column: 9)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !556, file: !21, line: 157, type: !58)
!556 = distinct !DILexicalBlock(scope: !557, file: !21, line: 157, column: 16)
!557 = distinct !DILexicalBlock(scope: !558, file: !21, line: 156, column: 30)
!558 = distinct !DILexicalBlock(scope: !559, file: !21, line: 156, column: 13)
!559 = distinct !DILexicalBlock(scope: !560, file: !21, line: 154, column: 42)
!560 = distinct !DILexicalBlock(scope: !526, file: !21, line: 154, column: 9)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !562, file: !21, line: 166, type: !58)
!562 = distinct !DILexicalBlock(scope: !563, file: !21, line: 166, column: 20)
!563 = distinct !DILexicalBlock(scope: !564, file: !21, line: 162, column: 42)
!564 = distinct !DILexicalBlock(scope: !565, file: !21, line: 161, column: 17)
!565 = distinct !DILexicalBlock(scope: !566, file: !21, line: 160, column: 71)
!566 = distinct !DILexicalBlock(scope: !567, file: !21, line: 160, column: 9)
!567 = distinct !DILexicalBlock(scope: !559, file: !21, line: 160, column: 9)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !21, line: 167, type: !58)
!569 = distinct !DILexicalBlock(scope: !563, file: !21, line: 167, column: 20)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !571, file: !21, line: 172, type: !58)
!571 = distinct !DILexicalBlock(scope: !572, file: !21, line: 172, column: 20)
!572 = distinct !DILexicalBlock(scope: !573, file: !21, line: 171, column: 34)
!573 = distinct !DILexicalBlock(scope: !565, file: !21, line: 171, column: 17)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !21, line: 173, type: !58)
!575 = distinct !DILexicalBlock(scope: !572, file: !21, line: 173, column: 20)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !577, file: !21, line: 177, type: !58)
!577 = distinct !DILexicalBlock(scope: !578, file: !21, line: 177, column: 20)
!578 = distinct !DILexicalBlock(scope: !579, file: !21, line: 176, column: 63)
!579 = distinct !DILexicalBlock(scope: !565, file: !21, line: 176, column: 17)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !581, file: !21, line: 178, type: !58)
!581 = distinct !DILexicalBlock(scope: !578, file: !21, line: 178, column: 20)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !21, line: 179, type: !58)
!583 = distinct !DILexicalBlock(scope: !578, file: !21, line: 179, column: 20)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !21, line: 182, type: !58)
!585 = distinct !DILexicalBlock(scope: !565, file: !21, line: 182, column: 16)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !587, file: !21, line: 184, type: !58)
!587 = distinct !DILexicalBlock(scope: !559, file: !21, line: 184, column: 12)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !589, file: !21, line: 189, type: !58)
!589 = distinct !DILexicalBlock(scope: !590, file: !21, line: 189, column: 16)
!590 = distinct !DILexicalBlock(scope: !591, file: !21, line: 188, column: 76)
!591 = distinct !DILexicalBlock(scope: !592, file: !21, line: 188, column: 13)
!592 = distinct !DILexicalBlock(scope: !593, file: !21, line: 186, column: 38)
!593 = distinct !DILexicalBlock(scope: !526, file: !21, line: 186, column: 9)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !595, file: !21, line: 189, type: !58)
!595 = distinct !DILexicalBlock(scope: !596, file: !21, line: 189, column: 101)
!596 = distinct !DILexicalBlock(scope: !589, file: !21, line: 189, column: 67)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !21, line: 190, type: !58)
!598 = distinct !DILexicalBlock(scope: !590, file: !21, line: 190, column: 16)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !600, file: !21, line: 193, type: !58)
!600 = distinct !DILexicalBlock(scope: !592, file: !21, line: 193, column: 12)
!601 = !DISubprogram(name: "PyModule_GetDict", scope: !21, file: !21, line: 201, type: !137, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_GetDict, variables: !602)
!602 = !{!603, !604}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !601, file: !21, line: 201, type: !58)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !601, file: !21, line: 203, type: !58)
!605 = !DISubprogram(name: "PyModule_GetNameObject", scope: !21, file: !21, line: 215, type: !137, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_GetNameObject, variables: !606)
!606 = !{!607, !608, !609}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !605, file: !21, line: 215, type: !58)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !605, file: !21, line: 217, type: !58)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !605, file: !21, line: 218, type: !58)
!610 = !DISubprogram(name: "PyModule_GetName", scope: !21, file: !21, line: 236, type: !611, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyModule_GetName, variables: !613)
!611 = !DISubroutineType(types: !612)
!612 = !{!48, !58}
!613 = !{!614, !615, !616}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !610, file: !21, line: 236, type: !58)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !610, file: !21, line: 238, type: !58)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !21, line: 241, type: !58)
!617 = distinct !DILexicalBlock(scope: !610, file: !21, line: 241, column: 8)
!618 = !DISubprogram(name: "PyModule_GetFilenameObject", scope: !21, file: !21, line: 246, type: !137, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_GetFilenameObject, variables: !619)
!619 = !{!620, !621, !622}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !618, file: !21, line: 246, type: !58)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !618, file: !21, line: 248, type: !58)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !618, file: !21, line: 249, type: !58)
!623 = !DISubprogram(name: "PyModule_GetFilename", scope: !21, file: !21, line: 267, type: !611, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyModule_GetFilename, variables: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !623, file: !21, line: 267, type: !58)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !623, file: !21, line: 269, type: !58)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "utf8", scope: !623, file: !21, line: 270, type: !72)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !629, file: !21, line: 275, type: !58)
!629 = distinct !DILexicalBlock(scope: !623, file: !21, line: 275, column: 8)
!630 = !DISubprogram(name: "PyModule_GetDef", scope: !21, file: !21, line: 280, type: !631, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyModuleDef* (%struct._object*)* @PyModule_GetDef, variables: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!373, !58}
!633 = !{!634}
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !630, file: !21, line: 280, type: !58)
!635 = !DISubprogram(name: "PyModule_GetState", scope: !21, file: !21, line: 290, type: !636, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyModule_GetState, variables: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!110, !58}
!638 = !{!639}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !635, file: !21, line: 290, type: !58)
!640 = !DISubprogram(name: "_PyModule_Clear", scope: !21, file: !21, line: 300, type: !56, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyModule_Clear, variables: !641)
!641 = !{!642, !643}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !640, file: !21, line: 300, type: !58)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !640, file: !21, line: 302, type: !58)
!644 = !DISubprogram(name: "_PyModule_ClearDict", scope: !21, file: !21, line: 308, type: !56, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyModule_ClearDict, variables: !645)
!645 = !{!646, !647, !648, !649, !650, !658}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !644, file: !21, line: 308, type: !58)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !644, file: !21, line: 317, type: !30)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !644, file: !21, line: 318, type: !58)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !644, file: !21, line: 318, type: !58)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !651, file: !21, line: 327, type: !48)
!651 = distinct !DILexicalBlock(scope: !652, file: !21, line: 326, column: 41)
!652 = distinct !DILexicalBlock(scope: !653, file: !21, line: 326, column: 21)
!653 = distinct !DILexicalBlock(scope: !654, file: !21, line: 325, column: 1189)
!654 = distinct !DILexicalBlock(scope: !655, file: !21, line: 324, column: 17)
!655 = distinct !DILexicalBlock(scope: !656, file: !21, line: 323, column: 111)
!656 = distinct !DILexicalBlock(scope: !657, file: !21, line: 323, column: 13)
!657 = distinct !DILexicalBlock(scope: !644, file: !21, line: 322, column: 48)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !659, file: !21, line: 347, type: !48)
!659 = distinct !DILexicalBlock(scope: !660, file: !21, line: 346, column: 41)
!660 = distinct !DILexicalBlock(scope: !661, file: !21, line: 346, column: 21)
!661 = distinct !DILexicalBlock(scope: !662, file: !21, line: 345, column: 13)
!662 = distinct !DILexicalBlock(scope: !663, file: !21, line: 343, column: 17)
!663 = distinct !DILexicalBlock(scope: !664, file: !21, line: 342, column: 111)
!664 = distinct !DILexicalBlock(scope: !665, file: !21, line: 342, column: 13)
!665 = distinct !DILexicalBlock(scope: !644, file: !21, line: 341, column: 48)
!666 = !DISubprogram(name: "module_init_dict", scope: !21, file: !21, line: 32, type: !667, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*, %struct._object*, %struct._object*, %struct._object*)* @module_init_dict, variables: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{!64, !19, !58, !58, !58}
!669 = !{!670, !671, !672, !673, !674, !678}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !666, file: !21, line: 32, type: !19)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md_dict", arg: 2, scope: !666, file: !21, line: 32, type: !58)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !666, file: !21, line: 33, type: !58)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doc", arg: 4, scope: !666, file: !21, line: 33, type: !58)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !675, file: !21, line: 52, type: !58)
!675 = distinct !DILexicalBlock(scope: !676, file: !21, line: 52, column: 12)
!676 = distinct !DILexicalBlock(scope: !677, file: !21, line: 50, column: 62)
!677 = distinct !DILexicalBlock(scope: !666, file: !21, line: 50, column: 9)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !21, line: 52, type: !58)
!679 = distinct !DILexicalBlock(scope: !680, file: !21, line: 52, column: 108)
!680 = distinct !DILexicalBlock(scope: !675, file: !21, line: 52, column: 74)
!681 = !DISubprogram(name: "module_dealloc", scope: !21, file: !21, line: 388, type: !682, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyModuleObject*)* @module_dealloc, variables: !684)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !19}
!684 = !{!685, !686, !688, !691, !693}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !681, file: !21, line: 388, type: !19)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !687, file: !21, line: 398, type: !58)
!687 = distinct !DILexicalBlock(scope: !681, file: !21, line: 398, column: 8)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !689, file: !21, line: 398, type: !58)
!689 = distinct !DILexicalBlock(scope: !690, file: !21, line: 398, column: 102)
!690 = distinct !DILexicalBlock(scope: !687, file: !21, line: 398, column: 68)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !692, file: !21, line: 399, type: !58)
!692 = distinct !DILexicalBlock(scope: !681, file: !21, line: 399, column: 8)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !21, line: 399, type: !58)
!694 = distinct !DILexicalBlock(scope: !695, file: !21, line: 399, column: 102)
!695 = distinct !DILexicalBlock(scope: !692, file: !21, line: 399, column: 68)
!696 = !DISubprogram(name: "module_repr", scope: !21, file: !21, line: 406, type: !697, isLocal: true, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleObject*)* @module_repr, variables: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{!58, !19}
!699 = !{!700, !701, !702, !709, !710, !713, !715}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !696, file: !21, line: 406, type: !19)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !696, file: !21, line: 408, type: !452)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !703, file: !21, line: 408, type: !704)
!703 = distinct !DILexicalBlock(scope: !696, file: !21, line: 408, column: 61)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !11, line: 33, baseType: !706)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !11, line: 31, size: 64, align: 64, elements: !707)
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !706, file: !11, line: 32, baseType: !110, size: 64, align: 64)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !703, file: !21, line: 408, type: !110)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !703, file: !21, line: 408, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !703, file: !21, line: 408, type: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !11, line: 29, baseType: !10)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !696, file: !21, line: 409, type: !461)
!716 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !11, file: !11, line: 59, type: !717, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !722)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !719, !714}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!722 = !{!723, !724}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !716, file: !11, line: 59, type: !719)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !716, file: !11, line: 59, type: !714)
!725 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !11, file: !11, line: 51, type: !726, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !714}
!728 = !{!729}
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !725, file: !11, line: 51, type: !714)
!730 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !11, file: !11, line: 44, type: !726, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !731)
!731 = !{!732}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !730, file: !11, line: 44, type: !714)
!733 = !DISubprogram(name: "module_traverse", scope: !21, file: !21, line: 415, type: !734, isLocal: true, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*, i32 (%struct._object*, i8*)*, i8*)* @module_traverse, variables: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!64, !19, !284, !110}
!736 = !{!737, !738, !739, !740, !743}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !733, file: !21, line: 415, type: !19)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !733, file: !21, line: 415, type: !284)
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !733, file: !21, line: 415, type: !110)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !741, file: !21, line: 418, type: !64)
!741 = distinct !DILexicalBlock(scope: !742, file: !21, line: 417, column: 45)
!742 = distinct !DILexicalBlock(scope: !733, file: !21, line: 417, column: 9)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !744, file: !21, line: 422, type: !64)
!744 = distinct !DILexicalBlock(scope: !745, file: !21, line: 422, column: 26)
!745 = distinct !DILexicalBlock(scope: !746, file: !21, line: 422, column: 14)
!746 = distinct !DILexicalBlock(scope: !733, file: !21, line: 422, column: 8)
!747 = !DISubprogram(name: "module_clear", scope: !21, file: !21, line: 427, type: !748, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*)* @module_clear, variables: !750)
!748 = !DISubroutineType(types: !749)
!749 = !{!64, !19}
!750 = !{!751, !752, !755, !757}
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !747, file: !21, line: 427, type: !19)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !753, file: !21, line: 430, type: !64)
!753 = distinct !DILexicalBlock(scope: !754, file: !21, line: 429, column: 42)
!754 = distinct !DILexicalBlock(scope: !747, file: !21, line: 429, column: 9)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !756, file: !21, line: 434, type: !58)
!756 = distinct !DILexicalBlock(scope: !747, file: !21, line: 434, column: 8)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !758, file: !21, line: 434, type: !58)
!758 = distinct !DILexicalBlock(scope: !759, file: !21, line: 434, column: 115)
!759 = distinct !DILexicalBlock(scope: !760, file: !21, line: 434, column: 83)
!760 = distinct !DILexicalBlock(scope: !756, file: !21, line: 434, column: 60)
!761 = !DISubprogram(name: "module_dir", scope: !21, file: !21, line: 439, type: !147, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @module_dir, variables: !762)
!762 = !{!763, !764, !765, !766, !767, !772, !774}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !761, file: !21, line: 439, type: !58)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !761, file: !21, line: 439, type: !58)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !761, file: !21, line: 442, type: !58)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !761, file: !21, line: 443, type: !58)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !768, file: !21, line: 449, type: !48)
!768 = distinct !DILexicalBlock(scope: !769, file: !21, line: 448, column: 14)
!769 = distinct !DILexicalBlock(scope: !770, file: !21, line: 446, column: 13)
!770 = distinct !DILexicalBlock(scope: !771, file: !21, line: 445, column: 29)
!771 = distinct !DILexicalBlock(scope: !761, file: !21, line: 445, column: 9)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !773, file: !21, line: 457, type: !58)
!773 = distinct !DILexicalBlock(scope: !761, file: !21, line: 457, column: 8)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !21, line: 457, type: !58)
!775 = distinct !DILexicalBlock(scope: !776, file: !21, line: 457, column: 96)
!776 = distinct !DILexicalBlock(scope: !773, file: !21, line: 457, column: 62)
!777 = !DISubprogram(name: "module_init", scope: !21, file: !21, line: 368, type: !778, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*, %struct._object*, %struct._object*)* @module_init, variables: !780)
!778 = !DISubroutineType(types: !779)
!779 = !{!64, !19, !58, !58}
!780 = !{!781, !782, !783, !784, !785, !786}
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !777, file: !21, line: 368, type: !19)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !777, file: !21, line: 368, type: !58)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !777, file: !21, line: 368, type: !58)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !777, file: !21, line: 371, type: !58)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !777, file: !21, line: 371, type: !58)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doc", scope: !777, file: !21, line: 371, type: !58)
!787 = !{!788, !790, !791, !792, !796, !800, !808, !811}
!788 = !DIGlobalVariable(name: "PyModule_Type", scope: !0, file: !21, line: 474, type: !789, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyModule_Type)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !26, line: 422, baseType: !39)
!790 = !DIGlobalVariable(name: "max_module_number", scope: !0, file: !21, line: 7, type: !30, isLocal: true, isDefinition: true, variable: i64* @max_module_number)
!791 = !DIGlobalVariable(name: "moduledef_type", scope: !0, file: !21, line: 23, type: !789, isLocal: true, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @moduledef_type)
!792 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !21, line: 468, type: !793, isLocal: true, isDefinition: true, variable: [117 x i8]* @module_doc)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 936, align: 8, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 117)
!796 = !DIGlobalVariable(name: "module_methods", scope: !0, file: !21, line: 461, type: !797, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @module_methods)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 512, align: 64, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 2)
!800 = !DIGlobalVariable(name: "PyId___dict__", scope: !761, file: !21, line: 441, type: !801, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @module_dir.PyId___dict__)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !26, line: 144, baseType: !802)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !26, line: 140, size: 192, align: 64, elements: !803)
!803 = !{!804, !806, !807}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !802, file: !26, line: 141, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !802, file: !26, line: 142, baseType: !48, size: 64, align: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !802, file: !26, line: 143, baseType: !58, size: 64, align: 64, offset: 128)
!808 = !DIGlobalVariable(name: "module_members", scope: !0, file: !21, line: 18, type: !809, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @module_members)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 640, align: 64, elements: !798)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !312, line: 24, baseType: !311)
!811 = !DIGlobalVariable(name: "kwlist", scope: !777, file: !21, line: 370, type: !812, isLocal: true, isDefinition: true, variable: [3 x i8*]* @module_init.kwlist)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 192, align: 64, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 3)
!815 = !{i32 2, !"Dwarf Version", i32 4}
!816 = !{i32 2, !"Debug Info Version", i32 3}
!817 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!818 = !{!819, !819, i64 0}
!819 = !{!"any pointer", !820, i64 0}
!820 = !{!"omnipotent char", !821, i64 0}
!821 = !{!"Simple C/C++ TBAA"}
!822 = !DIExpression()
!823 = !DILocation(line: 61, column: 30, scope: !511)
!824 = !DILocation(line: 63, column: 5, scope: !511)
!825 = !DILocation(line: 63, column: 21, scope: !511)
!826 = !DILocation(line: 64, column: 30, scope: !511)
!827 = !DILocation(line: 64, column: 11, scope: !511)
!828 = !DILocation(line: 64, column: 7, scope: !511)
!829 = !DILocation(line: 65, column: 9, scope: !830)
!830 = distinct !DILexicalBlock(scope: !511, file: !21, line: 65, column: 9)
!831 = !DILocation(line: 65, column: 11, scope: !830)
!832 = !DILocation(line: 65, column: 9, scope: !511)
!833 = !DILocation(line: 66, column: 9, scope: !830)
!834 = !DILocation(line: 67, column: 5, scope: !511)
!835 = !DILocation(line: 67, column: 8, scope: !511)
!836 = !DILocation(line: 67, column: 15, scope: !511)
!837 = !{!838, !819, i64 24}
!838 = !{!"", !839, i64 0, !819, i64 16, !819, i64 24, !819, i64 32, !819, i64 40, !819, i64 48}
!839 = !{!"_object", !840, i64 0, !819, i64 8}
!840 = !{!"long", !820, i64 0}
!841 = !DILocation(line: 68, column: 5, scope: !511)
!842 = !DILocation(line: 68, column: 8, scope: !511)
!843 = !DILocation(line: 68, column: 17, scope: !511)
!844 = !{!838, !819, i64 32}
!845 = !DILocation(line: 69, column: 5, scope: !511)
!846 = !DILocation(line: 69, column: 8, scope: !511)
!847 = !DILocation(line: 69, column: 20, scope: !511)
!848 = !{!838, !819, i64 40}
!849 = !DILocation(line: 70, column: 5, scope: !511)
!850 = !DILocation(line: 70, column: 8, scope: !511)
!851 = !DILocation(line: 70, column: 16, scope: !511)
!852 = !{!838, !819, i64 48}
!853 = !DILocation(line: 71, column: 18, scope: !511)
!854 = !DILocation(line: 71, column: 5, scope: !511)
!855 = !DILocation(line: 71, column: 8, scope: !511)
!856 = !DILocation(line: 71, column: 16, scope: !511)
!857 = !{!838, !819, i64 16}
!858 = !DILocation(line: 72, column: 26, scope: !859)
!859 = distinct !DILexicalBlock(scope: !511, file: !21, line: 72, column: 9)
!860 = !DILocation(line: 72, column: 29, scope: !859)
!861 = !DILocation(line: 72, column: 32, scope: !859)
!862 = !DILocation(line: 72, column: 41, scope: !859)
!863 = !DILocation(line: 72, column: 9, scope: !859)
!864 = !DILocation(line: 72, column: 59, scope: !859)
!865 = !DILocation(line: 72, column: 9, scope: !511)
!866 = !DILocation(line: 73, column: 9, scope: !859)
!867 = !DILocation(line: 74, column: 23, scope: !511)
!868 = !DILocation(line: 74, column: 5, scope: !511)
!869 = !DILocation(line: 75, column: 24, scope: !511)
!870 = !DILocation(line: 75, column: 12, scope: !511)
!871 = !DILocation(line: 75, column: 5, scope: !511)
!872 = !DILocation(line: 78, column: 5, scope: !511)
!873 = !DILocation(line: 78, column: 10, scope: !874)
!874 = !DILexicalBlockFile(scope: !516, file: !21, discriminator: 1)
