; ModuleID = 'programs_new/Python-new/mpdecimal.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mpd_t = type { i8, i64, i64, i64, i64, i64* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mpd_context_t = type { i64, i64, i64, i32, i32, i32, i32, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"2.4.0\00", align 1
@mpd_pow10 = external hidden constant [0 x i64], align 8
@mpd_free = external hidden global void (i8*)*, align 8
@MPD_MINALLOC = external hidden global i64, align 8
@.str.1 = private unnamed_addr constant [4 x i8] c"NaN\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"sNaN\00", align 1
@.str.3 = private unnamed_addr constant [10 x i8] c"+Infinity\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"+Zero\00", align 1
@.str.5 = private unnamed_addr constant [8 x i8] c"+Normal\00", align 1
@.str.6 = private unnamed_addr constant [11 x i8] c"+Subnormal\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"-Infinity\00", align 1
@.str.8 = private unnamed_addr constant [6 x i8] c"-Zero\00", align 1
@.str.9 = private unnamed_addr constant [8 x i8] c"-Normal\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !36, subprograms: !69, globals: !2373)
!1 = !DIFile(filename: "mpdecimal.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !8, !21, !25, !30}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 3648, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/mpdecimal.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "NO_IDEAL_EXP", value: 0)
!7 = !DIEnumerator(name: "SET_IDEAL_EXP", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 241, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/mpdecimal.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!10 = !{!11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!11 = !DIEnumerator(name: "MPD_ROUND_UP", value: 0)
!12 = !DIEnumerator(name: "MPD_ROUND_DOWN", value: 1)
!13 = !DIEnumerator(name: "MPD_ROUND_CEILING", value: 2)
!14 = !DIEnumerator(name: "MPD_ROUND_FLOOR", value: 3)
!15 = !DIEnumerator(name: "MPD_ROUND_HALF_UP", value: 4)
!16 = !DIEnumerator(name: "MPD_ROUND_HALF_DOWN", value: 5)
!17 = !DIEnumerator(name: "MPD_ROUND_HALF_EVEN", value: 6)
!18 = !DIEnumerator(name: "MPD_ROUND_05UP", value: 7)
!19 = !DIEnumerator(name: "MPD_ROUND_TRUNC", value: 8)
!20 = !DIEnumerator(name: "MPD_ROUND_GUARD", value: 9)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 4957, size: 32, align: 32, elements: !22)
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "SKIP_FINALIZE", value: 0)
!24 = !DIEnumerator(name: "DO_FINALIZE", value: 1)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 7119, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "TO_INT_EXACT", value: 0)
!28 = !DIEnumerator(name: "TO_INT_SILENT", value: 1)
!29 = !DIEnumerator(name: "TO_INT_TRUNC", value: 2)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 71, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/constants.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "P1", value: 0)
!34 = !DIEnumerator(name: "P2", value: 1)
!35 = !DIEnumerator(name: "P3", value: 2)
!36 = !{!37, !40, !43, !47, !49, !51, !44, !50, !52, !53, !55, !56, !67}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !38, line: 48, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_uint_t", file: !9, line: 149, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !38, line: 55, baseType: !42)
!42 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_ssize_t", file: !9, line: 157, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !45, line: 197, baseType: !46)
!45 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!46 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !38, line: 51, baseType: !48)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !45, line: 196, baseType: !50)
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 62, baseType: !42)
!54 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_size_t", file: !9, line: 152, baseType: !53)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_t", file: !9, line: 379, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_t", file: !9, line: 372, size: 384, align: 64, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !9, line: 373, baseType: !37, size: 8, align: 8)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !58, file: !9, line: 374, baseType: !43, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !58, file: !9, line: 375, baseType: !43, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, file: !9, line: 376, baseType: !43, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !58, file: !9, line: 377, baseType: !43, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !9, line: 378, baseType: !66, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !38, line: 49, baseType: !68)
!68 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!69 = !{!70, !77, !82, !89, !108, !111, !116, !122, !125, !132, !137, !142, !145, !148, !151, !154, !157, !160, !163, !166, !169, !172, !175, !181, !185, !188, !191, !196, !199, !202, !205, !208, !211, !214, !217, !220, !227, !232, !240, !245, !251, !260, !266, !270, !276, !283, !286, !289, !292, !295, !298, !301, !304, !307, !310, !313, !316, !319, !323, !328, !331, !340, !346, !349, !354, !357, !364, !371, !381, !389, !397, !405, !413, !421, !427, !433, !439, !445, !451, !457, !463, !467, !475, !481, !487, !494, !501, !509, !521, !526, !533, !539, !544, !549, !558, !565, !573, !581, !592, !600, !606, !612, !621, !630, !640, !659, !665, !682, !688, !705, !725, !736, !745, !754, !771, !777, !784, !791, !801, !813, !823, !833, !842, !851, !860, !869, !876, !883, !890, !897, !904, !915, !925, !935, !945, !952, !959, !966, !973, !993, !1005, !1026, !1046, !1069, !1077, !1085, !1093, !1101, !1108, !1118, !1128, !1135, !1142, !1149, !1156, !1162, !1168, !1177, !1186, !1194, !1209, !1234, !1246, !1256, !1265, !1282, !1289, !1296, !1302, !1308, !1314, !1321, !1328, !1332, !1339, !1362, !1370, !1385, !1399, !1415, !1430, !1440, !1444, !1452, !1460, !1466, !1480, !1489, !1493, !1503, !1511, !1521, !1530, !1537, !1546, !1554, !1557, !1563, !1569, !1585, !1591, !1600, !1604, !1610, !1620, !1626, !1633, !1640, !1649, !1671, !1679, !1707, !1714, !1729, !1752, !1763, !1772, !1780, !1801, !1817, !1826, !1834, !1846, !1853, !1861, !1866, !1875, !1882, !1909, !1912, !1916, !1928, !1935, !1948, !1956, !1965, !1976, !1986, !1999, !2007, !2011, !2017, !2022, !2034, !2046, !2054, !2064, !2082, !2088, !2099, !2112, !2125, !2134, !2148, !2162, !2172, !2185, !2193, !2203, !2214, !2217, !2221, !2225, !2232, !2242, !2250, !2281, !2291, !2298, !2306, !2316, !2323, !2334, !2341, !2348, !2360}
!70 = !DISubprogram(name: "mpd_version", scope: !4, file: !4, line: 120, type: !71, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @mpd_version, variables: !76)
!71 = !DISubroutineType(types: !72)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !{}
!77 = !DISubprogram(name: "mpd_word_digits", scope: !4, file: !4, line: 133, type: !78, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64)* @mpd_word_digits, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{!50, !40}
!80 = !{!81}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "word", arg: 1, scope: !77, file: !4, line: 133, type: !40)
!82 = !DISubprogram(name: "mpd_adjexp", scope: !4, file: !4, line: 192, type: !83, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mpd_t*)* @mpd_adjexp, variables: !87)
!83 = !DISubroutineType(types: !84)
!84 = !{!43, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!87 = !{!88}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !82, file: !4, line: 192, type: !85)
!89 = !DISubprogram(name: "mpd_etiny", scope: !4, file: !4, line: 199, type: !90, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mpd_context_t*)* @mpd_etiny, variables: !106)
!90 = !DISubroutineType(types: !91)
!91 = !{!43, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_context_t", file: !9, line: 270, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_context_t", file: !9, line: 260, size: 384, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !95, file: !9, line: 261, baseType: !43, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !95, file: !9, line: 262, baseType: !43, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !95, file: !9, line: 263, baseType: !43, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !95, file: !9, line: 264, baseType: !47, size: 32, align: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !95, file: !9, line: 265, baseType: !47, size: 32, align: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "newtrap", scope: !95, file: !9, line: 266, baseType: !47, size: 32, align: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !95, file: !9, line: 267, baseType: !50, size: 32, align: 32, offset: 288)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !95, file: !9, line: 268, baseType: !50, size: 32, align: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "allcr", scope: !95, file: !9, line: 269, baseType: !50, size: 32, align: 32, offset: 352)
!106 = !{!107}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !89, file: !4, line: 199, type: !92)
!108 = !DISubprogram(name: "mpd_etop", scope: !4, file: !4, line: 206, type: !90, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mpd_context_t*)* @mpd_etop, variables: !109)
!109 = !{!110}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !108, file: !4, line: 206, type: !92)
!111 = !DISubprogram(name: "mpd_msword", scope: !4, file: !4, line: 213, type: !112, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mpd_t*)* @mpd_msword, variables: !114)
!112 = !DISubroutineType(types: !113)
!113 = !{!40, !85}
!114 = !{!115}
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !111, file: !4, line: 213, type: !85)
!116 = !DISubprogram(name: "mpd_msd", scope: !4, file: !4, line: 221, type: !117, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @mpd_msd, variables: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{!40, !40}
!119 = !{!120, !121}
!120 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "word", arg: 1, scope: !116, file: !4, line: 221, type: !40)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !116, file: !4, line: 223, type: !50)
!122 = !DISubprogram(name: "mpd_lsd", scope: !4, file: !4, line: 231, type: !117, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @mpd_lsd, variables: !123)
!123 = !{!124}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "word", arg: 1, scope: !122, file: !4, line: 231, type: !40)
!125 = !DISubprogram(name: "mpd_digits_to_size", scope: !4, file: !4, line: 238, type: !126, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @mpd_digits_to_size, variables: !128)
!126 = !DISubroutineType(types: !127)
!127 = !{!43, !43}
!128 = !{!129, !130, !131}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "digits", arg: 1, scope: !125, file: !4, line: 238, type: !43)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !125, file: !4, line: 240, type: !43)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !125, file: !4, line: 240, type: !43)
!132 = !DISubprogram(name: "mpd_exp_digits", scope: !4, file: !4, line: 248, type: !133, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64)* @mpd_exp_digits, variables: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{!50, !43}
!135 = !{!136}
!136 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exp", arg: 1, scope: !132, file: !4, line: 248, type: !43)
!137 = !DISubprogram(name: "mpd_iscanonical", scope: !4, file: !4, line: 256, type: !138, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_t*)* @mpd_iscanonical, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{!50, !85}
!140 = !{!141}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !137, file: !4, line: 256, type: !85)
!142 = !DISubprogram(name: "mpd_isfinite", scope: !4, file: !4, line: 263, type: !138, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_t*)* @mpd_isfinite, variables: !143)
!143 = !{!144}
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !142, file: !4, line: 263, type: !85)
