; ModuleID = 'irs-onlybc/multibytecodec.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !563, globals: !1376)
!1 = !DIFile(filename: "multibytecodec.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !357, !447, !465, !473, !18, !101, !404, !490, !498, !59, !499, !370, !421, !36, !507, !516, !522, !400, !532, !542, !553}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !298, line: 18, size: 320, align: 64, elements: !299)
!298 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !298, line: 19, baseType: !59, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !298, line: 20, baseType: !51, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !298, line: 21, baseType: !18, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !298, line: 22, baseType: !51, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !297, file: !298, line: 23, baseType: !59, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !59, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!12, !12, !11}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!51, !12, !12, !11}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!12, !26, !18}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!12, !26, !12, !12}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !11}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteStatefulEncoderContext", file: !359, line: 82, baseType: !360)
!359 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/multibytecodec.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!360 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 80, size: 384, align: 64, elements: !361)
!361 = !{!362, !363, !444, !445, !446}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !360, file: !359, line: 81, baseType: !13, size: 128, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !360, file: !359, line: 81, baseType: !364, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec", file: !359, line: 58, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 48, size: 576, align: 64, elements: !367)
!367 = !{!368, !369, !372, !377, !405, !410, !415, !437, !439}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !366, file: !359, line: 49, baseType: !36, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !366, file: !359, line: 50, baseType: !370, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "codecinit", scope: !366, file: !359, line: 51, baseType: !373, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbcodec_init", file: !359, line: 27, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!51, !370}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !366, file: !359, line: 52, baseType: !378, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencode_func", file: !359, line: 28, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!18, !382, !370, !51, !11, !254, !18, !403, !18, !51}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec_State", file: !359, line: 25, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_union_type, file: !359, line: 19, size: 64, align: 64, elements: !385)
!385 = !{!386, !387, !388, !393, !398}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !384, file: !359, line: 20, baseType: !11, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !384, file: !359, line: 21, baseType: !51, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !384, file: !359, line: 22, baseType: !389, size: 64, align: 8)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, align: 8, elements: !391)
!390 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!391 = !{!392}
!392 = !DISubrange(count: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !384, file: !359, line: 23, baseType: !394, size: 64, align: 16)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 64, align: 16, elements: !396)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs2_t", file: !359, line: 16, baseType: !84)
!396 = !{!397}
!397 = !DISubrange(count: 4)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "u4", scope: !384, file: !359, line: 24, baseType: !399, size: 64, align: 32)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 64, align: 32, elements: !401)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !355)
!401 = !{!402}
!402 = !DISubrange(count: 2)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "encinit", scope: !366, file: !359, line: 53, baseType: !406, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodeinit_func", file: !359, line: 34, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!51, !382, !370}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "encreset", scope: !366, file: !359, line: 54, baseType: !411, size: 64, align: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodereset_func", file: !359, line: 36, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!18, !382, !370, !403, !18}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !366, file: !359, line: 55, baseType: !416, size: 64, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecode_func", file: !359, line: 39, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!18, !382, !370, !420, !18, !423}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !425, file: !4, line: 898, baseType: !12, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !425, file: !4, line: 899, baseType: !11, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !425, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !425, file: !4, line: 901, baseType: !400, size: 32, align: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !4, line: 902, baseType: !18, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !425, file: !4, line: 903, baseType: !18, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !425, file: !4, line: 906, baseType: !18, size: 64, align: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !425, file: !4, line: 909, baseType: !400, size: 32, align: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !425, file: !4, line: 912, baseType: !390, size: 8, align: 8, offset: 416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !425, file: !4, line: 916, baseType: !390, size: 8, align: 8, offset: 424)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "decinit", scope: !366, file: !359, line: 56, baseType: !438, size: 64, align: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodeinit_func", file: !359, line: 43, baseType: !407)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "decreset", scope: !366, file: !359, line: 57, baseType: !440, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodereset_func", file: !359, line: 45, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!18, !382, !370}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !360, file: !359, line: 81, baseType: !383, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !360, file: !359, line: 81, baseType: !12, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !360, file: !359, line: 81, baseType: !12, size: 64, align: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !449)
!449 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !450)
!450 = !{!451, !452, !453, !454, !462}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !449, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !449, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !449, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !449, file: !4, line: 349, baseType: !455, size: 32, align: 32, offset: 256)
!455 = !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !4, line: 294, size: 32, align: 32, elements: !456)
!456 = !{!457, !458, !459, !460, !461}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !455, file: !4, line: 303, baseType: !355, size: 2, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !455, file: !4, line: 331, baseType: !355, size: 3, align: 32, offset: 2)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !455, file: !4, line: 336, baseType: !355, size: 1, align: 32, offset: 5)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !455, file: !4, line: 340, baseType: !355, size: 1, align: 32, offset: 6)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !455, file: !4, line: 345, baseType: !355, size: 1, align: 32, offset: 7)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !449, file: !4, line: 350, baseType: !463, size: 64, align: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !468)
!468 = !{!469, !470, !471, !472}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !467, file: !4, line: 357, baseType: !448, size: 384, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !467, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !467, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !467, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !475, file: !4, line: 369, baseType: !466, size: 576, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !4, line: 375, baseType: !479, size: 64, align: 64, offset: 576)
!479 = !DICompositeType(tag: DW_TAG_union_type, scope: !475, file: !4, line: 370, size: 64, align: 64, elements: !480)
!480 = !{!481, !482, !485, !488}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !479, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !479, file: !4, line: 372, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !390)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !479, file: !4, line: 373, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !479, file: !4, line: 374, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !492, line: 41, baseType: !493)
!492 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!493 = !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 31, size: 320, align: 64, elements: !494)
!494 = !{!495, !496, !497}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !493, file: !492, line: 32, baseType: !30, size: 192, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !493, file: !492, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !493, file: !492, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !501, line: 33, baseType: !502)
!501 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!502 = !DICompositeType(tag: DW_TAG_structure_type, file: !501, line: 25, size: 256, align: 64, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !502, file: !501, line: 26, baseType: !30, size: 192, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !502, file: !501, line: 27, baseType: !506, size: 64, align: 64, offset: 192)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteIncrementalEncoderObject", file: !359, line: 95, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 93, size: 384, align: 64, elements: !510)
!510 = !{!511, !512, !513, !514, !515}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !509, file: !359, line: 94, baseType: !13, size: 128, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !509, file: !359, line: 94, baseType: !364, size: 64, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !359, line: 94, baseType: !383, size: 64, align: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !509, file: !359, line: 94, baseType: !12, size: 64, align: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !509, file: !359, line: 94, baseType: !12, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodecObject", file: !359, line: 63, baseType: !518)
!518 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 60, size: 192, align: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !518, file: !359, line: 61, baseType: !13, size: 128, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !518, file: !359, line: 62, baseType: !364, size: 64, align: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteStatefulDecoderContext", file: !359, line: 91, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 89, size: 448, align: 64, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !524, file: !359, line: 90, baseType: !13, size: 128, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !524, file: !359, line: 90, baseType: !364, size: 64, align: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !524, file: !359, line: 90, baseType: !383, size: 64, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !524, file: !359, line: 90, baseType: !12, size: 64, align: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !524, file: !359, line: 90, baseType: !389, size: 64, align: 8, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pendingsize", scope: !524, file: !359, line: 90, baseType: !18, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteIncrementalDecoderObject", file: !359, line: 99, baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 97, size: 448, align: 64, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !534, file: !359, line: 98, baseType: !13, size: 128, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !534, file: !359, line: 98, baseType: !364, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !534, file: !359, line: 98, baseType: !383, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !534, file: !359, line: 98, baseType: !12, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !534, file: !359, line: 98, baseType: !389, size: 64, align: 8, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pendingsize", scope: !534, file: !359, line: 98, baseType: !18, size: 64, align: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteStreamReaderObject", file: !359, line: 104, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 101, size: 512, align: 64, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !544, file: !359, line: 102, baseType: !13, size: 128, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !544, file: !359, line: 102, baseType: !364, size: 64, align: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !544, file: !359, line: 102, baseType: !383, size: 64, align: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !544, file: !359, line: 102, baseType: !12, size: 64, align: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !544, file: !359, line: 102, baseType: !389, size: 64, align: 8, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pendingsize", scope: !544, file: !359, line: 102, baseType: !18, size: 64, align: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !544, file: !359, line: 103, baseType: !12, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteStreamWriterObject", file: !359, line: 109, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 106, size: 448, align: 64, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !555, file: !359, line: 107, baseType: !13, size: 128, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !555, file: !359, line: 107, baseType: !364, size: 64, align: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !555, file: !359, line: 107, baseType: !383, size: 64, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !555, file: !359, line: 107, baseType: !12, size: 64, align: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !555, file: !359, line: 107, baseType: !12, size: 64, align: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !555, file: !359, line: 108, baseType: !12, size: 64, align: 64, offset: 384)
!563 = !{!564, !577, !586, !598, !607, !676, !724, !773, !782, !798, !813, !827, !840, !866, !871, !893, !902, !914, !948, !956, !965, !988, !993, !998, !1003, !1023, !1037, !1053, !1061, !1104, !1110, !1120, !1125, !1130, !1151, !1165, !1181, !1187, !1199, !1211, !1232, !1237, !1258, !1263, !1316, !1330, !1370}
!564 = !DISubprogram(name: "PyInit__multibytecodec", scope: !565, file: !565, line: 1830, type: !566, isLocal: false, isDefinition: true, scopeLine: 1831, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__multibytecodec, variables: !568)
!565 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/multibytecodec.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!566 = !DISubroutineType(types: !567)
!567 = !{!12}
!568 = !{!569, !570, !571}
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !564, file: !565, line: 1832, type: !51)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !564, file: !565, line: 1833, type: !12)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typelist", scope: !564, file: !565, line: 1834, type: !572)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 320, align: 64, elements: !575)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !14, line: 422, baseType: !27)
!575 = !{!576}
!576 = !DISubrange(count: 5)
!577 = !DISubprogram(name: "mbiencoder_dealloc", scope: !565, file: !565, line: 973, type: !578, isLocal: true, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MultibyteIncrementalEncoderObject*)* @mbiencoder_dealloc, variables: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !507}
!580 = !{!581, !582}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !577, file: !565, line: 973, type: !507)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !565, line: 976, type: !12)
!583 = distinct !DILexicalBlock(scope: !584, file: !565, line: 976, column: 119)
!584 = distinct !DILexicalBlock(scope: !585, file: !565, line: 976, column: 14)
!585 = distinct !DILexicalBlock(scope: !577, file: !565, line: 976, column: 8)
!586 = !DISubprogram(name: "mbiencoder_traverse", scope: !565, file: !565, line: 964, type: !587, isLocal: true, isDefinition: true, scopeLine: 966, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.MultibyteIncrementalEncoderObject*, i32 (%struct._object*, i8*)*, i8*)* @mbiencoder_traverse, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!51, !507, !270, !11}
!589 = !{!590, !591, !592, !593}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !586, file: !565, line: 964, type: !507)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !586, file: !565, line: 965, type: !270)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !586, file: !565, line: 965, type: !11)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !594, file: !565, line: 968, type: !51)
!594 = distinct !DILexicalBlock(scope: !595, file: !565, line: 968, column: 32)
!595 = distinct !DILexicalBlock(scope: !596, file: !565, line: 968, column: 18)
!596 = distinct !DILexicalBlock(scope: !597, file: !565, line: 968, column: 12)
!597 = distinct !DILexicalBlock(scope: !586, file: !565, line: 967, column: 9)
!598 = !DISubprogram(name: "mbiencoder_encode", scope: !565, file: !565, line: 878, type: !599, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.MultibyteIncrementalEncoderObject*, %struct._object*, %struct._object*)* @mbiencoder_encode, variables: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{!12, !507, !12, !12}
!601 = !{!602, !603, !604, !605, !606}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !598, file: !565, line: 878, type: !507)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !598, file: !565, line: 879, type: !12)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !598, file: !565, line: 879, type: !12)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !598, file: !565, line: 881, type: !12)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !598, file: !565, line: 882, type: !51)
!607 = !DISubprogram(name: "encoder_encode_stateful", scope: !565, file: !565, line: 739, type: !608, isLocal: true, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.MultibyteStatefulEncoderContext*, %struct._object*, i32)* @encoder_encode_stateful, variables: !610)
!608 = !DISubroutineType(types: !609)
!609 = !{!12, !357, !12, !51}
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !627, !630, !632, !636, !640, !644, !646, !649, !651, !653, !656, !658, !661, !663, !666, !668, !671, !673}
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !607, file: !565, line: 739, type: !357)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unistr", arg: 2, scope: !607, file: !565, line: 740, type: !12)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "final", arg: 3, scope: !607, file: !565, line: 740, type: !51)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ucvt", scope: !607, file: !565, line: 742, type: !12)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !607, file: !565, line: 742, type: !12)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inbuf", scope: !607, file: !565, line: 743, type: !12)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpos", scope: !607, file: !565, line: 744, type: !18)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "datalen", scope: !607, file: !565, line: 744, type: !18)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origpending", scope: !607, file: !565, line: 745, type: !12)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !621, file: !565, line: 756, type: !12)
!621 = distinct !DILexicalBlock(scope: !622, file: !565, line: 756, column: 16)
!622 = distinct !DILexicalBlock(scope: !623, file: !565, line: 753, column: 90)
!623 = distinct !DILexicalBlock(scope: !624, file: !565, line: 753, column: 18)
!624 = distinct !DILexicalBlock(scope: !625, file: !565, line: 751, column: 13)
!625 = distinct !DILexicalBlock(scope: !626, file: !565, line: 749, column: 10)
!626 = distinct !DILexicalBlock(scope: !607, file: !565, line: 747, column: 9)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inbuf_tmp", scope: !628, file: !565, line: 762, type: !12)
!628 = distinct !DILexicalBlock(scope: !629, file: !565, line: 761, column: 23)
!629 = distinct !DILexicalBlock(scope: !607, file: !565, line: 761, column: 9)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !631, file: !565, line: 772, type: !12)
!631 = distinct !DILexicalBlock(scope: !628, file: !565, line: 772, column: 12)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !565, line: 772, type: !12)
!633 = distinct !DILexicalBlock(scope: !634, file: !565, line: 772, column: 123)
!634 = distinct !DILexicalBlock(scope: !635, file: !565, line: 772, column: 89)
!635 = distinct !DILexicalBlock(scope: !631, file: !565, line: 772, column: 66)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !637, file: !565, line: 791, type: !12)
!637 = distinct !DILexicalBlock(scope: !638, file: !565, line: 791, column: 12)
!638 = distinct !DILexicalBlock(scope: !639, file: !565, line: 789, column: 26)
!639 = distinct !DILexicalBlock(scope: !607, file: !565, line: 789, column: 9)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !641, file: !565, line: 791, type: !12)
!641 = distinct !DILexicalBlock(scope: !642, file: !565, line: 791, column: 123)
!642 = distinct !DILexicalBlock(scope: !643, file: !565, line: 791, column: 89)
!643 = distinct !DILexicalBlock(scope: !637, file: !565, line: 791, column: 66)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !645, file: !565, line: 796, type: !12)
!645 = distinct !DILexicalBlock(scope: !607, file: !565, line: 796, column: 8)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !565, line: 796, type: !12)
!647 = distinct !DILexicalBlock(scope: !648, file: !565, line: 796, column: 103)
!648 = distinct !DILexicalBlock(scope: !645, file: !565, line: 796, column: 69)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !650, file: !565, line: 812, type: !12)
!650 = distinct !DILexicalBlock(scope: !607, file: !565, line: 812, column: 8)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !652, file: !565, line: 813, type: !12)
!652 = distinct !DILexicalBlock(scope: !607, file: !565, line: 813, column: 8)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !654, file: !565, line: 813, type: !12)
!654 = distinct !DILexicalBlock(scope: !655, file: !565, line: 813, column: 96)
!655 = distinct !DILexicalBlock(scope: !652, file: !565, line: 813, column: 62)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !657, file: !565, line: 817, type: !12)
!657 = distinct !DILexicalBlock(scope: !607, file: !565, line: 817, column: 8)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !659, file: !565, line: 817, type: !12)
!659 = distinct !DILexicalBlock(scope: !660, file: !565, line: 817, column: 93)
!660 = distinct !DILexicalBlock(scope: !657, file: !565, line: 817, column: 59)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !662, file: !565, line: 818, type: !12)
!662 = distinct !DILexicalBlock(scope: !607, file: !565, line: 818, column: 8)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !664, file: !565, line: 818, type: !12)
!664 = distinct !DILexicalBlock(scope: !665, file: !565, line: 818, column: 96)
!665 = distinct !DILexicalBlock(scope: !662, file: !565, line: 818, column: 62)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !667, file: !565, line: 819, type: !12)
!667 = distinct !DILexicalBlock(scope: !607, file: !565, line: 819, column: 8)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !565, line: 819, type: !12)
!669 = distinct !DILexicalBlock(scope: !670, file: !565, line: 819, column: 103)
!670 = distinct !DILexicalBlock(scope: !667, file: !565, line: 819, column: 69)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !672, file: !565, line: 820, type: !12)
!672 = distinct !DILexicalBlock(scope: !607, file: !565, line: 820, column: 8)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !674, file: !565, line: 820, type: !12)
!674 = distinct !DILexicalBlock(scope: !675, file: !565, line: 820, column: 97)
!675 = distinct !DILexicalBlock(scope: !672, file: !565, line: 820, column: 63)
!676 = !DISubprogram(name: "multibytecodec_encode", scope: !565, file: !565, line: 467, type: !677, isLocal: true, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.MultibyteCodec*, %union.MultibyteCodec_State*, %struct._object*, i64*, %struct._object*, i32)* @multibytecodec_encode, variables: !679)
!677 = !DISubroutineType(types: !678)
!678 = !{!12, !364, !382, !12, !254, !12, !51}
!679 = !{!680, !681, !682, !683, !684, !685, !686, !697, !698, !699, !700, !701, !702, !704, !709, !711, !714, !716, !719, !721}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec", arg: 1, scope: !676, file: !565, line: 467, type: !364)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !676, file: !565, line: 468, type: !382)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 3, scope: !676, file: !565, line: 469, type: !12)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos_t", arg: 4, scope: !676, file: !565, line: 469, type: !254)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 5, scope: !676, file: !565, line: 470, type: !12)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 6, scope: !676, file: !565, line: 470, type: !51)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !676, file: !565, line: 472, type: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteEncodeBuffer", file: !565, line: 17, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 12, size: 448, align: 64, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "inobj", scope: !688, file: !565, line: 13, baseType: !12, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "inpos", scope: !688, file: !565, line: 14, baseType: !18, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "inlen", scope: !688, file: !565, line: 14, baseType: !18, size: 64, align: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "outbuf", scope: !688, file: !565, line: 15, baseType: !404, size: 64, align: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "outbuf_end", scope: !688, file: !565, line: 15, baseType: !404, size: 64, align: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "excobj", scope: !688, file: !565, line: 16, baseType: !12, size: 64, align: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "outobj", scope: !688, file: !565, line: 16, baseType: !12, size: 64, align: 64, offset: 384)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "finalsize", scope: !676, file: !565, line: 473, type: !18)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !676, file: !565, line: 473, type: !18)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "datalen", scope: !676, file: !565, line: 474, type: !18)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !676, file: !565, line: 475, type: !51)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !676, file: !565, line: 476, type: !11)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outleft", scope: !703, file: !565, line: 507, type: !18)
!703 = distinct !DILexicalBlock(scope: !676, file: !565, line: 504, column: 35)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outleft", scope: !705, file: !565, line: 523, type: !18)
!705 = distinct !DILexicalBlock(scope: !706, file: !565, line: 522, column: 18)
!706 = distinct !DILexicalBlock(scope: !707, file: !565, line: 522, column: 9)
!707 = distinct !DILexicalBlock(scope: !708, file: !565, line: 522, column: 9)
!708 = distinct !DILexicalBlock(scope: !676, file: !565, line: 521, column: 9)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !710, file: !565, line: 544, type: !12)
!710 = distinct !DILexicalBlock(scope: !676, file: !565, line: 544, column: 8)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !565, line: 544, type: !12)
!712 = distinct !DILexicalBlock(scope: !713, file: !565, line: 544, column: 102)
!713 = distinct !DILexicalBlock(scope: !710, file: !565, line: 544, column: 68)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !715, file: !565, line: 548, type: !12)
!715 = distinct !DILexicalBlock(scope: !676, file: !565, line: 548, column: 8)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !717, file: !565, line: 548, type: !12)
!717 = distinct !DILexicalBlock(scope: !718, file: !565, line: 548, column: 102)
!718 = distinct !DILexicalBlock(scope: !715, file: !565, line: 548, column: 68)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !720, file: !565, line: 549, type: !12)
!720 = distinct !DILexicalBlock(scope: !676, file: !565, line: 549, column: 8)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !565, line: 549, type: !12)
!722 = distinct !DILexicalBlock(scope: !723, file: !565, line: 549, column: 102)
!723 = distinct !DILexicalBlock(scope: !720, file: !565, line: 549, column: 68)
!724 = !DISubprogram(name: "multibytecodec_encerror", scope: !565, file: !565, line: 209, type: !725, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.MultibyteCodec*, %union.MultibyteCodec_State*, %struct.MultibyteEncodeBuffer*, %struct._object*, i64)* @multibytecodec_encerror, variables: !728)
!725 = !DISubroutineType(types: !726)
!726 = !{!51, !364, !382, !727, !12, !18}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !746, !747, !748, !749, !750, !754, !756, !759, !761, !763, !765, !768, !770}
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec", arg: 1, scope: !724, file: !565, line: 209, type: !364)
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !724, file: !565, line: 210, type: !382)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 3, scope: !724, file: !565, line: 211, type: !727)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 4, scope: !724, file: !565, line: 212, type: !12)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 5, scope: !724, file: !565, line: 212, type: !18)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retobj", scope: !724, file: !565, line: 214, type: !12)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retstr", scope: !724, file: !565, line: 214, type: !12)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tobj", scope: !724, file: !565, line: 214, type: !12)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retstrsize", scope: !724, file: !565, line: 215, type: !18)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newpos", scope: !724, file: !565, line: 215, type: !18)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "esize", scope: !724, file: !565, line: 216, type: !18)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !724, file: !565, line: 216, type: !18)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !724, file: !565, line: 216, type: !18)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reason", scope: !724, file: !565, line: 217, type: !36)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "replchar", scope: !744, file: !565, line: 244, type: !12)
!744 = distinct !DILexicalBlock(scope: !745, file: !565, line: 243, column: 36)
!745 = distinct !DILexicalBlock(scope: !724, file: !565, line: 243, column: 9)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !744, file: !565, line: 245, type: !18)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpos", scope: !744, file: !565, line: 246, type: !18)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !744, file: !565, line: 247, type: !51)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !744, file: !565, line: 248, type: !11)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outleft", scope: !751, file: !565, line: 258, type: !18)
!751 = distinct !DILexicalBlock(scope: !752, file: !565, line: 257, column: 18)
!752 = distinct !DILexicalBlock(scope: !753, file: !565, line: 257, column: 9)
!753 = distinct !DILexicalBlock(scope: !744, file: !565, line: 257, column: 9)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !565, line: 271, type: !12)
!755 = distinct !DILexicalBlock(scope: !744, file: !565, line: 271, column: 12)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inpos", scope: !757, file: !565, line: 320, type: !18)
!757 = distinct !DILexicalBlock(scope: !758, file: !565, line: 319, column: 78)
!758 = distinct !DILexicalBlock(scope: !724, file: !565, line: 319, column: 9)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !565, line: 352, type: !12)
!760 = distinct !DILexicalBlock(scope: !724, file: !565, line: 352, column: 8)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !565, line: 353, type: !12)
!762 = distinct !DILexicalBlock(scope: !724, file: !565, line: 353, column: 8)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !764, file: !565, line: 357, type: !12)
!764 = distinct !DILexicalBlock(scope: !724, file: !565, line: 357, column: 8)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !565, line: 357, type: !12)
!766 = distinct !DILexicalBlock(scope: !767, file: !565, line: 357, column: 98)
!767 = distinct !DILexicalBlock(scope: !764, file: !565, line: 357, column: 64)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !769, file: !565, line: 358, type: !12)
!769 = distinct !DILexicalBlock(scope: !724, file: !565, line: 358, column: 8)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !771, file: !565, line: 358, type: !12)
!771 = distinct !DILexicalBlock(scope: !772, file: !565, line: 358, column: 98)
!772 = distinct !DILexicalBlock(scope: !769, file: !565, line: 358, column: 64)
!773 = !DISubprogram(name: "expand_encodebuffer", scope: !565, file: !565, line: 176, type: !774, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.MultibyteEncodeBuffer*, i64)* @expand_encodebuffer, variables: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{!51, !727, !18}
!776 = !{!777, !778, !779, !780, !781}
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !773, file: !565, line: 176, type: !727)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "esize", arg: 2, scope: !773, file: !565, line: 176, type: !18)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orgpos", scope: !773, file: !565, line: 178, type: !18)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orgsize", scope: !773, file: !565, line: 178, type: !18)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incsize", scope: !773, file: !565, line: 178, type: !18)
!782 = !DISubprogram(name: "call_error_callback", scope: !565, file: !565, line: 95, type: !133, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @call_error_callback, variables: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !794, !796}
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 1, scope: !782, file: !565, line: 95, type: !12)
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 2, scope: !782, file: !565, line: 95, type: !12)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !782, file: !565, line: 97, type: !12)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !782, file: !565, line: 97, type: !12)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !782, file: !565, line: 97, type: !12)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !782, file: !565, line: 98, type: !36)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !791, file: !565, line: 110, type: !12)
!791 = distinct !DILexicalBlock(scope: !792, file: !565, line: 110, column: 12)
!792 = distinct !DILexicalBlock(scope: !793, file: !565, line: 109, column: 29)
!793 = distinct !DILexicalBlock(scope: !782, file: !565, line: 109, column: 9)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !795, file: !565, line: 118, type: !12)
!795 = distinct !DILexicalBlock(scope: !782, file: !565, line: 118, column: 8)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !565, line: 119, type: !12)
!797 = distinct !DILexicalBlock(scope: !782, file: !565, line: 119, column: 8)
!798 = !DISubprogram(name: "mbiencoder_reset", scope: !565, file: !565, line: 892, type: !799, isLocal: true, isDefinition: true, scopeLine: 893, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.MultibyteIncrementalEncoderObject*)* @mbiencoder_reset, variables: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{!12, !507}
!801 = !{!802, !803, !805, !806, !807, !809}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !798, file: !565, line: 892, type: !507)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !798, file: !565, line: 895, type: !804)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 32, align: 8, elements: !396)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outbuf", scope: !798, file: !565, line: 895, type: !404)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !798, file: !565, line: 896, type: !18)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !808, file: !565, line: 904, type: !12)
!808 = distinct !DILexicalBlock(scope: !798, file: !565, line: 904, column: 8)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !810, file: !565, line: 904, type: !12)
!810 = distinct !DILexicalBlock(scope: !811, file: !565, line: 904, column: 121)
!811 = distinct !DILexicalBlock(scope: !812, file: !565, line: 904, column: 86)
!812 = distinct !DILexicalBlock(scope: !808, file: !565, line: 904, column: 63)
!813 = !DISubprogram(name: "codecctx_errors_get", scope: !565, file: !565, line: 124, type: !814, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.MultibyteStatefulCodecContext*)* @codecctx_errors_get, variables: !824)
!814 = !DISubroutineType(types: !815)
!815 = !{!12, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteStatefulCodecContext", file: !359, line: 74, baseType: !818)
!818 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 72, size: 320, align: 64, elements: !819)
!819 = !{!820, !821, !822, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !818, file: !359, line: 73, baseType: !13, size: 128, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !818, file: !359, line: 73, baseType: !364, size: 64, align: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !818, file: !359, line: 73, baseType: !383, size: 64, align: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !818, file: !359, line: 73, baseType: !12, size: 64, align: 64, offset: 256)
!824 = !{!825, !826}
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !813, file: !565, line: 124, type: !816)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !813, file: !565, line: 126, type: !36)
!827 = !DISubprogram(name: "codecctx_errors_set", scope: !565, file: !565, line: 143, type: !828, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.MultibyteStatefulCodecContext*, %struct._object*, i8*)* @codecctx_errors_set, variables: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!51, !816, !12, !11}
!830 = !{!831, !832, !833, !834, !835, !836}
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !827, file: !565, line: 143, type: !816)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !827, file: !565, line: 143, type: !12)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 3, scope: !827, file: !565, line: 144, type: !11)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !827, file: !565, line: 146, type: !12)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !827, file: !565, line: 147, type: !36)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !565, line: 162, type: !12)
!837 = distinct !DILexicalBlock(scope: !838, file: !565, line: 162, column: 119)
!838 = distinct !DILexicalBlock(scope: !839, file: !565, line: 162, column: 14)
!839 = distinct !DILexicalBlock(scope: !827, file: !565, line: 162, column: 8)
!840 = !DISubprogram(name: "internal_error_callback", scope: !565, file: !565, line: 82, type: !841, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @internal_error_callback, variables: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!12, !36}
!843 = !{!844, !845, !848, !849, !851, !852, !855, !856, !858, !859, !862, !863, !865}
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 1, scope: !840, file: !565, line: 82, type: !36)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !846, file: !565, line: 84, type: !101)
!846 = distinct !DILexicalBlock(scope: !847, file: !565, line: 84, column: 48)
!847 = distinct !DILexicalBlock(scope: !840, file: !565, line: 84, column: 9)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !846, file: !565, line: 84, type: !101)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !850, file: !565, line: 84, type: !421)
!850 = distinct !DILexicalBlock(scope: !846, file: !565, line: 84, column: 1645)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !850, file: !565, line: 84, type: !51)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !853, file: !565, line: 86, type: !101)
!853 = distinct !DILexicalBlock(scope: !854, file: !565, line: 86, column: 29)
!854 = distinct !DILexicalBlock(scope: !847, file: !565, line: 86, column: 14)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !853, file: !565, line: 86, type: !101)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !857, file: !565, line: 86, type: !421)
!857 = distinct !DILexicalBlock(scope: !853, file: !565, line: 86, column: 1626)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !857, file: !565, line: 86, type: !51)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !860, file: !565, line: 88, type: !101)
!860 = distinct !DILexicalBlock(scope: !861, file: !565, line: 88, column: 29)
!861 = distinct !DILexicalBlock(scope: !854, file: !565, line: 88, column: 14)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !860, file: !565, line: 88, type: !101)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !864, file: !565, line: 88, type: !421)
!864 = distinct !DILexicalBlock(scope: !860, file: !565, line: 88, column: 1641)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !864, file: !565, line: 88, type: !51)
!866 = !DISubprogram(name: "mbiencoder_init", scope: !565, file: !565, line: 958, type: !218, isLocal: true, isDefinition: true, scopeLine: 959, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @mbiencoder_init, variables: !867)
!867 = !{!868, !869, !870}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !866, file: !565, line: 958, type: !12)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !866, file: !565, line: 958, type: !12)
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !866, file: !565, line: 958, type: !12)
!871 = !DISubprogram(name: "mbiencoder_new", scope: !565, file: !565, line: 917, type: !872, isLocal: true, isDefinition: true, scopeLine: 918, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @mbiencoder_new, variables: !874)
!872 = !DISubroutineType(types: !873)
!873 = !{!12, !573, !12, !12}
!874 = !{!875, !876, !877, !878, !879, !880, !881, !883, !885, !888, !890}
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !871, file: !565, line: 917, type: !573)
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !871, file: !565, line: 917, type: !12)
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !871, file: !565, line: 917, type: !12)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !871, file: !565, line: 919, type: !507)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !871, file: !565, line: 920, type: !12)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !871, file: !565, line: 921, type: !59)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !882, file: !565, line: 948, type: !12)
!882 = distinct !DILexicalBlock(scope: !871, file: !565, line: 948, column: 8)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !884, file: !565, line: 952, type: !12)
!884 = distinct !DILexicalBlock(scope: !871, file: !565, line: 952, column: 8)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !565, line: 952, type: !12)
!886 = distinct !DILexicalBlock(scope: !887, file: !565, line: 952, column: 96)
!887 = distinct !DILexicalBlock(scope: !884, file: !565, line: 952, column: 62)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !889, file: !565, line: 953, type: !12)
!889 = distinct !DILexicalBlock(scope: !871, file: !565, line: 953, column: 8)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !891, file: !565, line: 953, type: !12)
!891 = distinct !DILexicalBlock(scope: !892, file: !565, line: 953, column: 97)
!892 = distinct !DILexicalBlock(scope: !889, file: !565, line: 953, column: 63)
!893 = !DISubprogram(name: "mbidecoder_dealloc", scope: !565, file: !565, line: 1185, type: !894, isLocal: true, isDefinition: true, scopeLine: 1186, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.MultibyteIncrementalDecoderObject*)* @mbidecoder_dealloc, variables: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !532}
!896 = !{!897, !898}
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !893, file: !565, line: 1185, type: !532)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !565, line: 1188, type: !12)
!899 = distinct !DILexicalBlock(scope: !900, file: !565, line: 1188, column: 119)
!900 = distinct !DILexicalBlock(scope: !901, file: !565, line: 1188, column: 14)
!901 = distinct !DILexicalBlock(scope: !893, file: !565, line: 1188, column: 8)
!902 = !DISubprogram(name: "mbidecoder_traverse", scope: !565, file: !565, line: 1176, type: !903, isLocal: true, isDefinition: true, scopeLine: 1178, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.MultibyteIncrementalDecoderObject*, i32 (%struct._object*, i8*)*, i8*)* @mbidecoder_traverse, variables: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!51, !532, !270, !11}
!905 = !{!906, !907, !908, !909}
!906 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !902, file: !565, line: 1176, type: !532)
!907 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !902, file: !565, line: 1177, type: !270)
!908 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !902, file: !565, line: 1177, type: !11)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !910, file: !565, line: 1180, type: !51)
!910 = distinct !DILexicalBlock(scope: !911, file: !565, line: 1180, column: 32)
!911 = distinct !DILexicalBlock(scope: !912, file: !565, line: 1180, column: 18)
!912 = distinct !DILexicalBlock(scope: !913, file: !565, line: 1180, column: 12)
!913 = distinct !DILexicalBlock(scope: !902, file: !565, line: 1179, column: 9)
!914 = !DISubprogram(name: "mbidecoder_decode", scope: !565, file: !565, line: 1029, type: !915, isLocal: true, isDefinition: true, scopeLine: 1031, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.MultibyteIncrementalDecoderObject*, %struct._object*, %struct._object*)* @mbidecoder_decode, variables: !917)
!915 = !DISubroutineType(types: !916)
!916 = !{!12, !532, !12, !12}
!917 = !{!918, !919, !920, !921, !930, !931, !932, !933, !934, !935, !936, !937, !938, !940, !943, !945}
!918 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !914, file: !565, line: 1029, type: !532)
!919 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !914, file: !565, line: 1030, type: !12)
!920 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !914, file: !565, line: 1030, type: !12)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !914, file: !565, line: 1032, type: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteDecodeBuffer", file: !565, line: 23, baseType: !923)
!923 = !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 19, size: 704, align: 64, elements: !924)
!924 = !{!925, !926, !927, !928, !929}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "inbuf", scope: !923, file: !565, line: 20, baseType: !421, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "inbuf_top", scope: !923, file: !565, line: 20, baseType: !421, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "inbuf_end", scope: !923, file: !565, line: 20, baseType: !421, size: 64, align: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "excobj", scope: !923, file: !565, line: 21, baseType: !12, size: 64, align: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "writer", scope: !923, file: !565, line: 22, baseType: !424, size: 448, align: 64, offset: 256)
!930 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !914, file: !565, line: 1033, type: !59)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wdata", scope: !914, file: !565, line: 1033, type: !59)
!932 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdata", scope: !914, file: !565, line: 1034, type: !243)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wsize", scope: !914, file: !565, line: 1035, type: !18)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !914, file: !565, line: 1035, type: !18)
