; ModuleID = 'irs-onlybc/nismodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!4 = !DIFile(filename: "/usr/include/rpcsvc/yp_prot.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!6 = !DIEnumerator(name: "YP_TRUE", value: 1)
!7 = !DIEnumerator(name: "YP_NOMORE", value: 2)
!8 = !DIEnumerator(name: "YP_FALSE", value: 0)
!9 = !DIEnumerator(name: "YP_NOMAP", value: -1)
!10 = !DIEnumerator(name: "YP_NODOM", value: -2)
!11 = !DIEnumerator(name: "YP_NOKEY", value: -3)
!12 = !DIEnumerator(name: "YP_BADOP", value: -4)
!13 = !DIEnumerator(name: "YP_BADDB", value: -5)
!14 = !DIEnumerator(name: "YP_YPERR", value: -6)
!15 = !DIEnumerator(name: "YP_BADARGS", value: -7)
!16 = !DIEnumerator(name: "YP_VERS", value: -8)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nisstat", file: !18, line: 248, size: 32, align: 32, elements: !19)
!18 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/nismodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "NIS_TRUE", value: 1)
!21 = !DIEnumerator(name: "NIS_NOMORE", value: 2)
!22 = !DIEnumerator(name: "NIS_FALSE", value: 0)
!23 = !DIEnumerator(name: "NIS_NOMAP", value: -1)
!24 = !DIEnumerator(name: "NIS_NODOM", value: -2)
!25 = !DIEnumerator(name: "NIS_NOKEY", value: -3)
!26 = !DIEnumerator(name: "NIS_BADOP", value: -4)
!27 = !DIEnumerator(name: "NIS_BADDB", value: -5)
!28 = !DIEnumerator(name: "NIS_YPERR", value: -6)
!29 = !DIEnumerator(name: "NIS_BADARGS", value: -7)
!30 = !DIEnumerator(name: "NIS_VERS", value: -8)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !32, line: 81, size: 32, align: 32, elements: !33)
!32 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!35 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!36 = !DIEnumerator(name: "XDR_FREE", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clnt_stat", file: !38, line: 50, size: 32, align: 32, elements: !39)
!38 = !DIFile(filename: "/usr/include/rpc/clnt.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!40 = !DIEnumerator(name: "RPC_SUCCESS", value: 0)
!41 = !DIEnumerator(name: "RPC_CANTENCODEARGS", value: 1)
!42 = !DIEnumerator(name: "RPC_CANTDECODERES", value: 2)
!43 = !DIEnumerator(name: "RPC_CANTSEND", value: 3)
!44 = !DIEnumerator(name: "RPC_CANTRECV", value: 4)
!45 = !DIEnumerator(name: "RPC_TIMEDOUT", value: 5)
!46 = !DIEnumerator(name: "RPC_VERSMISMATCH", value: 6)
!47 = !DIEnumerator(name: "RPC_AUTHERROR", value: 7)
!48 = !DIEnumerator(name: "RPC_PROGUNAVAIL", value: 8)
!49 = !DIEnumerator(name: "RPC_PROGVERSMISMATCH", value: 9)
!50 = !DIEnumerator(name: "RPC_PROCUNAVAIL", value: 10)
!51 = !DIEnumerator(name: "RPC_CANTDECODEARGS", value: 11)
!52 = !DIEnumerator(name: "RPC_SYSTEMERROR", value: 12)
!53 = !DIEnumerator(name: "RPC_NOBROADCAST", value: 21)
!54 = !DIEnumerator(name: "RPC_UNKNOWNHOST", value: 13)
!55 = !DIEnumerator(name: "RPC_UNKNOWNPROTO", value: 17)
!56 = !DIEnumerator(name: "RPC_UNKNOWNADDR", value: 19)
!57 = !DIEnumerator(name: "RPC_RPCBFAILURE", value: 14)
!58 = !DIEnumerator(name: "RPC_PROGNOTREGISTERED", value: 15)
!59 = !DIEnumerator(name: "RPC_N2AXLATEFAILURE", value: 22)
!60 = !DIEnumerator(name: "RPC_FAILED", value: 16)
!61 = !DIEnumerator(name: "RPC_INTR", value: 18)
!62 = !DIEnumerator(name: "RPC_TLIERROR", value: 20)
!63 = !DIEnumerator(name: "RPC_UDERROR", value: 23)
!64 = !DIEnumerator(name: "RPC_INPROGRESS", value: 24)
!65 = !DIEnumerator(name: "RPC_STALERACHANDLE", value: 25)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "auth_stat", file: !67, line: 52, size: 32, align: 32, elements: !68)
!67 = !DIFile(filename: "/usr/include/rpc/auth.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76}
!69 = !DIEnumerator(name: "AUTH_OK", value: 0)
!70 = !DIEnumerator(name: "AUTH_BADCRED", value: 1)
!71 = !DIEnumerator(name: "AUTH_REJECTEDCRED", value: 2)
!72 = !DIEnumerator(name: "AUTH_BADVERF", value: 3)
!73 = !DIEnumerator(name: "AUTH_REJECTEDVERF", value: 4)
!74 = !DIEnumerator(name: "AUTH_TOOWEAK", value: 5)
!75 = !DIEnumerator(name: "AUTH_INVALIDRESP", value: 6)
!76 = !DIEnumerator(name: "AUTH_FAILED", value: 7)
!77 = !{!78, !79, !417, !126, !421, !451, !494, !495}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !81, line: 109, baseType: !82)
!81 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !81, line: 105, size: 128, align: 64, elements: !83)
!83 = !{!84, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !82, file: !81, line: 107, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !86, line: 177, baseType: !87)
!86 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !88, line: 102, baseType: !89)
!88 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !90, line: 181, baseType: !91)
!90 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!91 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !82, file: !81, line: 108, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !81, line: 334, size: 3200, align: 64, elements: !95)
!95 = !{!96, !102, !106, !107, !108, !113, !176, !181, !186, !187, !192, !244, !275, !287, !293, !294, !295, !297, !299, !330, !331, !332, !341, !342, !347, !348, !350, !352, !362, !365, !383, !384, !385, !387, !389, !390, !392, !397, !402, !407, !408, !409, !410, !411, !412, !413, !414, !416}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !94, file: !81, line: 335, baseType: !97, size: 192, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !81, line: 114, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 111, size: 192, align: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !98, file: !81, line: 112, baseType: !80, size: 128, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !98, file: !81, line: 113, baseType: !85, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !94, file: !81, line: 336, baseType: !103, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !94, file: !81, line: 337, baseType: !85, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !94, file: !81, line: 337, baseType: !85, size: 64, align: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !94, file: !81, line: 341, baseType: !109, size: 64, align: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !81, line: 308, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !79}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !94, file: !81, line: 342, baseType: !114, size: 64, align: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !81, line: 314, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !79, !119, !118}
!118 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 48, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !122, line: 246, size: 1728, align: 64, elements: !123)
!122 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!123 = !{!124, !125, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !145, !146, !147, !148, !150, !152, !154, !158, !161, !163, !164, !165, !166, !167, !171, !172}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !121, file: !122, line: 247, baseType: !118, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !121, file: !122, line: 252, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !121, file: !122, line: 253, baseType: !126, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !121, file: !122, line: 254, baseType: !126, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !121, file: !122, line: 255, baseType: !126, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !121, file: !122, line: 256, baseType: !126, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !121, file: !122, line: 257, baseType: !126, size: 64, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !121, file: !122, line: 258, baseType: !126, size: 64, align: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !121, file: !122, line: 259, baseType: !126, size: 64, align: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !121, file: !122, line: 261, baseType: !126, size: 64, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !121, file: !122, line: 262, baseType: !126, size: 64, align: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !121, file: !122, line: 263, baseType: !126, size: 64, align: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !121, file: !122, line: 265, baseType: !138, size: 64, align: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !122, line: 161, size: 192, align: 64, elements: !140)
!140 = !{!141, !142, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !139, file: !122, line: 162, baseType: !138, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !139, file: !122, line: 163, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !139, file: !122, line: 167, baseType: !118, size: 32, align: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !121, file: !122, line: 267, baseType: !143, size: 64, align: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !121, file: !122, line: 269, baseType: !118, size: 32, align: 32, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !121, file: !122, line: 273, baseType: !118, size: 32, align: 32, offset: 928)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !121, file: !122, line: 275, baseType: !149, size: 64, align: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 140, baseType: !91)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !121, file: !122, line: 279, baseType: !151, size: 16, align: 16, offset: 1024)
!151 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !121, file: !122, line: 280, baseType: !153, size: 8, align: 8, offset: 1040)
!153 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !121, file: !122, line: 281, baseType: !155, size: 8, align: 8, offset: 1048)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 8, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 1)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !121, file: !122, line: 285, baseType: !159, size: 64, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !122, line: 155, baseType: null)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !121, file: !122, line: 294, baseType: !162, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 141, baseType: !91)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !121, file: !122, line: 303, baseType: !78, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !121, file: !122, line: 304, baseType: !78, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !121, file: !122, line: 305, baseType: !78, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !121, file: !122, line: 306, baseType: !78, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !121, file: !122, line: 307, baseType: !168, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !169, line: 62, baseType: !170)
!169 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!170 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !121, file: !122, line: 309, baseType: !118, size: 32, align: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !121, file: !122, line: 311, baseType: !173, size: 160, align: 8, offset: 1568)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 160, align: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !94, file: !81, line: 343, baseType: !177, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !81, line: 316, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!79, !79, !126}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !94, file: !81, line: 344, baseType: !182, size: 64, align: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !81, line: 318, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!118, !79, !126, !79}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !94, file: !81, line: 345, baseType: !78, size: 64, align: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !94, file: !81, line: 346, baseType: !188, size: 64, align: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !81, line: 320, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!79, !79}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !94, file: !81, line: 350, baseType: !193, size: 64, align: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !81, line: 278, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 236, size: 2176, align: 64, elements: !196)
!196 = !{!197, !202, !203, !204, !205, !206, !211, !213, !214, !215, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !195, file: !81, line: 241, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !81, line: 166, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!79, !79, !79}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !195, file: !81, line: 242, baseType: !198, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !195, file: !81, line: 243, baseType: !198, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !195, file: !81, line: 244, baseType: !198, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !195, file: !81, line: 245, baseType: !198, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !195, file: !81, line: 246, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !81, line: 167, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!79, !79, !79, !79}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !195, file: !81, line: 247, baseType: !212, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !81, line: 165, baseType: !189)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !195, file: !81, line: 248, baseType: !212, size: 64, align: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !195, file: !81, line: 249, baseType: !212, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !195, file: !81, line: 250, baseType: !216, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !81, line: 168, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!118, !79}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !195, file: !81, line: 251, baseType: !212, size: 64, align: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !195, file: !81, line: 252, baseType: !198, size: 64, align: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !195, file: !81, line: 253, baseType: !198, size: 64, align: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !195, file: !81, line: 254, baseType: !198, size: 64, align: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !195, file: !81, line: 255, baseType: !198, size: 64, align: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !195, file: !81, line: 256, baseType: !198, size: 64, align: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !195, file: !81, line: 257, baseType: !212, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !195, file: !81, line: 258, baseType: !78, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !195, file: !81, line: 259, baseType: !212, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !195, file: !81, line: 261, baseType: !198, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !195, file: !81, line: 262, baseType: !198, size: 64, align: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !195, file: !81, line: 263, baseType: !198, size: 64, align: 64, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !195, file: !81, line: 264, baseType: !198, size: 64, align: 64, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !195, file: !81, line: 265, baseType: !207, size: 64, align: 64, offset: 1472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !195, file: !81, line: 266, baseType: !198, size: 64, align: 64, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !195, file: !81, line: 267, baseType: !198, size: 64, align: 64, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !195, file: !81, line: 268, baseType: !198, size: 64, align: 64, offset: 1664)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !195, file: !81, line: 269, baseType: !198, size: 64, align: 64, offset: 1728)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !195, file: !81, line: 270, baseType: !198, size: 64, align: 64, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !195, file: !81, line: 272, baseType: !198, size: 64, align: 64, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !195, file: !81, line: 273, baseType: !198, size: 64, align: 64, offset: 1920)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !195, file: !81, line: 274, baseType: !198, size: 64, align: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !195, file: !81, line: 275, baseType: !198, size: 64, align: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !195, file: !81, line: 277, baseType: !212, size: 64, align: 64, offset: 2112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !94, file: !81, line: 351, baseType: !245, size: 64, align: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !81, line: 292, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 280, size: 640, align: 64, elements: !248)
!248 = !{!249, !254, !255, !260, !261, !262, !267, !268, !273, !274}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !247, file: !81, line: 281, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !81, line: 169, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!85, !79}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !247, file: !81, line: 282, baseType: !198, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !247, file: !81, line: 283, baseType: !256, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !81, line: 170, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!79, !79, !85}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !247, file: !81, line: 284, baseType: !256, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !247, file: !81, line: 285, baseType: !78, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !247, file: !81, line: 286, baseType: !263, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !81, line: 172, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!118, !79, !85, !79}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !247, file: !81, line: 287, baseType: !78, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !247, file: !81, line: 288, baseType: !269, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !81, line: 231, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!118, !79, !79}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !247, file: !81, line: 290, baseType: !198, size: 64, align: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !247, file: !81, line: 291, baseType: !256, size: 64, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !94, file: !81, line: 352, baseType: !276, size: 64, align: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !81, line: 298, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 294, size: 192, align: 64, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !278, file: !81, line: 295, baseType: !250, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !278, file: !81, line: 296, baseType: !198, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !278, file: !81, line: 297, baseType: !283, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !81, line: 174, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!118, !79, !79, !79}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !94, file: !81, line: 356, baseType: !288, size: 64, align: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !81, line: 321, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!292, !79}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !86, line: 186, baseType: !85)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !94, file: !81, line: 357, baseType: !207, size: 64, align: 64, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !94, file: !81, line: 358, baseType: !188, size: 64, align: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !94, file: !81, line: 359, baseType: !296, size: 64, align: 64, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !81, line: 317, baseType: !199)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !94, file: !81, line: 360, baseType: !298, size: 64, align: 64, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !81, line: 319, baseType: !284)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !94, file: !81, line: 363, baseType: !300, size: 64, align: 64, offset: 1280)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !81, line: 304, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 301, size: 128, align: 64, elements: !303)
!303 = !{!304, !325}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !302, file: !81, line: 302, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !81, line: 193, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!118, !79, !309, !118}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !81, line: 191, baseType: !311)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !81, line: 178, size: 640, align: 64, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !322, !323, !324}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !311, file: !81, line: 179, baseType: !78, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !311, file: !81, line: 180, baseType: !79, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !311, file: !81, line: 181, baseType: !85, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !311, file: !81, line: 182, baseType: !85, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !311, file: !81, line: 184, baseType: !118, size: 32, align: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !311, file: !81, line: 185, baseType: !118, size: 32, align: 32, offset: 288)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !311, file: !81, line: 186, baseType: !126, size: 64, align: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !311, file: !81, line: 187, baseType: !321, size: 64, align: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !311, file: !81, line: 188, baseType: !321, size: 64, align: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !311, file: !81, line: 189, baseType: !321, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !311, file: !81, line: 190, baseType: !78, size: 64, align: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !302, file: !81, line: 303, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !81, line: 194, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !79, !309}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !94, file: !81, line: 366, baseType: !170, size: 64, align: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !94, file: !81, line: 368, baseType: !103, size: 64, align: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !94, file: !81, line: 372, baseType: !333, size: 64, align: 64, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !81, line: 233, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!118, !79, !337, !78}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !81, line: 232, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!118, !79, !78}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !94, file: !81, line: 375, baseType: !216, size: 64, align: 64, offset: 1536)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !94, file: !81, line: 379, baseType: !343, size: 64, align: 64, offset: 1600)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !81, line: 322, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!79, !79, !79, !118}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !94, file: !81, line: 382, baseType: !85, size: 64, align: 64, offset: 1664)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !94, file: !81, line: 385, baseType: !349, size: 64, align: 64, offset: 1728)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !81, line: 323, baseType: !189)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !94, file: !81, line: 386, baseType: !351, size: 64, align: 64, offset: 1792)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !81, line: 324, baseType: !189)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !94, file: !81, line: 389, baseType: !353, size: 64, align: 64, offset: 1856)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !355, line: 40, size: 256, align: 64, elements: !356)
!355 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!356 = !{!357, !358, !360, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !354, file: !355, line: 41, baseType: !103, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !354, file: !355, line: 42, baseType: !359, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !355, line: 18, baseType: !199)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !354, file: !355, line: 43, baseType: !118, size: 32, align: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !354, file: !355, line: 45, baseType: !103, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !94, file: !81, line: 390, baseType: !363, size: 64, align: 64, offset: 1920)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !81, line: 390, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !94, file: !81, line: 391, baseType: !366, size: 64, align: 64, offset: 1984)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !368, line: 11, size: 320, align: 64, elements: !369)
!368 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !{!370, !371, !376, !381, !382}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !368, line: 12, baseType: !126, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !367, file: !368, line: 13, baseType: !372, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !368, line: 8, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!79, !79, !78}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !367, file: !368, line: 14, baseType: !377, size: 64, align: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !368, line: 9, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!118, !79, !79, !78}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !367, file: !368, line: 15, baseType: !126, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !367, file: !368, line: 16, baseType: !78, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !94, file: !81, line: 392, baseType: !93, size: 64, align: 64, offset: 2048)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !94, file: !81, line: 393, baseType: !79, size: 64, align: 64, offset: 2112)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !94, file: !81, line: 394, baseType: !386, size: 64, align: 64, offset: 2176)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !81, line: 325, baseType: !208)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !94, file: !81, line: 395, baseType: !388, size: 64, align: 64, offset: 2240)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !81, line: 326, baseType: !284)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !94, file: !81, line: 396, baseType: !85, size: 64, align: 64, offset: 2304)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !94, file: !81, line: 397, baseType: !391, size: 64, align: 64, offset: 2368)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !81, line: 327, baseType: !284)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !94, file: !81, line: 398, baseType: !393, size: 64, align: 64, offset: 2432)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !81, line: 329, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!79, !93, !85}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !94, file: !81, line: 399, baseType: !398, size: 64, align: 64, offset: 2496)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !81, line: 328, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!79, !93, !79, !79}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !94, file: !81, line: 400, baseType: !403, size: 64, align: 64, offset: 2560)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !81, line: 307, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !78}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !94, file: !81, line: 401, baseType: !216, size: 64, align: 64, offset: 2624)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !94, file: !81, line: 402, baseType: !79, size: 64, align: 64, offset: 2688)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !94, file: !81, line: 403, baseType: !79, size: 64, align: 64, offset: 2752)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !94, file: !81, line: 404, baseType: !79, size: 64, align: 64, offset: 2816)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !94, file: !81, line: 405, baseType: !79, size: 64, align: 64, offset: 2880)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !94, file: !81, line: 406, baseType: !79, size: 64, align: 64, offset: 2944)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !94, file: !81, line: 407, baseType: !109, size: 64, align: 64, offset: 3008)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !94, file: !81, line: 410, baseType: !415, size: 32, align: 32, offset: 3072)
!415 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !94, file: !81, line: 412, baseType: !109, size: 64, align: 64, offset: 3136)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "foreachfunc", file: !18, line: 95, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!118, !118, !126, !118, !126, !118, !126}
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !32, line: 152, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !427, !78, null}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !426, line: 37, baseType: !118)
!426 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !32, line: 109, baseType: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !32, line: 110, size: 384, align: 64, elements: !430)
!430 = !{!431, !432, !490, !491, !492, !493}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !429, file: !32, line: 112, baseType: !31, size: 32, align: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !429, file: !32, line: 136, baseType: !433, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !32, line: 113, size: 640, align: 64, elements: !435)
!435 = !{!436, !441, !447, !456, !460, !466, !470, !476, !480, !484}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !434, file: !32, line: 115, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!425, !427, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !434, file: !32, line: 117, baseType: !442, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!425, !427, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !434, file: !32, line: 119, baseType: !448, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!425, !427, !451, !454}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !452, line: 116, baseType: !453)
!452 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !90, line: 192, baseType: !126)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !452, line: 35, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !90, line: 32, baseType: !415)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !434, file: !32, line: 121, baseType: !457, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!425, !427, !103, !454}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !434, file: !32, line: 123, baseType: !461, size: 64, align: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!454, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !434, file: !32, line: 125, baseType: !467, size: 64, align: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!425, !427, !454}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !434, file: !32, line: 127, baseType: !471, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!474, !427, !454}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !452, line: 196, baseType: !118)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !434, file: !32, line: 129, baseType: !477, size: 64, align: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !427}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !434, file: !32, line: 131, baseType: !481, size: 64, align: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!425, !427, !474}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !434, file: !32, line: 133, baseType: !485, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!425, !427, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !429, file: !32, line: 137, baseType: !451, size: 64, align: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !429, file: !32, line: 138, baseType: !451, size: 64, align: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !429, file: !32, line: 139, baseType: !451, size: 64, align: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !429, file: !32, line: 140, baseType: !454, size: 32, align: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "enum_t", file: !426, line: 38, baseType: !118)
!497 = !{!498, !504, !590, !595, !614, !639, !671, !698, !823, !831, !837, !843, !850, !856, !863}
!498 = !DISubprogram(name: "PyInit_nis", scope: !18, file: !18, line: 460, type: !499, isLocal: false, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_nis, variables: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{!79}
!501 = !{!502, !503}
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !498, file: !18, line: 462, type: !79)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !498, file: !18, line: 462, type: !79)
!504 = !DISubprogram(name: "nis_match", scope: !18, file: !18, line: 158, type: !209, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @nis_match, variables: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !524, !528, !588}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !504, file: !18, line: 158, type: !79)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !504, file: !18, line: 158, type: !79)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !504, file: !18, line: 158, type: !79)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "match", scope: !504, file: !18, line: 160, type: !126)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !504, file: !18, line: 161, type: !126)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keylen", scope: !504, file: !18, line: 162, type: !85)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !504, file: !18, line: 163, type: !118)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !504, file: !18, line: 164, type: !126)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !504, file: !18, line: 164, type: !126)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !504, file: !18, line: 165, type: !118)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ukey", scope: !504, file: !18, line: 166, type: !79)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bkey", scope: !504, file: !18, line: 166, type: !79)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !504, file: !18, line: 166, type: !79)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fix", scope: !504, file: !18, line: 167, type: !118)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !521, file: !18, line: 177, type: !79)
!521 = distinct !DILexicalBlock(scope: !522, file: !18, line: 177, column: 12)
!522 = distinct !DILexicalBlock(scope: !523, file: !18, line: 176, column: 61)
!523 = distinct !DILexicalBlock(scope: !504, file: !18, line: 176, column: 9)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !525, file: !18, line: 181, type: !79)
!525 = distinct !DILexicalBlock(scope: !526, file: !18, line: 181, column: 12)
!526 = distinct !DILexicalBlock(scope: !527, file: !18, line: 180, column: 67)
!527 = distinct !DILexicalBlock(scope: !504, file: !18, line: 180, column: 9)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !529, file: !18, line: 187, type: !530)
!529 = distinct !DILexicalBlock(scope: !504, file: !18, line: 187, column: 5)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !532, line: 139, baseType: !533)
!532 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !532, line: 69, size: 1536, align: 64, elements: !534)
!534 = !{!535, !537, !538, !558, !561, !562, !563, !564, !565, !566, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !533, file: !532, line: 72, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !532, line: 73, baseType: !536, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !533, file: !532, line: 74, baseType: !539, size: 64, align: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !532, line: 44, baseType: !541)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !532, line: 19, size: 832, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !532, line: 21, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !541, file: !532, line: 22, baseType: !536, size: 64, align: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !541, file: !532, line: 24, baseType: !79, size: 64, align: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !541, file: !532, line: 25, baseType: !79, size: 64, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !541, file: !532, line: 26, baseType: !79, size: 64, align: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !541, file: !532, line: 27, baseType: !79, size: 64, align: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !541, file: !532, line: 28, baseType: !79, size: 64, align: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !541, file: !532, line: 30, baseType: !79, size: 64, align: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !541, file: !532, line: 31, baseType: !79, size: 64, align: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !541, file: !532, line: 32, baseType: !79, size: 64, align: 64, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !541, file: !532, line: 33, baseType: !118, size: 32, align: 32, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !541, file: !532, line: 34, baseType: !118, size: 32, align: 32, offset: 672)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !541, file: !532, line: 37, baseType: !118, size: 32, align: 32, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !541, file: !532, line: 43, baseType: !79, size: 64, align: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !533, file: !532, line: 76, baseType: !559, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !532, line: 50, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !533, file: !532, line: 77, baseType: !118, size: 32, align: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !533, file: !532, line: 78, baseType: !105, size: 8, align: 8, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !533, file: !532, line: 80, baseType: !105, size: 8, align: 8, offset: 296)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !533, file: !532, line: 85, baseType: !118, size: 32, align: 32, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !533, file: !532, line: 86, baseType: !118, size: 32, align: 32, offset: 352)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !533, file: !532, line: 88, baseType: !567, size: 64, align: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !532, line: 54, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!118, !79, !559, !118, !79}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !533, file: !532, line: 89, baseType: !567, size: 64, align: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !533, file: !532, line: 90, baseType: !79, size: 64, align: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !533, file: !532, line: 91, baseType: !79, size: 64, align: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !533, file: !532, line: 93, baseType: !79, size: 64, align: 64, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !533, file: !532, line: 94, baseType: !79, size: 64, align: 64, offset: 704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !533, file: !532, line: 95, baseType: !79, size: 64, align: 64, offset: 768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !533, file: !532, line: 97, baseType: !79, size: 64, align: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !533, file: !532, line: 98, baseType: !79, size: 64, align: 64, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !533, file: !532, line: 99, baseType: !79, size: 64, align: 64, offset: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !533, file: !532, line: 101, baseType: !79, size: 64, align: 64, offset: 1024)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !533, file: !532, line: 103, baseType: !118, size: 32, align: 32, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !533, file: !532, line: 105, baseType: !79, size: 64, align: 64, offset: 1152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !533, file: !532, line: 106, baseType: !91, size: 64, align: 64, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !533, file: !532, line: 108, baseType: !118, size: 32, align: 32, offset: 1280)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !533, file: !532, line: 109, baseType: !79, size: 64, align: 64, offset: 1344)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !533, file: !532, line: 134, baseType: !404, size: 64, align: 64, offset: 1408)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !533, file: !532, line: 135, baseType: !78, size: 64, align: 64, offset: 1472)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !589, file: !18, line: 190, type: !79)
!589 = distinct !DILexicalBlock(scope: !504, file: !18, line: 190, column: 8)
!590 = !DISubprogram(name: "nis_error", scope: !18, file: !18, line: 50, type: !591, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @nis_error, variables: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{!79, !118}
!593 = !{!594}
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 1, scope: !590, file: !18, line: 50, type: !118)
!595 = !DISubprogram(name: "nis_mapname", scope: !18, file: !18, line: 73, type: !596, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32*)* @nis_mapname, variables: !599)
!596 = !DISubroutineType(types: !597)
!597 = !{!126, !126, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!599 = !{!600, !601, !602, !603, !609, !610, !613}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 1, scope: !595, file: !18, line: 73, type: !126)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pfix", arg: 2, scope: !595, file: !18, line: 73, type: !598)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !595, file: !18, line: 75, type: !118)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !604, file: !18, line: 79, type: !168)
!604 = distinct !DILexicalBlock(scope: !605, file: !18, line: 79, column: 29)
!605 = distinct !DILexicalBlock(scope: !606, file: !18, line: 79, column: 13)
!606 = distinct !DILexicalBlock(scope: !607, file: !18, line: 78, column: 44)
!607 = distinct !DILexicalBlock(scope: !608, file: !18, line: 78, column: 5)
!608 = distinct !DILexicalBlock(scope: !595, file: !18, line: 78, column: 5)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !604, file: !18, line: 79, type: !168)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !611, file: !18, line: 83, type: !168)
!611 = distinct !DILexicalBlock(scope: !612, file: !18, line: 83, column: 29)
!612 = distinct !DILexicalBlock(scope: !606, file: !18, line: 83, column: 13)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !611, file: !18, line: 83, type: !168)
!614 = !DISubprogram(name: "nis_cat", scope: !18, file: !18, line: 201, type: !209, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @nis_cat, variables: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !627, !633, !634, !635}
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !614, file: !18, line: 201, type: !79)
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !614, file: !18, line: 201, type: !79)
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !614, file: !18, line: 201, type: !79)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !614, file: !18, line: 203, type: !126)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !614, file: !18, line: 204, type: !126)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !614, file: !18, line: 205, type: !622)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "ypall_callback", file: !623, line: 53, size: 128, align: 64, elements: !624)
!623 = !DIFile(filename: "/usr/include/rpcsvc/ypclnt.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "foreach", scope: !622, file: !623, line: 55, baseType: !418, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !622, file: !623, line: 57, baseType: !126, size: 64, align: 64, offset: 64)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !614, file: !18, line: 206, type: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "ypcallback_data", file: !18, line: 98, size: 192, align: 64, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !628, file: !18, line: 99, baseType: !79, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fix", scope: !628, file: !18, line: 100, baseType: !118, size: 32, align: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !628, file: !18, line: 101, baseType: !530, size: 64, align: 64, offset: 128)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !614, file: !18, line: 207, type: !79)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !614, file: !18, line: 208, type: !118)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !636, file: !18, line: 227, type: !79)
!636 = distinct !DILexicalBlock(scope: !637, file: !18, line: 227, column: 12)
!637 = distinct !DILexicalBlock(scope: !638, file: !18, line: 226, column: 19)
!638 = distinct !DILexicalBlock(scope: !614, file: !18, line: 226, column: 9)
!639 = !DISubprogram(name: "nis_foreach", scope: !18, file: !18, line: 105, type: !640, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*, i32, i8*, i32, %struct.ypcallback_data*)* @nis_foreach, variables: !643)
!640 = !DISubroutineType(types: !641)
!641 = !{!118, !118, !126, !118, !126, !118, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !653, !654, !655, !659, !662, !664, !667, !669}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "instatus", arg: 1, scope: !639, file: !18, line: 105, type: !118)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inkey", arg: 2, scope: !639, file: !18, line: 105, type: !126)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inkeylen", arg: 3, scope: !639, file: !18, line: 105, type: !118)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inval", arg: 4, scope: !639, file: !18, line: 105, type: !126)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "invallen", arg: 5, scope: !639, file: !18, line: 106, type: !118)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indata", arg: 6, scope: !639, file: !18, line: 106, type: !642)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !651, file: !18, line: 109, type: !79)
!651 = distinct !DILexicalBlock(scope: !652, file: !18, line: 108, column: 30)
!652 = distinct !DILexicalBlock(scope: !639, file: !18, line: 108, column: 9)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !651, file: !18, line: 110, type: !79)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !651, file: !18, line: 111, type: !118)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !656, file: !18, line: 125, type: !79)
!656 = distinct !DILexicalBlock(scope: !657, file: !18, line: 125, column: 16)
!657 = distinct !DILexicalBlock(scope: !658, file: !18, line: 122, column: 53)
!658 = distinct !DILexicalBlock(scope: !651, file: !18, line: 122, column: 13)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !660, file: !18, line: 125, type: !79)
!660 = distinct !DILexicalBlock(scope: !661, file: !18, line: 125, column: 103)
!661 = distinct !DILexicalBlock(scope: !656, file: !18, line: 125, column: 69)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !663, file: !18, line: 126, type: !79)
!663 = distinct !DILexicalBlock(scope: !657, file: !18, line: 126, column: 16)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !665, file: !18, line: 126, type: !79)
!665 = distinct !DILexicalBlock(scope: !666, file: !18, line: 126, column: 103)
!666 = distinct !DILexicalBlock(scope: !663, file: !18, line: 126, column: 69)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !668, file: !18, line: 131, type: !79)
!668 = distinct !DILexicalBlock(scope: !651, file: !18, line: 131, column: 12)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !18, line: 132, type: !79)
!670 = distinct !DILexicalBlock(scope: !651, file: !18, line: 132, column: 12)
!671 = !DISubprogram(name: "nis_maps", scope: !18, file: !18, line: 394, type: !209, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @nis_maps, variables: !672)
!672 = !{!673, !674, !675, !676, !677, !686, !687, !688, !692, !696}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !671, file: !18, line: 394, type: !79)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !671, file: !18, line: 394, type: !79)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !671, file: !18, line: 394, type: !79)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !671, file: !18, line: 396, type: !126)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maps", scope: !671, file: !18, line: 397, type: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "nismaplist", file: !18, line: 267, baseType: !680)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "nismaplist", file: !18, line: 263, size: 128, align: 64, elements: !681)
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !680, file: !18, line: 264, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "mapname", file: !18, line: 246, baseType: !126)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !18, line: 265, baseType: !685, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !671, file: !18, line: 398, type: !79)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !671, file: !18, line: 399, type: !118)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !689, file: !18, line: 415, type: !79)
!689 = distinct !DILexicalBlock(scope: !690, file: !18, line: 414, column: 37)
!690 = distinct !DILexicalBlock(scope: !691, file: !18, line: 414, column: 5)
!691 = distinct !DILexicalBlock(scope: !671, file: !18, line: 414, column: 5)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !18, line: 418, type: !79)
!693 = distinct !DILexicalBlock(scope: !694, file: !18, line: 418, column: 16)
!694 = distinct !DILexicalBlock(scope: !695, file: !18, line: 417, column: 9)
!695 = distinct !DILexicalBlock(scope: !689, file: !18, line: 416, column: 13)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !18, line: 422, type: !79)
!697 = distinct !DILexicalBlock(scope: !689, file: !18, line: 422, column: 12)
!698 = !DISubprogram(name: "nis_maplist", scope: !18, file: !18, line: 358, type: !699, isLocal: true, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: true, function: %struct.nismaplist* (i8*)* @nis_maplist, variables: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{!678, !126}
!701 = !{!702, !703, !711, !821, !822}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dom", arg: 1, scope: !698, file: !18, line: 358, type: !126)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !698, file: !18, line: 360, type: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "nisresp_maplist", file: !18, line: 273, baseType: !706)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "nisresp_maplist", file: !18, line: 269, size: 128, align: 64, elements: !707)
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !706, file: !18, line: 270, baseType: !709, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "nisstat", file: !18, line: 261, baseType: !17)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "maps", scope: !706, file: !18, line: 271, baseType: !678, size: 64, align: 64, offset: 64)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cl", scope: !698, file: !18, line: 361, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLIENT", file: !38, line: 129, baseType: !714)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "CLIENT", file: !38, line: 130, size: 192, align: 64, elements: !715)
!715 = !{!716, !764, !820}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "cl_auth", scope: !714, file: !38, line: 131, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTH", file: !67, line: 91, baseType: !719)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "AUTH", file: !67, line: 92, size: 576, align: 64, elements: !720)
!720 = !{!721, !727, !728, !741, !763}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ah_cred", scope: !719, file: !67, line: 93, baseType: !722, size: 192, align: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "opaque_auth", file: !67, line: 82, size: 192, align: 64, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "oa_flavor", scope: !722, file: !67, line: 83, baseType: !496, size: 32, align: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "oa_base", scope: !722, file: !67, line: 84, baseType: !451, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "oa_length", scope: !722, file: !67, line: 85, baseType: !454, size: 32, align: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ah_verf", scope: !719, file: !67, line: 94, baseType: !722, size: 192, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ah_key", scope: !719, file: !67, line: 95, baseType: !729, size: 64, align: 32, offset: 384)
!729 = !DICompositeType(tag: DW_TAG_union_type, name: "des_block", file: !67, line: 69, size: 64, align: 32, elements: !730)
!730 = !{!731, !737}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !729, file: !67, line: 73, baseType: !732, size: 64, align: 32)
!732 = !DICompositeType(tag: DW_TAG_structure_type, scope: !729, file: !67, line: 70, size: 64, align: 32, elements: !733)
!733 = !{!734, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !732, file: !67, line: 71, baseType: !735, size: 32, align: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !452, line: 202, baseType: !415)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !732, file: !67, line: 72, baseType: !735, size: 32, align: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !729, file: !67, line: 74, baseType: !738, size: 64, align: 8)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 64, align: 8, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ah_ops", scope: !719, file: !67, line: 103, baseType: !742, size: 64, align: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "auth_ops", file: !67, line: 96, size: 320, align: 64, elements: !744)
!744 = !{!745, !749, !753, !758, !762}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ah_nextverf", scope: !743, file: !67, line: 97, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !717}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ah_marshal", scope: !743, file: !67, line: 98, baseType: !750, size: 64, align: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!118, !717, !427}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ah_validate", scope: !743, file: !67, line: 99, baseType: !754, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!118, !717, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ah_refresh", scope: !743, file: !67, line: 101, baseType: !759, size: 64, align: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!118, !717}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ah_destroy", scope: !743, file: !67, line: 102, baseType: !746, size: 64, align: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ah_private", scope: !719, file: !67, line: 104, baseType: !451, size: 64, align: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cl_ops", scope: !714, file: !38, line: 144, baseType: !765, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "clnt_ops", file: !38, line: 132, size: 384, align: 64, elements: !767)
!767 = !{!768, !781, !785, !808, !812, !816}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cl_call", scope: !766, file: !38, line: 133, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!37, !712, !772, !421, !451, !421, !451, !774}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !452, line: 36, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !90, line: 33, baseType: !170)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !775, line: 30, size: 128, align: 64, elements: !776)
!775 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!776 = !{!777, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !774, file: !775, line: 32, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 148, baseType: !91)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !774, file: !775, line: 33, baseType: !780, size: 64, align: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !90, line: 150, baseType: !91)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cl_abort", scope: !766, file: !38, line: 136, baseType: !782, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cl_geterr", scope: !766, file: !38, line: 137, baseType: !786, size: 64, align: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !712, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64, align: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "rpc_err", file: !38, line: 103, size: 192, align: 64, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "re_status", scope: !790, file: !38, line: 104, baseType: !37, size: 32, align: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ru", scope: !790, file: !38, line: 116, baseType: !794, size: 128, align: 64, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !38, line: 105, size: 128, align: 64, elements: !795)
!795 = !{!796, !797, !798, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RE_errno", scope: !794, file: !38, line: 106, baseType: !118, size: 32, align: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RE_why", scope: !794, file: !38, line: 107, baseType: !66, size: 32, align: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RE_vers", scope: !794, file: !38, line: 111, baseType: !799, size: 128, align: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !38, line: 108, size: 128, align: 64, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !799, file: !38, line: 109, baseType: !772, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !799, file: !38, line: 110, baseType: !772, size: 64, align: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RE_lb", scope: !794, file: !38, line: 115, baseType: !804, size: 128, align: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !38, line: 112, size: 128, align: 64, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "s1", scope: !804, file: !38, line: 113, baseType: !91, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !804, file: !38, line: 114, baseType: !91, size: 64, align: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cl_freeres", scope: !766, file: !38, line: 139, baseType: !809, size: 64, align: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!425, !712, !421, !451}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cl_destroy", scope: !766, file: !38, line: 141, baseType: !813, size: 64, align: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !712}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cl_control", scope: !766, file: !38, line: 142, baseType: !817, size: 64, align: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64, align: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!425, !712, !118, !126}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cl_private", scope: !714, file: !38, line: 145, baseType: !451, size: 64, align: 64, offset: 128)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "server", scope: !698, file: !18, line: 362, type: !126)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapi", scope: !698, file: !18, line: 363, type: !118)
!823 = !DISubprogram(name: "nisproc_maplist_2", scope: !18, file: !18, line: 341, type: !824, isLocal: true, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: true, function: %struct.nisresp_maplist* (i8**, %struct.CLIENT*)* @nisproc_maplist_2, variables: !828)
!824 = !DISubroutineType(types: !825)
!825 = !{!704, !826, !712}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "domainname", file: !18, line: 245, baseType: !126)
!828 = !{!829, !830}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argp", arg: 1, scope: !823, file: !18, line: 341, type: !826)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "clnt", arg: 2, scope: !823, file: !18, line: 341, type: !712)
!831 = !DISubprogram(name: "nis_xdr_domainname", scope: !18, file: !18, line: 279, type: !832, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i8**)* @nis_xdr_domainname, variables: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{!425, !427, !826}
!834 = !{!835, !836}
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !831, file: !18, line: 279, type: !427)
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objp", arg: 2, scope: !831, file: !18, line: 279, type: !826)
!837 = !DISubprogram(name: "nis_xdr_ypresp_maplist", scope: !18, file: !18, line: 325, type: !838, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, %struct.nisresp_maplist*)* @nis_xdr_ypresp_maplist, variables: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!425, !427, !704}
!840 = !{!841, !842}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !837, file: !18, line: 325, type: !427)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objp", arg: 2, scope: !837, file: !18, line: 325, type: !704)
!843 = !DISubprogram(name: "nis_xdr_ypstat", scope: !18, file: !18, line: 314, type: !844, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i32*)* @nis_xdr_ypstat, variables: !847)
!844 = !DISubroutineType(types: !845)
!845 = !{!425, !427, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!847 = !{!848, !849}
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !843, file: !18, line: 314, type: !427)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objp", arg: 2, scope: !843, file: !18, line: 314, type: !846)
!850 = !DISubprogram(name: "nis_xdr_ypmaplist", scope: !18, file: !18, line: 299, type: !851, isLocal: true, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, %struct.nismaplist*)* @nis_xdr_ypmaplist, variables: !853)
!851 = !DISubroutineType(types: !852)
!852 = !{!425, !427, !678}
!853 = !{!854, !855}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !850, file: !18, line: 299, type: !427)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objp", arg: 2, scope: !850, file: !18, line: 299, type: !678)
!856 = !DISubprogram(name: "nis_xdr_mapname", scope: !18, file: !18, line: 289, type: !857, isLocal: true, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XDR*, i8**)* @nis_xdr_mapname, variables: !860)
!857 = !DISubroutineType(types: !858)
!858 = !{!425, !427, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!860 = !{!861, !862}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "xdrs", arg: 1, scope: !856, file: !18, line: 289, type: !427)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objp", arg: 2, scope: !856, file: !18, line: 289, type: !859)
!863 = !DISubprogram(name: "nis_get_default_domain", scope: !18, file: !18, line: 144, type: !190, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @nis_get_default_domain, variables: !864)
!864 = !{!865, !866, !867, !868}
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !863, file: !18, line: 144, type: !79)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !863, file: !18, line: 146, type: !126)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !863, file: !18, line: 147, type: !118)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !863, file: !18, line: 148, type: !79)
!869 = !{!870, !871, !894, !898, !902, !906, !915, !919, !923, !927, !931, !932, !933, !937}
!870 = !DIGlobalVariable(name: "NisError", scope: !0, file: !18, line: 47, type: !79, isLocal: true, isDefinition: true, variable: %struct._object** @NisError)
!871 = !DIGlobalVariable(name: "nismodule", scope: !0, file: !18, line: 447, type: !872, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @nismodule)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !873, line: 47, size: 832, align: 64, elements: !874)
!873 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!874 = !{!875, !884, !885, !886, !887, !890, !891, !892, !893}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !872, file: !873, line: 48, baseType: !876, size: 320, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !873, line: 38, baseType: !877)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !873, line: 33, size: 320, align: 64, elements: !878)
!878 = !{!879, !880, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !877, file: !873, line: 34, baseType: !80, size: 128, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !877, file: !873, line: 35, baseType: !881, size: 64, align: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !877, file: !873, line: 36, baseType: !85, size: 64, align: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !877, file: !873, line: 37, baseType: !79, size: 64, align: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !872, file: !873, line: 49, baseType: !103, size: 64, align: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !872, file: !873, line: 50, baseType: !103, size: 64, align: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !872, file: !873, line: 51, baseType: !85, size: 64, align: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !872, file: !873, line: 52, baseType: !888, size: 64, align: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !355, line: 47, baseType: !354)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !872, file: !873, line: 53, baseType: !216, size: 64, align: 64, offset: 576)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !872, file: !873, line: 54, baseType: !333, size: 64, align: 64, offset: 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !872, file: !873, line: 55, baseType: !216, size: 64, align: 64, offset: 704)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !872, file: !873, line: 56, baseType: !403, size: 64, align: 64, offset: 768)
!894 = !DIGlobalVariable(name: "nis__doc__", scope: !0, file: !18, line: 444, type: !895, isLocal: true, isDefinition: true, variable: [56 x i8]* @nis__doc__)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 448, align: 8, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 56)
!898 = !DIGlobalVariable(name: "nis_methods", scope: !0, file: !18, line: 428, type: !899, isLocal: true, isDefinition: true, variable: [5 x %struct.PyMethodDef]* @nis_methods)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 1280, align: 64, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 5)
!902 = !DIGlobalVariable(name: "kwlist", scope: !504, file: !18, line: 168, type: !903, isLocal: true, isDefinition: true, variable: [4 x i8*]* @nis_match.kwlist)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, align: 64, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 4)
!906 = !DIGlobalVariable(name: "aliases", scope: !0, file: !18, line: 60, type: !907, isLocal: true, isDefinition: true, variable: [9 x %struct.nis_map]* @aliases)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 1728, align: 64, elements: !913)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "nis_map", file: !18, line: 56, size: 192, align: 64, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !908, file: !18, line: 57, baseType: !126, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !908, file: !18, line: 58, baseType: !126, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fix", scope: !908, file: !18, line: 59, baseType: !118, size: 32, align: 32, offset: 128)
!913 = !{!914}
!914 = !DISubrange(count: 9)
!915 = !DIGlobalVariable(name: "match__doc__", scope: !0, file: !18, line: 31, type: !916, isLocal: true, isDefinition: true, variable: [213 x i8]* @match__doc__)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 1704, align: 8, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 213)
!919 = !DIGlobalVariable(name: "kwlist", scope: !614, file: !18, line: 209, type: !920, isLocal: true, isDefinition: true, variable: [3 x i8*]* @nis_cat.kwlist)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 192, align: 64, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 3)
!923 = !DIGlobalVariable(name: "cat__doc__", scope: !0, file: !18, line: 37, type: !924, isLocal: true, isDefinition: true, variable: [155 x i8]* @cat__doc__)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 1240, align: 8, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 155)
!927 = !DIGlobalVariable(name: "kwlist", scope: !671, file: !18, line: 400, type: !928, isLocal: true, isDefinition: true, variable: [2 x i8*]* @nis_maps.kwlist)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, align: 64, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 2)
!931 = !DIGlobalVariable(name: "res", scope: !823, file: !18, line: 343, type: !705, isLocal: true, isDefinition: true, variable: %struct.nisresp_maplist* @nisproc_maplist_2.res)
!932 = !DIGlobalVariable(name: "TIMEOUT", scope: !0, file: !18, line: 275, type: !774, isLocal: true, isDefinition: true, variable: %struct.timeval* @TIMEOUT)
!933 = !DIGlobalVariable(name: "maps__doc__", scope: !0, file: !18, line: 42, type: !934, isLocal: true, isDefinition: true, variable: [159 x i8]* @maps__doc__)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 1272, align: 8, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 159)
!937 = !DIGlobalVariable(name: "get_default_domain__doc__", scope: !0, file: !18, line: 26, type: !938, isLocal: true, isDefinition: true, variable: [122 x i8]* @get_default_domain__doc__)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 976, align: 8, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 122)
!941 = !{i32 2, !"Dwarf Version", i32 4}
!942 = !{i32 2, !"Debug Info Version", i32 3}
!943 = !{i32 1, !"PIC Level", i32 2}
!944 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!945 = !DILocation(line: 462, column: 5, scope: !498)
!946 = !DIExpression()
!947 = !DILocation(line: 462, column: 15, scope: !498)
!948 = !DILocation(line: 462, column: 19, scope: !498)
!949 = !DILocation(line: 463, column: 9, scope: !498)
!950 = !DILocation(line: 463, column: 7, scope: !498)
!951 = !{!952, !952, i64 0}
!952 = !{!"any pointer", !953, i64 0}
!953 = !{!"omnipotent char", !954, i64 0}
!954 = !{!"Simple C/C++ TBAA"}
!955 = !DILocation(line: 464, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !498, file: !18, line: 464, column: 9)
!957 = !DILocation(line: 464, column: 11, scope: !956)
!958 = !DILocation(line: 464, column: 9, scope: !498)
!959 = !DILocation(line: 465, column: 9, scope: !956)
!960 = !DILocation(line: 466, column: 26, scope: !498)
!961 = !DILocation(line: 466, column: 9, scope: !498)
!962 = !DILocation(line: 466, column: 7, scope: !498)
!963 = !DILocation(line: 467, column: 16, scope: !498)
!964 = !DILocation(line: 467, column: 14, scope: !498)
!965 = !DILocation(line: 468, column: 9, scope: !966)
!966 = distinct !DILexicalBlock(scope: !498, file: !18, line: 468, column: 9)
!967 = !DILocation(line: 468, column: 18, scope: !966)
!968 = !DILocation(line: 468, column: 9, scope: !498)
!969 = !DILocation(line: 469, column: 30, scope: !966)
