; ModuleID = 'programs_new/Python-new/obmalloc.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMemAllocator = type { i8*, i8* (i8*, i64)*, i8* (i8*, i8*, i64)*, void (i8*, i8*)* }
%struct.PyObjectArenaAllocator = type { i8*, i8* (i8*, i64)*, void (i8*, i8*, i64)* }
%struct.arena_object = type { i64, i8*, i32, i32, %struct.pool_header*, %struct.arena_object*, %struct.arena_object* }
%struct.pool_header = type { %union.anon, i8*, %struct.pool_header*, %struct.pool_header*, i32, i32, i32, i32 }
%union.anon = type { i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@_PyMem_Raw = internal global %struct.PyMemAllocator { i8* null, i8* (i8*, i64)* @_PyMem_RawMalloc, i8* (i8*, i8*, i64)* @_PyMem_RawRealloc, void (i8*, i8*)* @_PyMem_RawFree }, align 8
@_PyMem = internal global %struct.PyMemAllocator { i8* null, i8* (i8*, i64)* @_PyMem_RawMalloc, i8* (i8*, i8*, i64)* @_PyMem_RawRealloc, void (i8*, i8*)* @_PyMem_RawFree }, align 8
@_PyObject = internal global %struct.PyMemAllocator { i8* null, i8* (i8*, i64)* @_PyObject_Malloc, i8* (i8*, i8*, i64)* @_PyObject_Realloc, void (i8*, i8*)* @_PyObject_Free }, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !58, globals: !356)
!1 = !DIFile(filename: "obmalloc.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 117, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pymem.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PYMEM_DOMAIN_RAW", value: 0)
!7 = !DIEnumerator(name: "PYMEM_DOMAIN_MEM", value: 1)
!8 = !DIEnumerator(name: "PYMEM_DOMAIN_OBJ", value: 2)
!9 = !{!10, !11, !14, !21, !24, !37, !45, !33, !46, !56, !57}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 62, baseType: !13)
!12 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !15, line: 177, baseType: !16)
!15 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !17, line: 102, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !19, line: 181, baseType: !20)
!19 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !15, line: 153, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 122, baseType: !13)
!23 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "poolp", file: !25, line: 633, baseType: !26)
!25 = !DIFile(filename: "Objects/obmalloc.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "pool_header", file: !25, line: 621, size: 384, align: 64, elements: !28)
!28 = !{!29, !38, !39, !40, !41, !42, !43, !44}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !27, file: !25, line: 623, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_union_type, scope: !27, file: !25, line: 622, size: 64, align: 64, elements: !31)
!31 = !{!32, !36}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !30, file: !25, line: 622, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !25, line: 618, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !30, file: !25, line: 623, baseType: !37, size: 32, align: 32)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "freeblock", scope: !27, file: !25, line: 624, baseType: !33, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nextpool", scope: !27, file: !25, line: 625, baseType: !26, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "prevpool", scope: !27, file: !25, line: 626, baseType: !26, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "arenaindex", scope: !27, file: !25, line: 627, baseType: !37, size: 32, align: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "szidx", scope: !27, file: !25, line: 628, baseType: !37, size: 32, align: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nextoffset", scope: !27, file: !25, line: 629, baseType: !37, size: 32, align: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "maxnextoffset", scope: !27, file: !25, line: 630, baseType: !37, size: 32, align: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "arena_object", file: !25, line: 636, size: 384, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !47, file: !25, line: 642, baseType: !21, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pool_address", scope: !47, file: !25, line: 645, baseType: !33, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "nfreepools", scope: !47, file: !25, line: 650, baseType: !37, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalpools", scope: !47, file: !25, line: 653, baseType: !37, size: 32, align: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "freepools", scope: !47, file: !25, line: 656, baseType: !26, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nextarena", scope: !47, file: !25, line: 672, baseType: !46, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prevarena", scope: !47, file: !25, line: 673, baseType: !46, size: 64, align: 64, offset: 320)
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !{!59, !63, !87, !91, !107, !110, !115, !119, !124, !127, !131, !134, !144, !149, !152, !156, !159, !162, !228, !269, !273, !278, !282, !292, !304, !313, !329, !334, !339}
!59 = !DISubprogram(name: "PyMem_SetupDebugHooks", scope: !25, file: !25, line: 193, type: !60, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyMem_SetupDebugHooks, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{null}
!62 = !{}
!63 = !DISubprogram(name: "PyMem_GetAllocator", scope: !25, file: !25, line: 223, type: !64, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.PyMemAllocator*)* @PyMem_GetAllocator, variables: !84)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !67}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocatorDomain", file: !4, line: 126, baseType: !3)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocator", file: !4, line: 140, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 128, size: 256, align: 64, elements: !70)
!70 = !{!71, !72, !76, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !69, file: !4, line: 130, baseType: !10, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !69, file: !4, line: 133, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!10, !10, !11}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !69, file: !4, line: 136, baseType: !77, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!10, !10, !10, !11}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !69, file: !4, line: 139, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !10, !10}
!84 = !{!85, !86}
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "domain", arg: 1, scope: !63, file: !25, line: 223, type: !66)
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 2, scope: !63, file: !25, line: 223, type: !67)
!87 = !DISubprogram(name: "PyMem_SetAllocator", scope: !25, file: !25, line: 240, type: !64, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.PyMemAllocator*)* @PyMem_SetAllocator, variables: !88)
!88 = !{!89, !90}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "domain", arg: 1, scope: !87, file: !25, line: 240, type: !66)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 2, scope: !87, file: !25, line: 240, type: !67)
!91 = !DISubprogram(name: "PyObject_GetArenaAllocator", scope: !25, file: !25, line: 253, type: !92, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyObjectArenaAllocator*)* @PyObject_GetArenaAllocator, variables: !105)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObjectArenaAllocator", file: !96, line: 211, baseType: !97)
!96 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!97 = !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 202, size: 192, align: 64, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !97, file: !96, line: 204, baseType: !10, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !97, file: !96, line: 207, baseType: !73, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !97, file: !96, line: 210, baseType: !102, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !10, !10, !11}
!105 = !{!106}
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 1, scope: !91, file: !25, line: 253, type: !94)
!107 = !DISubprogram(name: "PyObject_SetArenaAllocator", scope: !25, file: !25, line: 259, type: !92, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyObjectArenaAllocator*)* @PyObject_SetArenaAllocator, variables: !108)
!108 = !{!109}
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 1, scope: !107, file: !25, line: 259, type: !94)
!110 = !DISubprogram(name: "PyMem_RawMalloc", scope: !25, file: !25, line: 265, type: !111, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @PyMem_RawMalloc, variables: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{!10, !11}
!113 = !{!114}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !110, file: !25, line: 265, type: !11)
!115 = !DISubprogram(name: "PyMem_RawRealloc", scope: !25, file: !25, line: 280, type: !74, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @PyMem_RawRealloc, variables: !116)
!116 = !{!117, !118}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !115, file: !25, line: 280, type: !10)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_size", arg: 2, scope: !115, file: !25, line: 280, type: !11)
!119 = !DISubprogram(name: "PyMem_RawFree", scope: !25, file: !25, line: 288, type: !120, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyMem_RawFree, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !10}
!122 = !{!123}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !119, file: !25, line: 288, type: !10)
!124 = !DISubprogram(name: "PyMem_Malloc", scope: !25, file: !25, line: 294, type: !111, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @PyMem_Malloc, variables: !125)
!125 = !{!126}
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !124, file: !25, line: 294, type: !11)
!127 = !DISubprogram(name: "PyMem_Realloc", scope: !25, file: !25, line: 303, type: !74, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @PyMem_Realloc, variables: !128)
!128 = !{!129, !130}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !127, file: !25, line: 303, type: !10)
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_size", arg: 2, scope: !127, file: !25, line: 303, type: !11)
!131 = !DISubprogram(name: "PyMem_Free", scope: !25, file: !25, line: 312, type: !120, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyMem_Free, variables: !132)
!132 = !{!133}
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !131, file: !25, line: 312, type: !10)
!134 = !DISubprogram(name: "_PyMem_RawStrdup", scope: !25, file: !25, line: 318, type: !135, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @_PyMem_RawStrdup, variables: !140)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!140 = !{!141, !142, !143}
!141 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !134, file: !25, line: 318, type: !138)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !134, file: !25, line: 320, type: !11)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !134, file: !25, line: 321, type: !137)
!144 = !DISubprogram(name: "_PyMem_Strdup", scope: !25, file: !25, line: 332, type: !135, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @_PyMem_Strdup, variables: !145)
!145 = !{!146, !147, !148}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !144, file: !25, line: 332, type: !138)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !144, file: !25, line: 334, type: !11)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !144, file: !25, line: 335, type: !137)
!149 = !DISubprogram(name: "PyObject_Malloc", scope: !25, file: !25, line: 346, type: !111, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @PyObject_Malloc, variables: !150)
!150 = !{!151}
!151 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !149, file: !25, line: 346, type: !11)
!152 = !DISubprogram(name: "PyObject_Realloc", scope: !25, file: !25, line: 355, type: !74, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @PyObject_Realloc, variables: !153)
!153 = !{!154, !155}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !152, file: !25, line: 355, type: !10)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_size", arg: 2, scope: !152, file: !25, line: 355, type: !11)
!156 = !DISubprogram(name: "PyObject_Free", scope: !25, file: !25, line: 364, type: !120, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyObject_Free, variables: !157)
!157 = !{!158}
!158 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !156, file: !25, line: 364, type: !10)
!159 = !DISubprogram(name: "_Py_GetAllocatedBlocks", scope: !25, file: !25, line: 891, type: !160, isLocal: false, isDefinition: true, scopeLine: 892, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @_Py_GetAllocatedBlocks, variables: !62)
!160 = !DISubroutineType(types: !161)
!161 = !{!14}
!162 = !DISubprogram(name: "_PyDebugAllocatorStats", scope: !25, file: !25, line: 2056, type: !163, isLocal: false, isDefinition: true, scopeLine: 2058, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*, i8*, i32, i64)* @_PyDebugAllocatorStats, variables: !218)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !165, !138, !56, !11}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 48, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !168, line: 246, size: 1728, align: 64, elements: !169)
!168 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !190, !191, !192, !193, !195, !197, !199, !203, !206, !208, !209, !210, !211, !212, !213, !214}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !167, file: !168, line: 247, baseType: !56, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !167, file: !168, line: 252, baseType: !137, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !167, file: !168, line: 253, baseType: !137, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !167, file: !168, line: 254, baseType: !137, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !167, file: !168, line: 255, baseType: !137, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !167, file: !168, line: 256, baseType: !137, size: 64, align: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !167, file: !168, line: 257, baseType: !137, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !167, file: !168, line: 258, baseType: !137, size: 64, align: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !167, file: !168, line: 259, baseType: !137, size: 64, align: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !167, file: !168, line: 261, baseType: !137, size: 64, align: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !167, file: !168, line: 262, baseType: !137, size: 64, align: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !167, file: !168, line: 263, baseType: !137, size: 64, align: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !167, file: !168, line: 265, baseType: !183, size: 64, align: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !168, line: 161, size: 192, align: 64, elements: !185)
!185 = !{!186, !187, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !184, file: !168, line: 162, baseType: !183, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !184, file: !168, line: 163, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !184, file: !168, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !167, file: !168, line: 267, baseType: !188, size: 64, align: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !167, file: !168, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !167, file: !168, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !167, file: !168, line: 275, baseType: !194, size: 64, align: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !19, line: 140, baseType: !20)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !167, file: !168, line: 279, baseType: !196, size: 16, align: 16, offset: 1024)
!196 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !167, file: !168, line: 280, baseType: !198, size: 8, align: 8, offset: 1040)
!198 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !167, file: !168, line: 281, baseType: !200, size: 8, align: 8, offset: 1048)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !167, file: !168, line: 285, baseType: !204, size: 64, align: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !168, line: 155, baseType: null)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !167, file: !168, line: 294, baseType: !207, size: 64, align: 64, offset: 1152)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !19, line: 141, baseType: !20)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !167, file: !168, line: 303, baseType: !10, size: 64, align: 64, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !167, file: !168, line: 304, baseType: !10, size: 64, align: 64, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !167, file: !168, line: 305, baseType: !10, size: 64, align: 64, offset: 1344)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !167, file: !168, line: 306, baseType: !10, size: 64, align: 64, offset: 1408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !167, file: !168, line: 307, baseType: !11, size: 64, align: 64, offset: 1472)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !167, file: !168, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !167, file: !168, line: 311, baseType: !215, size: 160, align: 8, offset: 1568)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, align: 8, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 20)
!218 = !{!219, !220, !221, !222, !223, !227}
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !162, file: !25, line: 2056, type: !165)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_name", arg: 2, scope: !162, file: !25, line: 2057, type: !138)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_blocks", arg: 3, scope: !162, file: !25, line: 2057, type: !56)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sizeof_block", arg: 4, scope: !162, file: !25, line: 2057, type: !11)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf1", scope: !162, file: !25, line: 2059, type: !224)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, align: 8, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 128)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf2", scope: !162, file: !25, line: 2060, type: !224)
!228 = !DISubprogram(name: "_PyObject_DebugMallocStats", scope: !25, file: !25, line: 2076, type: !229, isLocal: false, isDefinition: true, scopeLine: 2077, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyObject_DebugMallocStats, variables: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !165}
!231 = !{!232, !233, !234, !236, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !255, !256, !260, !261, !262, !266, !267, !268}
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !228, file: !25, line: 2076, type: !165)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !228, file: !25, line: 2078, type: !37)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numclasses", scope: !228, file: !25, line: 2079, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numpools", scope: !228, file: !25, line: 2081, type: !237)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 4096, align: 64, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 64)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numblocks", scope: !228, file: !25, line: 2082, type: !237)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numfreeblocks", scope: !228, file: !25, line: 2083, type: !237)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allocated_bytes", scope: !228, file: !25, line: 2085, type: !11)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "available_bytes", scope: !228, file: !25, line: 2087, type: !11)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numfreepools", scope: !228, file: !25, line: 2089, type: !37)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arena_alignment", scope: !228, file: !25, line: 2091, type: !11)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool_header_bytes", scope: !228, file: !25, line: 2093, type: !11)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quantization", scope: !228, file: !25, line: 2098, type: !11)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "narenas", scope: !228, file: !25, line: 2100, type: !11)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !228, file: !25, line: 2102, type: !11)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !228, file: !25, line: 2103, type: !224)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !252, file: !25, line: 2116, type: !37)
!252 = distinct !DILexicalBlock(scope: !253, file: !25, line: 2115, column: 37)
!253 = distinct !DILexicalBlock(scope: !254, file: !25, line: 2115, column: 5)
