; ModuleID = 'irs-onlybc/ossaudiodev.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !394, globals: !810)
!1 = !DIFile(filename: "ossaudiodev.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !17, !94, !350, !352, !29, !355, !363, !44, !365, !379, !385}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !357, line: 41, baseType: !358)
!357 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!358 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 31, size: 320, align: 64, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !358, file: !357, line: 32, baseType: !23, size: 192, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !358, file: !357, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !358, file: !357, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !364, line: 54, baseType: !17)
!364 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "oss_audio_t", file: !367, line: 57, baseType: !368)
!367 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/ossaudiodev.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 49, size: 384, align: 64, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !368, file: !367, line: 50, baseType: !6, size: 128, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "devicename", scope: !368, file: !367, line: 51, baseType: !52, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !368, file: !367, line: 52, baseType: !44, size: 32, align: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !368, file: !367, line: 53, baseType: !44, size: 32, align: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "icount", scope: !368, file: !367, line: 54, baseType: !44, size: 32, align: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ocount", scope: !368, file: !367, line: 55, baseType: !44, size: 32, align: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "afmts", scope: !368, file: !367, line: 56, baseType: !377, size: 32, align: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !378, line: 51, baseType: !348)
!378 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "oss_mixer_t", file: !367, line: 62, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 59, size: 192, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !367, line: 60, baseType: !6, size: 128, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !381, file: !367, line: 61, baseType: !44, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !387, line: 40, baseType: !388)
!387 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!388 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 23, size: 320, align: 64, elements: !389)
!389 = !{!390, !391, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !388, file: !387, line: 24, baseType: !23, size: 192, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !388, file: !387, line: 26, baseType: !392, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !388, file: !387, line: 39, baseType: !11, size: 64, align: 64, offset: 256)
!394 = !{!395, !400, !405, !434, !506, !511, !520, !544, !552, !556, !560, !564, !577, !582, !586, !590, !594, !607, !611, !615, !626, !641, !650, !657, !664, !676, !680, !687, !692, !698, !702, !706, !714, !718, !722, !728, !736, !740, !744, !748, !780, !784, !792}
!395 = !DISubprogram(name: "PyInit_ossaudiodev", scope: !367, file: !367, line: 1110, type: !396, isLocal: false, isDefinition: true, scopeLine: 1111, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_ossaudiodev, variables: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!5}
!398 = !{!399}
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !395, file: !367, line: 1112, type: !5)
!400 = !DISubprogram(name: "oss_dealloc", scope: !367, file: !367, line: 152, type: !401, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.oss_audio_t*)* @oss_dealloc, variables: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !365}
!403 = !{!404}
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !400, file: !367, line: 152, type: !365)
!405 = !DISubprogram(name: "oss_getattro", scope: !367, file: !367, line: 926, type: !406, isLocal: true, isDefinition: true, scopeLine: 927, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_getattro, variables: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!5, !365, !5}
!408 = !{!409, !410, !411, !412, !413, !416, !417, !419, !420, !423, !424, !426, !427, !430, !431, !433}
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !405, file: !367, line: 926, type: !365)
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nameobj", arg: 2, scope: !405, file: !367, line: 926, type: !5)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !405, file: !367, line: 928, type: !52)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !405, file: !367, line: 929, type: !5)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !414, file: !367, line: 934, type: !94)
!414 = distinct !DILexicalBlock(scope: !415, file: !367, line: 934, column: 24)
!415 = distinct !DILexicalBlock(scope: !405, file: !367, line: 934, column: 9)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !414, file: !367, line: 934, type: !94)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !418, file: !367, line: 934, type: !352)
!418 = distinct !DILexicalBlock(scope: !414, file: !367, line: 934, column: 1585)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !418, file: !367, line: 934, type: !44)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !421, file: !367, line: 938, type: !94)
!421 = distinct !DILexicalBlock(scope: !422, file: !367, line: 938, column: 29)
!422 = distinct !DILexicalBlock(scope: !415, file: !367, line: 938, column: 14)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !421, file: !367, line: 938, type: !94)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !425, file: !367, line: 938, type: !352)
!425 = distinct !DILexicalBlock(scope: !421, file: !367, line: 938, column: 1560)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !425, file: !367, line: 938, type: !44)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !428, file: !367, line: 941, type: !94)
!428 = distinct !DILexicalBlock(scope: !429, file: !367, line: 941, column: 29)
!429 = distinct !DILexicalBlock(scope: !422, file: !367, line: 941, column: 14)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !428, file: !367, line: 941, type: !94)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !432, file: !367, line: 941, type: !352)
!432 = distinct !DILexicalBlock(scope: !428, file: !367, line: 941, column: 1560)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !432, file: !367, line: 941, type: !44)
!434 = !DISubprogram(name: "oss_read", scope: !367, file: !367, line: 405, type: !406, isLocal: true, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_read, variables: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !502}
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !434, file: !367, line: 405, type: !365)
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !434, file: !367, line: 405, type: !5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !434, file: !367, line: 407, type: !44)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !434, file: !367, line: 407, type: !44)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !434, file: !367, line: 408, type: !52)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !434, file: !367, line: 409, type: !5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !443, file: !367, line: 421, type: !444)
!443 = distinct !DILexicalBlock(scope: !434, file: !367, line: 421, column: 5)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !446, line: 139, baseType: !447)
!446 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !446, line: 69, size: 1536, align: 64, elements: !448)
!448 = !{!449, !451, !452, !472, !475, !476, !477, !478, !479, !480, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !446, line: 72, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !446, line: 73, baseType: !450, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !447, file: !446, line: 74, baseType: !453, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !446, line: 44, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !446, line: 19, size: 832, align: 64, elements: !456)
!456 = !{!457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !446, line: 21, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !455, file: !446, line: 22, baseType: !450, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !455, file: !446, line: 24, baseType: !5, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !455, file: !446, line: 25, baseType: !5, size: 64, align: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !455, file: !446, line: 26, baseType: !5, size: 64, align: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !455, file: !446, line: 27, baseType: !5, size: 64, align: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !455, file: !446, line: 28, baseType: !5, size: 64, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !455, file: !446, line: 30, baseType: !5, size: 64, align: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !455, file: !446, line: 31, baseType: !5, size: 64, align: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !455, file: !446, line: 32, baseType: !5, size: 64, align: 64, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !455, file: !446, line: 33, baseType: !44, size: 32, align: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !455, file: !446, line: 34, baseType: !44, size: 32, align: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !455, file: !446, line: 37, baseType: !44, size: 32, align: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !455, file: !446, line: 43, baseType: !5, size: 64, align: 64, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !447, file: !446, line: 76, baseType: !473, size: 64, align: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !446, line: 50, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !447, file: !446, line: 77, baseType: !44, size: 32, align: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !447, file: !446, line: 78, baseType: !31, size: 8, align: 8, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !447, file: !446, line: 80, baseType: !31, size: 8, align: 8, offset: 296)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !447, file: !446, line: 85, baseType: !44, size: 32, align: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !447, file: !446, line: 86, baseType: !44, size: 32, align: 32, offset: 352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !447, file: !446, line: 88, baseType: !481, size: 64, align: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !446, line: 54, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!44, !5, !473, !44, !5}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !447, file: !446, line: 89, baseType: !481, size: 64, align: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !447, file: !446, line: 90, baseType: !5, size: 64, align: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !447, file: !446, line: 91, baseType: !5, size: 64, align: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !447, file: !446, line: 93, baseType: !5, size: 64, align: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !447, file: !446, line: 94, baseType: !5, size: 64, align: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !447, file: !446, line: 95, baseType: !5, size: 64, align: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !447, file: !446, line: 97, baseType: !5, size: 64, align: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !447, file: !446, line: 98, baseType: !5, size: 64, align: 64, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !447, file: !446, line: 99, baseType: !5, size: 64, align: 64, offset: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !447, file: !446, line: 101, baseType: !5, size: 64, align: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !447, file: !446, line: 103, baseType: !44, size: 32, align: 32, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !447, file: !446, line: 105, baseType: !5, size: 64, align: 64, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !447, file: !446, line: 106, baseType: !17, size: 64, align: 64, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !447, file: !446, line: 108, baseType: !44, size: 32, align: 32, offset: 1280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !447, file: !446, line: 109, baseType: !5, size: 64, align: 64, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !447, file: !446, line: 134, baseType: !337, size: 64, align: 64, offset: 1408)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !447, file: !446, line: 135, baseType: !4, size: 64, align: 64, offset: 1472)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !367, line: 427, type: !5)
!503 = distinct !DILexicalBlock(scope: !504, file: !367, line: 427, column: 12)
!504 = distinct !DILexicalBlock(scope: !505, file: !367, line: 425, column: 20)
!505 = distinct !DILexicalBlock(scope: !434, file: !367, line: 425, column: 9)
!506 = !DISubprogram(name: "_is_fd_valid", scope: !367, file: !367, line: 223, type: !507, isLocal: true, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @_is_fd_valid, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!44, !44}
!509 = !{!510}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !506, file: !367, line: 223, type: !44)
!511 = !DISubprogram(name: "oss_write", scope: !367, file: !367, line: 436, type: !406, isLocal: true, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_write, variables: !512)
!512 = !{!513, !514, !515, !516, !517, !518}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !511, file: !367, line: 436, type: !365)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !511, file: !367, line: 436, type: !5)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !511, file: !367, line: 438, type: !52)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !511, file: !367, line: 439, type: !44)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !511, file: !367, line: 439, type: !44)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !519, file: !367, line: 448, type: !444)
!519 = distinct !DILexicalBlock(scope: !511, file: !367, line: 448, column: 5)
!520 = !DISubprogram(name: "oss_writeall", scope: !367, file: !367, line: 461, type: !406, isLocal: true, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_writeall, variables: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !535, !536, !538, !539, !542}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !520, file: !367, line: 461, type: !365)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !520, file: !367, line: 461, type: !5)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !520, file: !367, line: 463, type: !52)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !520, file: !367, line: 464, type: !44)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !520, file: !367, line: 464, type: !44)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "write_set_fds", scope: !520, file: !367, line: 465, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !364, line: 75, baseType: !529)
!529 = !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 64, size: 1024, align: 64, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !529, file: !364, line: 69, baseType: !532, size: 1024, align: 64)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 1024, align: 64, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 16)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "select_rv", scope: !520, file: !367, line: 466, type: !44)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__d0", scope: !537, file: !367, line: 487, type: !44)
!537 = distinct !DILexicalBlock(scope: !520, file: !367, line: 487, column: 8)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__d1", scope: !537, file: !367, line: 487, type: !44)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !540, file: !367, line: 491, type: !444)
!540 = distinct !DILexicalBlock(scope: !541, file: !367, line: 491, column: 9)
!541 = distinct !DILexicalBlock(scope: !520, file: !367, line: 490, column: 22)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !543, file: !367, line: 498, type: !444)
!543 = distinct !DILexicalBlock(scope: !541, file: !367, line: 498, column: 9)
!544 = !DISubprogram(name: "oss_close", scope: !367, file: !367, line: 518, type: !406, isLocal: true, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_close, variables: !545)
!545 = !{!546, !547, !548}
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !544, file: !367, line: 518, type: !365)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !544, file: !367, line: 518, type: !5)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !549, file: !367, line: 521, type: !444)
!549 = distinct !DILexicalBlock(scope: !550, file: !367, line: 521, column: 9)
!550 = distinct !DILexicalBlock(scope: !551, file: !367, line: 520, column: 24)
!551 = distinct !DILexicalBlock(scope: !544, file: !367, line: 520, column: 9)
!552 = !DISubprogram(name: "oss_fileno", scope: !367, file: !367, line: 550, type: !406, isLocal: true, isDefinition: true, scopeLine: 551, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_fileno, variables: !553)
!553 = !{!554, !555}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !552, file: !367, line: 550, type: !365)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !552, file: !367, line: 550, type: !5)
!556 = !DISubprogram(name: "oss_nonblock", scope: !367, file: !367, line: 320, type: !406, isLocal: true, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_nonblock, variables: !557)
!557 = !{!558, !559}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !556, file: !367, line: 320, type: !365)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !556, file: !367, line: 320, type: !5)
!560 = !DISubprogram(name: "oss_setfmt", scope: !367, file: !367, line: 334, type: !406, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_setfmt, variables: !561)
!561 = !{!562, !563}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !560, file: !367, line: 334, type: !365)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !560, file: !367, line: 334, type: !5)
!564 = !DISubprogram(name: "_do_ioctl_1", scope: !367, file: !367, line: 245, type: !565, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, %struct._object*, i8*, i32)* @_do_ioctl_1, variables: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!5, !44, !5, !52, !44}
!567 = !{!568, !569, !570, !571, !572, !576}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !564, file: !367, line: 245, type: !44)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !564, file: !367, line: 245, type: !5)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 3, scope: !564, file: !367, line: 245, type: !52)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cmd", arg: 4, scope: !564, file: !367, line: 245, type: !44)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argfmt", scope: !564, file: !367, line: 247, type: !573)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 264, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 33)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !564, file: !367, line: 248, type: !44)
!577 = !DISubprogram(name: "oss_getfmts", scope: !367, file: !367, line: 343, type: !406, isLocal: true, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_getfmts, variables: !578)
!578 = !{!579, !580, !581}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !577, file: !367, line: 343, type: !365)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !577, file: !367, line: 343, type: !5)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !577, file: !367, line: 345, type: !44)
!582 = !DISubprogram(name: "oss_channels", scope: !367, file: !367, line: 356, type: !406, isLocal: true, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_channels, variables: !583)
!583 = !{!584, !585}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !582, file: !367, line: 356, type: !365)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !582, file: !367, line: 356, type: !5)
!586 = !DISubprogram(name: "oss_speed", scope: !367, file: !367, line: 365, type: !406, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_speed, variables: !587)
!587 = !{!588, !589}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !586, file: !367, line: 365, type: !365)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !586, file: !367, line: 365, type: !5)
!590 = !DISubprogram(name: "oss_sync", scope: !367, file: !367, line: 374, type: !406, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_sync, variables: !591)
!591 = !{!592, !593}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !590, file: !367, line: 374, type: !365)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !590, file: !367, line: 374, type: !5)
!594 = !DISubprogram(name: "_do_ioctl_0", scope: !367, file: !367, line: 290, type: !565, isLocal: true, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, %struct._object*, i8*, i32)* @_do_ioctl_0, variables: !595)
!595 = !{!596, !597, !598, !599, !600, !604, !605}
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !594, file: !367, line: 290, type: !44)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !594, file: !367, line: 290, type: !5)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 3, scope: !594, file: !367, line: 290, type: !52)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cmd", arg: 4, scope: !594, file: !367, line: 290, type: !44)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argfmt", scope: !594, file: !367, line: 292, type: !601)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, align: 8, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 32)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !594, file: !367, line: 293, type: !44)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !606, file: !367, line: 304, type: !444)
!606 = distinct !DILexicalBlock(scope: !594, file: !367, line: 304, column: 5)
!607 = !DISubprogram(name: "oss_reset", scope: !367, file: !367, line: 383, type: !406, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_reset, variables: !608)
!608 = !{!609, !610}
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !607, file: !367, line: 383, type: !365)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !607, file: !367, line: 383, type: !5)
!611 = !DISubprogram(name: "oss_post", scope: !367, file: !367, line: 392, type: !406, isLocal: true, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_post, variables: !612)
!612 = !{!613, !614}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !611, file: !367, line: 392, type: !365)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !611, file: !367, line: 392, type: !5)
!615 = !DISubprogram(name: "oss_setparameters", scope: !367, file: !367, line: 563, type: !406, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_setparameters, variables: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !615, file: !367, line: 563, type: !365)
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !615, file: !367, line: 563, type: !5)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wanted_fmt", scope: !615, file: !367, line: 565, type: !44)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wanted_channels", scope: !615, file: !367, line: 565, type: !44)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wanted_rate", scope: !615, file: !367, line: 565, type: !44)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strict", scope: !615, file: !367, line: 565, type: !44)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !615, file: !367, line: 566, type: !44)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "channels", scope: !615, file: !367, line: 566, type: !44)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rate", scope: !615, file: !367, line: 566, type: !44)
!626 = !DISubprogram(name: "oss_bufsize", scope: !367, file: !367, line: 650, type: !406, isLocal: true, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_bufsize, variables: !627)
!627 = !{!628, !629, !630, !639, !640}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !626, file: !367, line: 650, type: !365)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !626, file: !367, line: 650, type: !5)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !626, file: !367, line: 652, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "audio_buf_info", file: !632, line: 575, baseType: !633)
!632 = !DIFile(filename: "/usr/include/linux/soundcard.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "audio_buf_info", file: !632, line: 568, size: 128, align: 32, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fragments", scope: !633, file: !632, line: 569, baseType: !44, size: 32, align: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fragstotal", scope: !633, file: !632, line: 570, baseType: !44, size: 32, align: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fragsize", scope: !633, file: !632, line: 571, baseType: !44, size: 32, align: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !633, file: !632, line: 573, baseType: !44, size: 32, align: 32, offset: 96)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nchannels", scope: !626, file: !367, line: 653, type: !44)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssize", scope: !626, file: !367, line: 653, type: !44)
!641 = !DISubprogram(name: "_ssize", scope: !367, file: !367, line: 615, type: !642, isLocal: true, isDefinition: true, scopeLine: 616, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.oss_audio_t*, i32*, i32*)* @_ssize, variables: !645)
!642 = !DISubroutineType(types: !643)
!643 = !{!44, !365, !644, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!645 = !{!646, !647, !648, !649}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !641, file: !367, line: 615, type: !365)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nchannels", arg: 2, scope: !641, file: !367, line: 615, type: !644)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssize", arg: 3, scope: !641, file: !367, line: 615, type: !644)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !641, file: !367, line: 617, type: !44)
!650 = !DISubprogram(name: "oss_obufcount", scope: !367, file: !367, line: 672, type: !406, isLocal: true, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_obufcount, variables: !651)
!651 = !{!652, !653, !654, !655, !656}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !650, file: !367, line: 672, type: !365)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !650, file: !367, line: 672, type: !5)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !650, file: !367, line: 674, type: !631)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nchannels", scope: !650, file: !367, line: 675, type: !44)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssize", scope: !650, file: !367, line: 675, type: !44)
!657 = !DISubprogram(name: "oss_obuffree", scope: !367, file: !367, line: 695, type: !406, isLocal: true, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_obuffree, variables: !658)
!658 = !{!659, !660, !661, !662, !663}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !657, file: !367, line: 695, type: !365)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !657, file: !367, line: 695, type: !5)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ai", scope: !657, file: !367, line: 697, type: !631)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nchannels", scope: !657, file: !367, line: 698, type: !44)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssize", scope: !657, file: !367, line: 698, type: !44)
!664 = !DISubprogram(name: "oss_getptr", scope: !367, file: !367, line: 715, type: !406, isLocal: true, isDefinition: true, scopeLine: 716, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_audio_t*, %struct._object*)* @oss_getptr, variables: !665)
!665 = !{!666, !667, !668, !675}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !664, file: !367, line: 715, type: !365)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !664, file: !367, line: 715, type: !5)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !664, file: !367, line: 717, type: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "count_info", file: !632, line: 606, baseType: !670)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "count_info", file: !632, line: 602, size: 96, align: 32, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !670, file: !632, line: 603, baseType: !44, size: 32, align: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !670, file: !632, line: 604, baseType: !44, size: 32, align: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !670, file: !632, line: 605, baseType: !44, size: 32, align: 32, offset: 64)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "req", scope: !664, file: !367, line: 718, type: !44)
!676 = !DISubprogram(name: "oss_self", scope: !367, file: !367, line: 531, type: !126, isLocal: true, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @oss_self, variables: !677)
!677 = !{!678, !679}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !676, file: !367, line: 531, type: !5)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !676, file: !367, line: 531, type: !5)
!680 = !DISubprogram(name: "oss_exit", scope: !367, file: !367, line: 538, type: !126, isLocal: true, isDefinition: true, scopeLine: 539, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @oss_exit, variables: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !680, file: !367, line: 538, type: !5)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !680, file: !367, line: 538, type: !5)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !680, file: !367, line: 542, type: !5)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !367, line: 545, type: !5)
!686 = distinct !DILexicalBlock(scope: !680, file: !367, line: 545, column: 8)
!687 = !DISubprogram(name: "oss_mixer_dealloc", scope: !367, file: !367, line: 199, type: !688, isLocal: true, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.oss_mixer_t*)* @oss_mixer_dealloc, variables: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !379}
!690 = !{!691}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !687, file: !367, line: 199, type: !379)
!692 = !DISubprogram(name: "oss_mixer_close", scope: !367, file: !367, line: 740, type: !693, isLocal: true, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_close, variables: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{!5, !379, !5}
!695 = !{!696, !697}
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !692, file: !367, line: 740, type: !379)
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !692, file: !367, line: 740, type: !5)
!698 = !DISubprogram(name: "oss_mixer_fileno", scope: !367, file: !367, line: 751, type: !693, isLocal: true, isDefinition: true, scopeLine: 752, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_fileno, variables: !699)
!699 = !{!700, !701}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !698, file: !367, line: 751, type: !379)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !698, file: !367, line: 751, type: !5)
!702 = !DISubprogram(name: "oss_mixer_controls", scope: !367, file: !367, line: 762, type: !693, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_controls, variables: !703)
!703 = !{!704, !705}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !702, file: !367, line: 762, type: !379)
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !702, file: !367, line: 762, type: !5)
!706 = !DISubprogram(name: "_do_ioctl_1_internal", scope: !367, file: !367, line: 270, type: !565, isLocal: true, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, %struct._object*, i8*, i32)* @_do_ioctl_1_internal, variables: !707)
!707 = !{!708, !709, !710, !711, !712, !713}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !706, file: !367, line: 270, type: !44)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !706, file: !367, line: 270, type: !5)
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 3, scope: !706, file: !367, line: 270, type: !52)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cmd", arg: 4, scope: !706, file: !367, line: 270, type: !44)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argfmt", scope: !706, file: !367, line: 272, type: !601)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !706, file: !367, line: 273, type: !44)
!714 = !DISubprogram(name: "oss_mixer_stereocontrols", scope: !367, file: !367, line: 772, type: !693, isLocal: true, isDefinition: true, scopeLine: 773, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_stereocontrols, variables: !715)
!715 = !{!716, !717}
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !714, file: !367, line: 772, type: !379)
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !714, file: !367, line: 772, type: !5)
!718 = !DISubprogram(name: "oss_mixer_reccontrols", scope: !367, file: !367, line: 782, type: !693, isLocal: true, isDefinition: true, scopeLine: 783, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_reccontrols, variables: !719)
!719 = !{!720, !721}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !718, file: !367, line: 782, type: !379)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !718, file: !367, line: 782, type: !5)
!722 = !DISubprogram(name: "oss_mixer_get", scope: !367, file: !367, line: 792, type: !693, isLocal: true, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_get, variables: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !722, file: !367, line: 792, type: !379)
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !722, file: !367, line: 792, type: !5)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "channel", scope: !722, file: !367, line: 794, type: !44)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volume", scope: !722, file: !367, line: 794, type: !44)
!728 = !DISubprogram(name: "oss_mixer_set", scope: !367, file: !367, line: 815, type: !693, isLocal: true, isDefinition: true, scopeLine: 816, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_set, variables: !729)
!729 = !{!730, !731, !732, !733, !734, !735}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !728, file: !367, line: 815, type: !379)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !728, file: !367, line: 815, type: !5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "channel", scope: !728, file: !367, line: 817, type: !44)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volume", scope: !728, file: !367, line: 817, type: !44)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftVol", scope: !728, file: !367, line: 817, type: !44)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightVol", scope: !728, file: !367, line: 817, type: !44)
!736 = !DISubprogram(name: "oss_mixer_get_recsrc", scope: !367, file: !367, line: 845, type: !693, isLocal: true, isDefinition: true, scopeLine: 846, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_get_recsrc, variables: !737)
!737 = !{!738, !739}
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !736, file: !367, line: 845, type: !379)
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !736, file: !367, line: 845, type: !5)
!740 = !DISubprogram(name: "oss_mixer_set_recsrc", scope: !367, file: !367, line: 855, type: !693, isLocal: true, isDefinition: true, scopeLine: 856, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.oss_mixer_t*, %struct._object*)* @oss_mixer_set_recsrc, variables: !741)
!741 = !{!742, !743}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !740, file: !367, line: 855, type: !379)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !740, file: !367, line: 855, type: !5)
!744 = !DISubprogram(name: "ossopen", scope: !367, file: !367, line: 1028, type: !126, isLocal: true, isDefinition: true, scopeLine: 1029, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @ossopen, variables: !745)
!745 = !{!746, !747}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !744, file: !367, line: 1028, type: !5)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !744, file: !367, line: 1028, type: !5)
!748 = !DISubprogram(name: "newossobject", scope: !367, file: !367, line: 76, type: !749, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: %struct.oss_audio_t* (%struct._object*)* @newossobject, variables: !751)
!749 = !DISubroutineType(types: !750)
!750 = !{!365, !5}
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !762, !763, !765, !766, !769, !770, !772, !773, !776, !777, !779}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !748, file: !367, line: 76, type: !5)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !748, file: !367, line: 78, type: !365)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !748, file: !367, line: 79, type: !44)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "afmts", scope: !748, file: !367, line: 79, type: !44)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imode", scope: !748, file: !367, line: 79, type: !44)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "devicename", scope: !748, file: !367, line: 80, type: !52)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !748, file: !367, line: 81, type: !52)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !760, file: !367, line: 95, type: !94)
!760 = distinct !DILexicalBlock(scope: !761, file: !367, line: 95, column: 24)
!761 = distinct !DILexicalBlock(scope: !748, file: !367, line: 95, column: 9)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !760, file: !367, line: 95, type: !94)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !764, file: !367, line: 95, type: !352)
!764 = distinct !DILexicalBlock(scope: !760, file: !367, line: 95, column: 1510)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !764, file: !367, line: 95, type: !44)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !767, file: !367, line: 97, type: !94)
!767 = distinct !DILexicalBlock(scope: !768, file: !367, line: 97, column: 29)
!768 = distinct !DILexicalBlock(scope: !761, file: !367, line: 97, column: 14)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !767, file: !367, line: 97, type: !94)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !771, file: !367, line: 97, type: !352)
!771 = distinct !DILexicalBlock(scope: !767, file: !367, line: 97, column: 1515)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !771, file: !367, line: 97, type: !44)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !774, file: !367, line: 99, type: !94)
!774 = distinct !DILexicalBlock(scope: !775, file: !367, line: 99, column: 29)
!775 = distinct !DILexicalBlock(scope: !768, file: !367, line: 99, column: 14)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !774, file: !367, line: 99, type: !94)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !778, file: !367, line: 99, type: !352)
!778 = distinct !DILexicalBlock(scope: !774, file: !367, line: 99, column: 1530)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !778, file: !367, line: 99, type: !44)
!780 = !DISubprogram(name: "ossopenmixer", scope: !367, file: !367, line: 1034, type: !126, isLocal: true, isDefinition: true, scopeLine: 1035, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @ossopenmixer, variables: !781)
!781 = !{!782, !783}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !780, file: !367, line: 1034, type: !5)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !780, file: !367, line: 1034, type: !5)
!784 = !DISubprogram(name: "newossmixerobject", scope: !367, file: !367, line: 166, type: !785, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: %struct.oss_mixer_t* (%struct._object*)* @newossmixerobject, variables: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!379, !5}
!787 = !{!788, !789, !790, !791}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !784, file: !367, line: 166, type: !5)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "devicename", scope: !784, file: !367, line: 168, type: !52)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !784, file: !367, line: 169, type: !44)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !784, file: !367, line: 170, type: !379)
!792 = !DISubprogram(name: "build_namelists", scope: !367, file: !367, line: 1055, type: !144, isLocal: true, isDefinition: true, scopeLine: 1056, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @build_namelists, variables: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !802, !805, !807}
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !792, file: !367, line: 1055, type: !5)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "labels", scope: !792, file: !367, line: 1057, type: !5)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "names", scope: !792, file: !367, line: 1058, type: !5)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !792, file: !367, line: 1059, type: !5)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_controls", scope: !792, file: !367, line: 1060, type: !44)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !792, file: !367, line: 1061, type: !44)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !801, file: !367, line: 1090, type: !5)
!801 = distinct !DILexicalBlock(scope: !792, file: !367, line: 1090, column: 8)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !367, line: 1090, type: !5)
!803 = distinct !DILexicalBlock(scope: !804, file: !367, line: 1090, column: 98)
!804 = distinct !DILexicalBlock(scope: !801, file: !367, line: 1090, column: 64)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !806, file: !367, line: 1092, type: !5)
!806 = distinct !DILexicalBlock(scope: !792, file: !367, line: 1092, column: 8)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !808, file: !367, line: 1092, type: !5)
!808 = distinct !DILexicalBlock(scope: !809, file: !367, line: 1092, column: 97)
!809 = distinct !DILexicalBlock(scope: !806, file: !367, line: 1092, column: 63)
!810 = !{!811, !812, !814, !819, !827, !828, !832, !854, !858, !862}
!811 = !DIGlobalVariable(name: "OSSAudioError", scope: !0, file: !367, line: 68, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @OSSAudioError)
!812 = !DIGlobalVariable(name: "OSSAudioType", scope: !0, file: !367, line: 962, type: !813, isLocal: true, isDefinition: true, variable: %struct._typeobject* @OSSAudioType)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!814 = !DIGlobalVariable(name: "oss_methods", scope: !0, file: !367, line: 869, type: !815, isLocal: true, isDefinition: true, variable: [22 x %struct.PyMethodDef]* @oss_methods)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 5632, align: 64, elements: !817)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!817 = !{!818}
!818 = !DISubrange(count: 22)
!819 = !DIGlobalVariable(name: "PyId_close", scope: !680, file: !367, line: 540, type: !820, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @oss_exit.PyId_close)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !7, line: 144, baseType: !821)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !7, line: 140, size: 192, align: 64, elements: !822)
!822 = !{!823, !825, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !821, file: !7, line: 141, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !821, file: !7, line: 142, baseType: !29, size: 64, align: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !821, file: !7, line: 143, baseType: !5, size: 64, align: 64, offset: 128)
!827 = !DIGlobalVariable(name: "OSSMixerType", scope: !0, file: !367, line: 994, type: !813, isLocal: true, isDefinition: true, variable: %struct._typeobject* @OSSMixerType)
!828 = !DIGlobalVariable(name: "oss_mixer_methods", scope: !0, file: !367, line: 904, type: !829, isLocal: true, isDefinition: true, variable: [12 x %struct.PyMethodDef]* @oss_mixer_methods)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 3072, align: 64, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 12)
!832 = !DIGlobalVariable(name: "ossaudiodevmodule", scope: !0, file: !367, line: 1097, type: !833, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @ossaudiodevmodule)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !834, line: 47, size: 832, align: 64, elements: !835)
!834 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!835 = !{!836, !845, !846, !847, !848, !850, !851, !852, !853}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !833, file: !834, line: 48, baseType: !837, size: 320, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !834, line: 38, baseType: !838)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !834, line: 33, size: 320, align: 64, elements: !839)
!839 = !{!840, !841, !843, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !838, file: !834, line: 34, baseType: !6, size: 128, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !838, file: !834, line: 35, baseType: !842, size: 64, align: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !838, file: !834, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !838, file: !834, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !833, file: !834, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !833, file: !834, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !833, file: !834, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !833, file: !834, line: 52, baseType: !849, size: 64, align: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !833, file: !834, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !833, file: !834, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !833, file: !834, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !833, file: !834, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!854 = !DIGlobalVariable(name: "ossaudiodev_methods", scope: !0, file: !367, line: 1039, type: !855, isLocal: true, isDefinition: true, variable: [3 x %struct.PyMethodDef]* @ossaudiodev_methods)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 768, align: 64, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 3)
!858 = !DIGlobalVariable(name: "control_labels", scope: !0, file: !367, line: 1050, type: !859, isLocal: true, isDefinition: true, variable: [25 x i8*]* @control_labels)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1600, align: 64, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 25)
!862 = !DIGlobalVariable(name: "control_names", scope: !0, file: !367, line: 1051, type: !859, isLocal: true, isDefinition: true, variable: [25 x i8*]* @control_names)
!863 = !{i32 2, !"Dwarf Version", i32 4}
!864 = !{i32 2, !"Debug Info Version", i32 3}
!865 = !{i32 1, !"PIC Level", i32 2}
!866 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!867 = !DILocation(line: 1112, column: 5, scope: !395)
!868 = !DIExpression()
!869 = !DILocation(line: 1112, column: 15, scope: !395)
!870 = !DILocation(line: 1114, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !395, file: !367, line: 1114, column: 9)
!872 = !DILocation(line: 1114, column: 37, scope: !871)
!873 = !DILocation(line: 1114, column: 9, scope: !395)
!874 = !DILocation(line: 1115, column: 9, scope: !871)
!875 = !DILocation(line: 1117, column: 9, scope: !876)
!876 = distinct !DILexicalBlock(scope: !395, file: !367, line: 1117, column: 9)
!877 = !DILocation(line: 1117, column: 37, scope: !876)
!878 = !DILocation(line: 1117, column: 9, scope: !395)
!879 = !DILocation(line: 1118, column: 9, scope: !876)
!880 = !DILocation(line: 1120, column: 9, scope: !395)
!881 = !DILocation(line: 1120, column: 7, scope: !395)
!882 = !{!883, !883, i64 0}
!883 = !{!"any pointer", !884, i64 0}
!884 = !{!"omnipotent char", !885, i64 0}
!885 = !{!"Simple C/C++ TBAA"}
!886 = !DILocation(line: 1121, column: 9, scope: !887)
!887 = distinct !DILexicalBlock(scope: !395, file: !367, line: 1121, column: 9)
!888 = !DILocation(line: 1121, column: 11, scope: !887)
!889 = !DILocation(line: 1121, column: 9, scope: !395)
!890 = !DILocation(line: 1122, column: 9, scope: !887)
!891 = !DILocation(line: 1124, column: 21, scope: !395)
!892 = !DILocation(line: 1124, column: 19, scope: !395)
!893 = !DILocation(line: 1126, column: 9, scope: !894)
!894 = distinct !DILexicalBlock(scope: !395, file: !367, line: 1126, column: 9)
!895 = !DILocation(line: 1126, column: 9, scope: !395)
!896 = !DILocation(line: 1128, column: 25, scope: !897)
