; ModuleID = 'programs_new/Python-new/parsermodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !75, subprograms: !447, globals: !1738)
!1 = !DIFile(filename: "parsermodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !10, !38, !42, !56, !62, !70}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mod_kind", file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/Python-ast.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "Module_kind", value: 1)
!7 = !DIEnumerator(name: "Interactive_kind", value: 2)
!8 = !DIEnumerator(name: "Expression_kind", value: 3)
!9 = !DIEnumerator(name: "Suite_kind", value: 4)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_kind", file: !4, line: 180, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!12 = !DIEnumerator(name: "BoolOp_kind", value: 1)
!13 = !DIEnumerator(name: "BinOp_kind", value: 2)
!14 = !DIEnumerator(name: "UnaryOp_kind", value: 3)
!15 = !DIEnumerator(name: "Lambda_kind", value: 4)
!16 = !DIEnumerator(name: "IfExp_kind", value: 5)
!17 = !DIEnumerator(name: "Dict_kind", value: 6)
!18 = !DIEnumerator(name: "Set_kind", value: 7)
!19 = !DIEnumerator(name: "ListComp_kind", value: 8)
!20 = !DIEnumerator(name: "SetComp_kind", value: 9)
!21 = !DIEnumerator(name: "DictComp_kind", value: 10)
!22 = !DIEnumerator(name: "GeneratorExp_kind", value: 11)
!23 = !DIEnumerator(name: "Yield_kind", value: 12)
!24 = !DIEnumerator(name: "YieldFrom_kind", value: 13)
!25 = !DIEnumerator(name: "Compare_kind", value: 14)
!26 = !DIEnumerator(name: "Call_kind", value: 15)
!27 = !DIEnumerator(name: "Num_kind", value: 16)
!28 = !DIEnumerator(name: "Str_kind", value: 17)
!29 = !DIEnumerator(name: "Bytes_kind", value: 18)
!30 = !DIEnumerator(name: "NameConstant_kind", value: 19)
!31 = !DIEnumerator(name: "Ellipsis_kind", value: 20)
!32 = !DIEnumerator(name: "Attribute_kind", value: 21)
!33 = !DIEnumerator(name: "Subscript_kind", value: 22)
!34 = !DIEnumerator(name: "Starred_kind", value: 23)
!35 = !DIEnumerator(name: "Name_kind", value: 24)
!36 = !DIEnumerator(name: "List_kind", value: 25)
!37 = !DIEnumerator(name: "Tuple_kind", value: 26)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_boolop", file: !4, line: 16, size: 32, align: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "And", value: 1)
!41 = !DIEnumerator(name: "Or", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_operator", file: !4, line: 18, size: 32, align: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!44 = !DIEnumerator(name: "Add", value: 1)
!45 = !DIEnumerator(name: "Sub", value: 2)
!46 = !DIEnumerator(name: "Mult", value: 3)
!47 = !DIEnumerator(name: "Div", value: 4)
!48 = !DIEnumerator(name: "Mod", value: 5)
!49 = !DIEnumerator(name: "Pow", value: 6)
!50 = !DIEnumerator(name: "LShift", value: 7)
!51 = !DIEnumerator(name: "RShift", value: 8)
!52 = !DIEnumerator(name: "BitOr", value: 9)
!53 = !DIEnumerator(name: "BitXor", value: 10)
!54 = !DIEnumerator(name: "BitAnd", value: 11)
!55 = !DIEnumerator(name: "FloorDiv", value: 12)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_unaryop", file: !4, line: 22, size: 32, align: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "Invert", value: 1)
!59 = !DIEnumerator(name: "Not", value: 2)
!60 = !DIEnumerator(name: "UAdd", value: 3)
!61 = !DIEnumerator(name: "USub", value: 4)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_context", file: !4, line: 11, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIEnumerator(name: "Load", value: 1)
!65 = !DIEnumerator(name: "Store", value: 2)
!66 = !DIEnumerator(name: "Del", value: 3)
!67 = !DIEnumerator(name: "AugLoad", value: 4)
!68 = !DIEnumerator(name: "AugStore", value: 5)
!69 = !DIEnumerator(name: "Param", value: 6)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_slice_kind", file: !4, line: 323, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "Slice_kind", value: 1)
!73 = !DIEnumerator(name: "ExtSlice_kind", value: 2)
!74 = !DIEnumerator(name: "Index_kind", value: 3)
!75 = !{!76, !77, !415, !124, !422, !166, !442, !444, !101}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !79, line: 109, baseType: !80)
!79 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !79, line: 105, size: 128, align: 64, elements: !81)
!81 = !{!82, !90}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !80, file: !79, line: 107, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !84, line: 177, baseType: !85)
!84 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !86, line: 102, baseType: !87)
!86 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !88, line: 181, baseType: !89)
!88 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!89 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !80, file: !79, line: 108, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !79, line: 334, size: 3200, align: 64, elements: !93)
!93 = !{!94, !100, !104, !105, !106, !111, !174, !179, !184, !185, !190, !242, !273, !285, !291, !292, !293, !295, !297, !328, !329, !330, !339, !340, !345, !346, !348, !350, !360, !363, !381, !382, !383, !385, !387, !388, !390, !395, !400, !405, !406, !407, !408, !409, !410, !411, !412, !414}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !92, file: !79, line: 335, baseType: !95, size: 192, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !79, line: 114, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 111, size: 192, align: 64, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !96, file: !79, line: 112, baseType: !78, size: 128, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !96, file: !79, line: 113, baseType: !83, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !92, file: !79, line: 336, baseType: !101, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !92, file: !79, line: 337, baseType: !83, size: 64, align: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !92, file: !79, line: 337, baseType: !83, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !92, file: !79, line: 341, baseType: !107, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !79, line: 308, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !77}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !92, file: !79, line: 342, baseType: !112, size: 64, align: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !79, line: 314, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !77, !117, !116}
!116 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !86, line: 48, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !120, line: 246, size: 1728, align: 64, elements: !121)
!120 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!121 = !{!122, !123, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !143, !144, !145, !146, !148, !150, !152, !156, !159, !161, !162, !163, !164, !165, !169, !170}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !120, line: 247, baseType: !116, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !120, line: 252, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !120, line: 253, baseType: !124, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !120, line: 254, baseType: !124, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !120, line: 255, baseType: !124, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !120, line: 256, baseType: !124, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !120, line: 257, baseType: !124, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !120, line: 258, baseType: !124, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !120, line: 259, baseType: !124, size: 64, align: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !120, line: 261, baseType: !124, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !120, line: 262, baseType: !124, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !120, line: 263, baseType: !124, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !120, line: 265, baseType: !136, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !120, line: 161, size: 192, align: 64, elements: !138)
!138 = !{!139, !140, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !137, file: !120, line: 162, baseType: !136, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !137, file: !120, line: 163, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !137, file: !120, line: 167, baseType: !116, size: 32, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !120, line: 267, baseType: !141, size: 64, align: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !120, line: 269, baseType: !116, size: 32, align: 32, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !120, line: 273, baseType: !116, size: 32, align: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !120, line: 275, baseType: !147, size: 64, align: 64, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !88, line: 140, baseType: !89)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !120, line: 279, baseType: !149, size: 16, align: 16, offset: 1024)
!149 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !120, line: 280, baseType: !151, size: 8, align: 8, offset: 1040)
!151 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !120, line: 281, baseType: !153, size: 8, align: 8, offset: 1048)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8, align: 8, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !120, line: 285, baseType: !157, size: 64, align: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !120, line: 155, baseType: null)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !120, line: 294, baseType: !160, size: 64, align: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !88, line: 141, baseType: !89)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !119, file: !120, line: 303, baseType: !76, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !119, file: !120, line: 304, baseType: !76, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !119, file: !120, line: 305, baseType: !76, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !119, file: !120, line: 306, baseType: !76, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !120, line: 307, baseType: !166, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !167, line: 62, baseType: !168)
!167 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!168 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !120, line: 309, baseType: !116, size: 32, align: 32, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !120, line: 311, baseType: !171, size: 160, align: 8, offset: 1568)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 160, align: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 20)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !92, file: !79, line: 343, baseType: !175, size: 64, align: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !79, line: 316, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!77, !77, !124}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !92, file: !79, line: 344, baseType: !180, size: 64, align: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !79, line: 318, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!116, !77, !124, !77}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !92, file: !79, line: 345, baseType: !76, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !92, file: !79, line: 346, baseType: !186, size: 64, align: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !79, line: 320, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!77, !77}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !92, file: !79, line: 350, baseType: !191, size: 64, align: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !79, line: 278, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 236, size: 2176, align: 64, elements: !194)
!194 = !{!195, !200, !201, !202, !203, !204, !209, !211, !212, !213, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !193, file: !79, line: 241, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !79, line: 166, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!77, !77, !77}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !193, file: !79, line: 242, baseType: !196, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !193, file: !79, line: 243, baseType: !196, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !193, file: !79, line: 244, baseType: !196, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !193, file: !79, line: 245, baseType: !196, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !193, file: !79, line: 246, baseType: !205, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !79, line: 167, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!77, !77, !77, !77}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !193, file: !79, line: 247, baseType: !210, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !79, line: 165, baseType: !187)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !193, file: !79, line: 248, baseType: !210, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !193, file: !79, line: 249, baseType: !210, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !193, file: !79, line: 250, baseType: !214, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !79, line: 168, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!116, !77}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !193, file: !79, line: 251, baseType: !210, size: 64, align: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !193, file: !79, line: 252, baseType: !196, size: 64, align: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !193, file: !79, line: 253, baseType: !196, size: 64, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !193, file: !79, line: 254, baseType: !196, size: 64, align: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !193, file: !79, line: 255, baseType: !196, size: 64, align: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !193, file: !79, line: 256, baseType: !196, size: 64, align: 64, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !193, file: !79, line: 257, baseType: !210, size: 64, align: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !193, file: !79, line: 258, baseType: !76, size: 64, align: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !193, file: !79, line: 259, baseType: !210, size: 64, align: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !193, file: !79, line: 261, baseType: !196, size: 64, align: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !193, file: !79, line: 262, baseType: !196, size: 64, align: 64, offset: 1280)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !193, file: !79, line: 263, baseType: !196, size: 64, align: 64, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !193, file: !79, line: 264, baseType: !196, size: 64, align: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !193, file: !79, line: 265, baseType: !205, size: 64, align: 64, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !193, file: !79, line: 266, baseType: !196, size: 64, align: 64, offset: 1536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !193, file: !79, line: 267, baseType: !196, size: 64, align: 64, offset: 1600)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !193, file: !79, line: 268, baseType: !196, size: 64, align: 64, offset: 1664)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !193, file: !79, line: 269, baseType: !196, size: 64, align: 64, offset: 1728)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !193, file: !79, line: 270, baseType: !196, size: 64, align: 64, offset: 1792)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !193, file: !79, line: 272, baseType: !196, size: 64, align: 64, offset: 1856)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !193, file: !79, line: 273, baseType: !196, size: 64, align: 64, offset: 1920)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !193, file: !79, line: 274, baseType: !196, size: 64, align: 64, offset: 1984)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !193, file: !79, line: 275, baseType: !196, size: 64, align: 64, offset: 2048)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !193, file: !79, line: 277, baseType: !210, size: 64, align: 64, offset: 2112)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !92, file: !79, line: 351, baseType: !243, size: 64, align: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !79, line: 292, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 280, size: 640, align: 64, elements: !246)
!246 = !{!247, !252, !253, !258, !259, !260, !265, !266, !271, !272}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !245, file: !79, line: 281, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !79, line: 169, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!83, !77}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !245, file: !79, line: 282, baseType: !196, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !245, file: !79, line: 283, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !79, line: 170, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!77, !77, !83}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !245, file: !79, line: 284, baseType: !254, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !245, file: !79, line: 285, baseType: !76, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !245, file: !79, line: 286, baseType: !261, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !79, line: 172, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!116, !77, !83, !77}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !245, file: !79, line: 287, baseType: !76, size: 64, align: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !245, file: !79, line: 288, baseType: !267, size: 64, align: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !79, line: 231, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!116, !77, !77}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !245, file: !79, line: 290, baseType: !196, size: 64, align: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !245, file: !79, line: 291, baseType: !254, size: 64, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !92, file: !79, line: 352, baseType: !274, size: 64, align: 64, offset: 896)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !79, line: 298, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 294, size: 192, align: 64, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !276, file: !79, line: 295, baseType: !248, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !276, file: !79, line: 296, baseType: !196, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !276, file: !79, line: 297, baseType: !281, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !79, line: 174, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!116, !77, !77, !77}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !92, file: !79, line: 356, baseType: !286, size: 64, align: 64, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !79, line: 321, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !77}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !84, line: 186, baseType: !83)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !92, file: !79, line: 357, baseType: !205, size: 64, align: 64, offset: 1024)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !92, file: !79, line: 358, baseType: !186, size: 64, align: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !92, file: !79, line: 359, baseType: !294, size: 64, align: 64, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !79, line: 317, baseType: !197)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !92, file: !79, line: 360, baseType: !296, size: 64, align: 64, offset: 1216)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !79, line: 319, baseType: !282)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !92, file: !79, line: 363, baseType: !298, size: 64, align: 64, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !79, line: 304, baseType: !300)
!300 = !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 301, size: 128, align: 64, elements: !301)
!301 = !{!302, !323}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !300, file: !79, line: 302, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !79, line: 193, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!116, !77, !307, !116}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !79, line: 191, baseType: !309)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !79, line: 178, size: 640, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !320, !321, !322}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !309, file: !79, line: 179, baseType: !76, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !309, file: !79, line: 180, baseType: !77, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !309, file: !79, line: 181, baseType: !83, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !309, file: !79, line: 182, baseType: !83, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !309, file: !79, line: 184, baseType: !116, size: 32, align: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !309, file: !79, line: 185, baseType: !116, size: 32, align: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !309, file: !79, line: 186, baseType: !124, size: 64, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !309, file: !79, line: 187, baseType: !319, size: 64, align: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !309, file: !79, line: 188, baseType: !319, size: 64, align: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !309, file: !79, line: 189, baseType: !319, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !309, file: !79, line: 190, baseType: !76, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !300, file: !79, line: 303, baseType: !324, size: 64, align: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !79, line: 194, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !77, !307}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !92, file: !79, line: 366, baseType: !168, size: 64, align: 64, offset: 1344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !92, file: !79, line: 368, baseType: !101, size: 64, align: 64, offset: 1408)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !92, file: !79, line: 372, baseType: !331, size: 64, align: 64, offset: 1472)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !79, line: 233, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!116, !77, !335, !76}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !79, line: 232, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!116, !77, !76}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !92, file: !79, line: 375, baseType: !214, size: 64, align: 64, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !92, file: !79, line: 379, baseType: !341, size: 64, align: 64, offset: 1600)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !79, line: 322, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!77, !77, !77, !116}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !92, file: !79, line: 382, baseType: !83, size: 64, align: 64, offset: 1664)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !92, file: !79, line: 385, baseType: !347, size: 64, align: 64, offset: 1728)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !79, line: 323, baseType: !187)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !92, file: !79, line: 386, baseType: !349, size: 64, align: 64, offset: 1792)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !79, line: 324, baseType: !187)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !92, file: !79, line: 389, baseType: !351, size: 64, align: 64, offset: 1856)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !353, line: 40, size: 256, align: 64, elements: !354)
!353 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!354 = !{!355, !356, !358, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !352, file: !353, line: 41, baseType: !101, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !352, file: !353, line: 42, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !353, line: 18, baseType: !197)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !352, file: !353, line: 43, baseType: !116, size: 32, align: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !352, file: !353, line: 45, baseType: !101, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !92, file: !79, line: 390, baseType: !361, size: 64, align: 64, offset: 1920)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !79, line: 390, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !92, file: !79, line: 391, baseType: !364, size: 64, align: 64, offset: 1984)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !366, line: 11, size: 320, align: 64, elements: !367)
!366 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!367 = !{!368, !369, !374, !379, !380}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !365, file: !366, line: 12, baseType: !124, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !365, file: !366, line: 13, baseType: !370, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !366, line: 8, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!77, !77, !76}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !365, file: !366, line: 14, baseType: !375, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !366, line: 9, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!116, !77, !77, !76}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !365, file: !366, line: 15, baseType: !124, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !365, file: !366, line: 16, baseType: !76, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !92, file: !79, line: 392, baseType: !91, size: 64, align: 64, offset: 2048)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !92, file: !79, line: 393, baseType: !77, size: 64, align: 64, offset: 2112)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !92, file: !79, line: 394, baseType: !384, size: 64, align: 64, offset: 2176)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !79, line: 325, baseType: !206)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !92, file: !79, line: 395, baseType: !386, size: 64, align: 64, offset: 2240)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !79, line: 326, baseType: !282)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !92, file: !79, line: 396, baseType: !83, size: 64, align: 64, offset: 2304)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !92, file: !79, line: 397, baseType: !389, size: 64, align: 64, offset: 2368)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !79, line: 327, baseType: !282)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !92, file: !79, line: 398, baseType: !391, size: 64, align: 64, offset: 2432)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !79, line: 329, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!77, !91, !83}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !92, file: !79, line: 399, baseType: !396, size: 64, align: 64, offset: 2496)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !79, line: 328, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!77, !91, !77, !77}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !92, file: !79, line: 400, baseType: !401, size: 64, align: 64, offset: 2560)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !79, line: 307, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !76}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !92, file: !79, line: 401, baseType: !214, size: 64, align: 64, offset: 2624)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !92, file: !79, line: 402, baseType: !77, size: 64, align: 64, offset: 2688)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !92, file: !79, line: 403, baseType: !77, size: 64, align: 64, offset: 2752)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !92, file: !79, line: 404, baseType: !77, size: 64, align: 64, offset: 2816)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !92, file: !79, line: 405, baseType: !77, size: 64, align: 64, offset: 2880)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !92, file: !79, line: 406, baseType: !77, size: 64, align: 64, offset: 2944)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !92, file: !79, line: 407, baseType: !107, size: 64, align: 64, offset: 3008)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !92, file: !79, line: 410, baseType: !413, size: 32, align: 32, offset: 3072)
!413 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !92, file: !79, line: 412, baseType: !107, size: 64, align: 64, offset: 3136)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyST_Object", file: !417, line: 190, baseType: !418)
!417 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/parsermodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!418 = !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 185, size: 256, align: 64, elements: !419)
!419 = !{!420, !421, !435, !436}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !418, file: !417, line: 186, baseType: !78, size: 128, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_node", scope: !418, file: !417, line: 187, baseType: !422, size: 64, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !424, line: 17, baseType: !425)
!424 = !DIFile(filename: "./Include/node.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !424, line: 10, size: 320, align: 64, elements: !426)
!426 = !{!427, !429, !430, !431, !432, !433}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !425, file: !424, line: 11, baseType: !428, size: 16, align: 16)
!428 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !425, file: !424, line: 12, baseType: !124, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !425, file: !424, line: 13, baseType: !116, size: 32, align: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !425, file: !424, line: 14, baseType: !116, size: 32, align: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !425, file: !424, line: 15, baseType: !116, size: 32, align: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !425, file: !424, line: 16, baseType: !434, size: 64, align: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "st_type", scope: !418, file: !417, line: 188, baseType: !116, size: 32, align: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !418, file: !417, line: 189, baseType: !437, size: 32, align: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompilerFlags", file: !438, line: 22, baseType: !439)
!438 = !DIFile(filename: "./Include/pythonrun.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!439 = !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 20, size: 32, align: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cf_flags", scope: !439, file: !438, line: 21, baseType: !116, size: 32, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!447 = !{!448, !485, !490, !497, !512, !758, !765, !772, !781, !805, !814, !821, !826, !852, !859, !864, !875, !932, !1076, !1082, !1088, !1094, !1097, !1114, !1121, !1132, !1137, !1142, !1150, !1154, !1160, !1168, !1174, !1179, !1185, !1191, !1197, !1203, !1206, !1217, !1220, !1226, !1231, !1237, !1243, !1247, !1251, !1259, !1262, !1266, !1271, !1275, !1280, !1285, !1290, !1293, !1296, !1302, !1307, !1324, !1329, !1332, !1341, !1346, !1392, !1398, !1402, !1410, !1418, !1424, !1429, !1434, !1440, !1445, !1450, !1455, !1461, !1466, !1472, !1475, !1558, !1561, !1565, !1568, !1573, !1578, !1586, !1589, !1595, !1600, !1608, !1612, !1618, !1623, !1629, !1635, !1640, !1649, !1654, !1659, !1683, !1688, !1699, !1704, !1709, !1714}
!448 = !DISubprogram(name: "PyInit_parser", scope: !417, file: !417, line: 3385, type: !449, isLocal: false, isDefinition: true, scopeLine: 3386, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_parser, variables: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!77}
!451 = !{!452, !453, !454, !457, !458, !460, !463, !465, !468, !470, !473, !475, !478, !480, !483}
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !448, file: !417, line: 3387, type: !77)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copyreg", scope: !448, file: !417, line: 3387, type: !77)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !455, file: !417, line: 3426, type: !77)
!455 = distinct !DILexicalBlock(scope: !456, file: !417, line: 3425, column: 32)
!456 = distinct !DILexicalBlock(scope: !448, file: !417, line: 3425, column: 9)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pickler", scope: !455, file: !417, line: 3426, type: !77)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !459, file: !417, line: 3434, type: !77)
!459 = distinct !DILexicalBlock(scope: !455, file: !417, line: 3434, column: 12)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !461, file: !417, line: 3437, type: !77)
!461 = distinct !DILexicalBlock(scope: !462, file: !417, line: 3436, column: 41)
!462 = distinct !DILexicalBlock(scope: !455, file: !417, line: 3435, column: 13)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !464, file: !417, line: 3441, type: !77)
!464 = distinct !DILexicalBlock(scope: !461, file: !417, line: 3441, column: 16)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !466, file: !417, line: 3441, type: !77)
!466 = distinct !DILexicalBlock(scope: !467, file: !417, line: 3441, column: 103)
!467 = distinct !DILexicalBlock(scope: !464, file: !417, line: 3441, column: 69)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !469, file: !417, line: 3443, type: !77)
!469 = distinct !DILexicalBlock(scope: !455, file: !417, line: 3443, column: 12)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !471, file: !417, line: 3443, type: !77)
!471 = distinct !DILexicalBlock(scope: !472, file: !417, line: 3443, column: 100)
!472 = distinct !DILexicalBlock(scope: !469, file: !417, line: 3443, column: 66)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !474, file: !417, line: 3444, type: !77)
!474 = distinct !DILexicalBlock(scope: !455, file: !417, line: 3444, column: 12)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !417, line: 3444, type: !77)
!476 = distinct !DILexicalBlock(scope: !477, file: !417, line: 3444, column: 114)
!477 = distinct !DILexicalBlock(scope: !474, file: !417, line: 3444, column: 80)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !479, file: !417, line: 3445, type: !77)
!479 = distinct !DILexicalBlock(scope: !455, file: !417, line: 3445, column: 12)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !481, file: !417, line: 3445, type: !77)
!481 = distinct !DILexicalBlock(scope: !482, file: !417, line: 3445, column: 103)
!482 = distinct !DILexicalBlock(scope: !479, file: !417, line: 3445, column: 69)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !417, line: 3446, type: !77)
!484 = distinct !DILexicalBlock(scope: !455, file: !417, line: 3446, column: 12)
!485 = !DISubprogram(name: "parser_free", scope: !417, file: !417, line: 384, type: !486, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyST_Object*)* @parser_free, variables: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !415}
!488 = !{!489}
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !485, file: !417, line: 384, type: !415)
!490 = !DISubprogram(name: "parser_richcompare", scope: !417, file: !417, line: 301, type: !343, isLocal: true, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @parser_richcompare, variables: !491)
!491 = !{!492, !493, !494, !495, !496}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 1, scope: !490, file: !417, line: 301, type: !77)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 2, scope: !490, file: !417, line: 301, type: !77)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !490, file: !417, line: 301, type: !116)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !490, file: !417, line: 303, type: !116)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !490, file: !417, line: 304, type: !77)
!497 = !DISubprogram(name: "parser_compare_nodes", scope: !417, file: !417, line: 262, type: !498, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._node*, %struct._node*)* @parser_compare_nodes, variables: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{!116, !422, !422}
!500 = !{!501, !502, !503, !504, !507, !508}
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 1, scope: !497, file: !417, line: 262, type: !422)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 2, scope: !497, file: !417, line: 262, type: !422)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !497, file: !417, line: 264, type: !116)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !505, file: !417, line: 273, type: !166)
!505 = distinct !DILexicalBlock(scope: !506, file: !417, line: 273, column: 32)
!506 = distinct !DILexicalBlock(scope: !497, file: !417, line: 272, column: 9)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !505, file: !417, line: 273, type: !166)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !509, file: !417, line: 282, type: !116)
!509 = distinct !DILexicalBlock(scope: !510, file: !417, line: 281, column: 49)
!510 = distinct !DILexicalBlock(scope: !511, file: !417, line: 281, column: 5)
!511 = distinct !DILexicalBlock(scope: !497, file: !417, line: 281, column: 5)
!512 = !DISubprogram(name: "parser_compilest", scope: !417, file: !417, line: 478, type: !513, isLocal: true, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_compilest, variables: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!77, !415, !77, !77}
!515 = !{!516, !517, !518, !519, !520, !525, !751, !752, !753, !755}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !512, file: !417, line: 478, type: !415)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !512, file: !417, line: 478, type: !77)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !512, file: !417, line: 478, type: !77)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !512, file: !417, line: 480, type: !77)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arena", scope: !512, file: !417, line: 481, type: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArena", file: !523, line: 12, baseType: !524)
!523 = !DIFile(filename: "./Include/pyarena.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arena", file: !523, line: 12, flags: DIFlagFwdDecl)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !512, file: !417, line: 482, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "mod_ty", file: !4, line: 5, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mod", file: !4, line: 44, size: 128, align: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !528, file: !4, line: 45, baseType: !3, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !528, file: !4, line: 63, baseType: !532, size: 64, align: 64, offset: 64)
!532 = !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !4, line: 46, size: 64, align: 64, elements: !533)
!533 = !{!534, !546, !550, !747}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Module", scope: !532, file: !4, line: 49, baseType: !535, size: 64, align: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !4, line: 47, size: 64, align: 64, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !535, file: !4, line: 48, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_seq", file: !540, line: 21, baseType: !541)
!540 = !DIFile(filename: "./Include/asdl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!541 = !DICompositeType(tag: DW_TAG_structure_type, file: !540, line: 18, size: 128, align: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !541, file: !540, line: 19, baseType: !83, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !541, file: !540, line: 20, baseType: !545, size: 64, align: 64, offset: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, align: 64, elements: !154)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Interactive", scope: !532, file: !4, line: 53, baseType: !547, size: 64, align: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !4, line: 51, size: 64, align: 64, elements: !548)
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !547, file: !4, line: 52, baseType: !538, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", scope: !532, file: !4, line: 57, baseType: !551, size: 64, align: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !4, line: 55, size: 64, align: 64, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !551, file: !4, line: 56, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_ty", file: !4, line: 9, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_expr", file: !4, line: 188, size: 448, align: 64, elements: !557)
!557 = !{!558, !559, !745, !746}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !556, file: !4, line: 189, baseType: !10, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !556, file: !4, line: 318, baseType: !560, size: 320, align: 64, offset: 64)
!560 = !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !4, line: 190, size: 320, align: 64, elements: !561)
!561 = !{!562, !568, !575, !581, !605, !611, !616, !620, !625, !630, !636, !641, !645, !649, !662, !670, !675, !680, !685, !690, !697, !725, !730, !735, !740}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "BoolOp", scope: !560, file: !4, line: 194, baseType: !563, size: 128, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 191, size: 128, align: 64, elements: !564)
!564 = !{!565, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !563, file: !4, line: 192, baseType: !566, size: 32, align: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolop_ty", file: !4, line: 16, baseType: !38)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !563, file: !4, line: 193, baseType: !538, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "BinOp", scope: !560, file: !4, line: 200, baseType: !569, size: 192, align: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 196, size: 192, align: 64, elements: !570)
!570 = !{!571, !572, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !569, file: !4, line: 197, baseType: !554, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !569, file: !4, line: 198, baseType: !573, size: 32, align: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "operator_ty", file: !4, line: 20, baseType: !42)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !569, file: !4, line: 199, baseType: !554, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "UnaryOp", scope: !560, file: !4, line: 205, baseType: !576, size: 128, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 202, size: 128, align: 64, elements: !577)
!577 = !{!578, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !576, file: !4, line: 203, baseType: !579, size: 32, align: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryop_ty", file: !4, line: 22, baseType: !56)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "operand", scope: !576, file: !4, line: 204, baseType: !554, size: 64, align: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Lambda", scope: !560, file: !4, line: 210, baseType: !582, size: 128, align: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 207, size: 128, align: 64, elements: !583)
!583 = !{!584, !604}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !582, file: !4, line: 208, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments_ty", file: !4, line: 31, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arguments", file: !4, line: 365, size: 384, align: 64, elements: !588)
!588 = !{!589, !590, !600, !601, !602, !603}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !587, file: !4, line: 366, baseType: !538, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vararg", scope: !587, file: !4, line: 367, baseType: !591, size: 64, align: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_ty", file: !4, line: 33, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arg", file: !4, line: 374, size: 192, align: 64, elements: !594)
!594 = !{!595, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !593, file: !4, line: 375, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "identifier", file: !540, line: 4, baseType: !77)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "annotation", scope: !593, file: !4, line: 376, baseType: !554, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !593, file: !4, line: 377, baseType: !116, size: 32, align: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !593, file: !4, line: 378, baseType: !116, size: 32, align: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "kwonlyargs", scope: !587, file: !4, line: 368, baseType: !538, size: 64, align: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "kw_defaults", scope: !587, file: !4, line: 369, baseType: !538, size: 64, align: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "kwarg", scope: !587, file: !4, line: 370, baseType: !591, size: 64, align: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !587, file: !4, line: 371, baseType: !538, size: 64, align: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !582, file: !4, line: 209, baseType: !554, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "IfExp", scope: !560, file: !4, line: 216, baseType: !606, size: 192, align: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 212, size: 192, align: 64, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !606, file: !4, line: 213, baseType: !554, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !606, file: !4, line: 214, baseType: !554, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !606, file: !4, line: 215, baseType: !554, size: 64, align: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Dict", scope: !560, file: !4, line: 221, baseType: !612, size: 128, align: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 218, size: 128, align: 64, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !612, file: !4, line: 219, baseType: !538, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !612, file: !4, line: 220, baseType: !538, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Set", scope: !560, file: !4, line: 225, baseType: !617, size: 64, align: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 223, size: 64, align: 64, elements: !618)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !617, file: !4, line: 224, baseType: !538, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ListComp", scope: !560, file: !4, line: 230, baseType: !621, size: 128, align: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 227, size: 128, align: 64, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !621, file: !4, line: 228, baseType: !554, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !621, file: !4, line: 229, baseType: !538, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "SetComp", scope: !560, file: !4, line: 235, baseType: !626, size: 128, align: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 232, size: 128, align: 64, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !626, file: !4, line: 233, baseType: !554, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !626, file: !4, line: 234, baseType: !538, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DictComp", scope: !560, file: !4, line: 241, baseType: !631, size: 192, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 237, size: 192, align: 64, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !631, file: !4, line: 238, baseType: !554, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !631, file: !4, line: 239, baseType: !554, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !631, file: !4, line: 240, baseType: !538, size: 64, align: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GeneratorExp", scope: !560, file: !4, line: 246, baseType: !637, size: 128, align: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 243, size: 128, align: 64, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !637, file: !4, line: 244, baseType: !554, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !637, file: !4, line: 245, baseType: !538, size: 64, align: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Yield", scope: !560, file: !4, line: 250, baseType: !642, size: 64, align: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 248, size: 64, align: 64, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !642, file: !4, line: 249, baseType: !554, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "YieldFrom", scope: !560, file: !4, line: 254, baseType: !646, size: 64, align: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 252, size: 64, align: 64, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !646, file: !4, line: 253, baseType: !554, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Compare", scope: !560, file: !4, line: 260, baseType: !650, size: 192, align: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 256, size: 192, align: 64, elements: !651)
!651 = !{!652, !653, !661}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !650, file: !4, line: 257, baseType: !554, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !650, file: !4, line: 258, baseType: !654, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_int_seq", file: !540, line: 26, baseType: !656)
!656 = !DICompositeType(tag: DW_TAG_structure_type, file: !540, line: 23, size: 128, align: 64, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !656, file: !540, line: 24, baseType: !83, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !656, file: !540, line: 25, baseType: !660, size: 32, align: 32, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, align: 32, elements: !154)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "comparators", scope: !650, file: !4, line: 259, baseType: !538, size: 64, align: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Call", scope: !560, file: !4, line: 268, baseType: !663, size: 320, align: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 262, size: 320, align: 64, elements: !664)
!664 = !{!665, !666, !667, !668, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !663, file: !4, line: 263, baseType: !554, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !663, file: !4, line: 264, baseType: !538, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !663, file: !4, line: 265, baseType: !538, size: 64, align: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !663, file: !4, line: 266, baseType: !554, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !663, file: !4, line: 267, baseType: !554, size: 64, align: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Num", scope: !560, file: !4, line: 272, baseType: !671, size: 64, align: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 270, size: 64, align: 64, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !671, file: !4, line: 271, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !540, line: 7, baseType: !77)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !560, file: !4, line: 276, baseType: !676, size: 64, align: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 274, size: 64, align: 64, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !676, file: !4, line: 275, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !540, line: 5, baseType: !77)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", scope: !560, file: !4, line: 280, baseType: !681, size: 64, align: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 278, size: 64, align: 64, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !681, file: !4, line: 279, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytes", file: !540, line: 6, baseType: !77)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "NameConstant", scope: !560, file: !4, line: 284, baseType: !686, size: 64, align: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 282, size: 64, align: 64, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !686, file: !4, line: 283, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "singleton", file: !540, line: 8, baseType: !77)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !560, file: !4, line: 290, baseType: !691, size: 192, align: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 286, size: 192, align: 64, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !691, file: !4, line: 287, baseType: !554, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !691, file: !4, line: 288, baseType: !596, size: 64, align: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !691, file: !4, line: 289, baseType: !696, size: 32, align: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_context_ty", file: !4, line: 12, baseType: !62)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Subscript", scope: !560, file: !4, line: 296, baseType: !698, size: 192, align: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 292, size: 192, align: 64, elements: !699)
!699 = !{!700, !701, !724}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !698, file: !4, line: 293, baseType: !554, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !698, file: !4, line: 294, baseType: !702, size: 64, align: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "slice_ty", file: !4, line: 14, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "_slice", file: !4, line: 324, size: 256, align: 64, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !704, file: !4, line: 325, baseType: !70, size: 32, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !704, file: !4, line: 341, baseType: !708, size: 192, align: 64, offset: 64)
!708 = !DICompositeType(tag: DW_TAG_union_type, scope: !704, file: !4, line: 326, size: 192, align: 64, elements: !709)
!709 = !{!710, !716, !720}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !708, file: !4, line: 331, baseType: !711, size: 192, align: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !4, line: 327, size: 192, align: 64, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !711, file: !4, line: 328, baseType: !554, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !711, file: !4, line: 329, baseType: !554, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !711, file: !4, line: 330, baseType: !554, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ExtSlice", scope: !708, file: !4, line: 335, baseType: !717, size: 64, align: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !4, line: 333, size: 64, align: 64, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !717, file: !4, line: 334, baseType: !538, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !708, file: !4, line: 339, baseType: !721, size: 64, align: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !4, line: 337, size: 64, align: 64, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !721, file: !4, line: 338, baseType: !554, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !698, file: !4, line: 295, baseType: !696, size: 32, align: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Starred", scope: !560, file: !4, line: 301, baseType: !726, size: 128, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 298, size: 128, align: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !726, file: !4, line: 299, baseType: !554, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !726, file: !4, line: 300, baseType: !696, size: 32, align: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !560, file: !4, line: 306, baseType: !731, size: 128, align: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 303, size: 128, align: 64, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !731, file: !4, line: 304, baseType: !596, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !731, file: !4, line: 305, baseType: !696, size: 32, align: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !560, file: !4, line: 311, baseType: !736, size: 128, align: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 308, size: 128, align: 64, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !736, file: !4, line: 309, baseType: !538, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !736, file: !4, line: 310, baseType: !696, size: 32, align: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Tuple", scope: !560, file: !4, line: 316, baseType: !741, size: 128, align: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !4, line: 313, size: 128, align: 64, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !741, file: !4, line: 314, baseType: !538, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !741, file: !4, line: 315, baseType: !696, size: 32, align: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !556, file: !4, line: 319, baseType: !116, size: 32, align: 32, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !556, file: !4, line: 320, baseType: !116, size: 32, align: 32, offset: 416)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Suite", scope: !532, file: !4, line: 61, baseType: !748, size: 64, align: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !4, line: 59, size: 64, align: 64, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !748, file: !4, line: 60, baseType: !538, size: 64, align: 64)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !512, file: !417, line: 483, type: !77)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !512, file: !417, line: 484, type: !116)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !754, file: !417, line: 516, type: !77)
!754 = distinct !DILexicalBlock(scope: !512, file: !417, line: 516, column: 8)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !417, line: 516, type: !77)
!756 = distinct !DILexicalBlock(scope: !757, file: !417, line: 516, column: 100)
!757 = distinct !DILexicalBlock(scope: !754, file: !417, line: 516, column: 66)
!758 = !DISubprogram(name: "parser_isexpr", scope: !417, file: !417, line: 531, type: !513, isLocal: true, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_isexpr, variables: !759)
!759 = !{!760, !761, !762, !763, !764}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !758, file: !417, line: 531, type: !415)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !758, file: !417, line: 531, type: !77)
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !758, file: !417, line: 531, type: !77)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !758, file: !417, line: 533, type: !77)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !758, file: !417, line: 534, type: !116)
!765 = !DISubprogram(name: "parser_issuite", scope: !417, file: !417, line: 554, type: !513, isLocal: true, isDefinition: true, scopeLine: 555, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_issuite, variables: !766)
!766 = !{!767, !768, !769, !770, !771}
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !765, file: !417, line: 554, type: !415)
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !765, file: !417, line: 554, type: !77)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !765, file: !417, line: 554, type: !77)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !765, file: !417, line: 556, type: !77)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !765, file: !417, line: 557, type: !116)
!772 = !DISubprogram(name: "parser_st2list", scope: !417, file: !417, line: 443, type: !513, isLocal: true, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_st2list, variables: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !772, file: !417, line: 443, type: !415)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !772, file: !417, line: 443, type: !77)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !772, file: !417, line: 443, type: !77)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_info", scope: !772, file: !417, line: 445, type: !116)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col_info", scope: !772, file: !417, line: 446, type: !116)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !772, file: !417, line: 447, type: !77)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !772, file: !417, line: 448, type: !116)
!781 = !DISubprogram(name: "node2tuple", scope: !417, file: !417, line: 80, type: !782, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._node*, %struct._object* (i64)*, i32 (%struct._object*, i64, %struct._object*)*, i32, i32)* @node2tuple, variables: !789)
!782 = !DISubroutineType(types: !783)
!783 = !{!77, !422, !784, !788, !116, !116}
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "SeqMaker", file: !417, line: 64, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!77, !83}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SeqInserter", file: !417, line: 65, baseType: !262)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !800, !802}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !781, file: !417, line: 80, type: !422)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mkseq", arg: 2, scope: !781, file: !417, line: 81, type: !784)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "addelem", arg: 3, scope: !781, file: !417, line: 82, type: !788)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 4, scope: !781, file: !417, line: 83, type: !116)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col_offset", arg: 5, scope: !781, file: !417, line: 84, type: !116)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !781, file: !417, line: 86, type: !77)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !781, file: !417, line: 86, type: !77)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !798, file: !417, line: 94, type: !116)
!798 = distinct !DILexicalBlock(scope: !799, file: !417, line: 93, column: 35)
!799 = distinct !DILexicalBlock(scope: !781, file: !417, line: 93, column: 9)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !801, file: !417, line: 156, type: !77)
!801 = distinct !DILexicalBlock(scope: !781, file: !417, line: 156, column: 8)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !417, line: 156, type: !77)
!803 = distinct !DILexicalBlock(scope: !804, file: !417, line: 156, column: 98)
!804 = distinct !DILexicalBlock(scope: !801, file: !417, line: 156, column: 64)
!805 = !DISubprogram(name: "parser_st2tuple", scope: !417, file: !417, line: 407, type: !513, isLocal: true, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_st2tuple, variables: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813}
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !805, file: !417, line: 407, type: !415)
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !805, file: !417, line: 407, type: !77)
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !805, file: !417, line: 407, type: !77)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_info", scope: !805, file: !417, line: 409, type: !116)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col_info", scope: !805, file: !417, line: 410, type: !116)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !805, file: !417, line: 411, type: !77)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !805, file: !417, line: 412, type: !116)
!814 = !DISubprogram(name: "parser_sizeof", scope: !417, file: !417, line: 391, type: !815, isLocal: true, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, i8*)* @parser_sizeof, variables: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!77, !415, !76}
!817 = !{!818, !819, !820}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !814, file: !417, line: 391, type: !415)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !814, file: !417, line: 391, type: !76)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !814, file: !417, line: 393, type: !83)
!821 = !DISubprogram(name: "parser_expr", scope: !417, file: !417, line: 634, type: !513, isLocal: true, isDefinition: true, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_expr, variables: !822)
!822 = !{!823, !824, !825}
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !821, file: !417, line: 634, type: !415)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !821, file: !417, line: 634, type: !77)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !821, file: !417, line: 634, type: !77)
!826 = !DISubprogram(name: "parser_do_parse", scope: !417, file: !417, line: 595, type: !827, isLocal: true, isDefinition: true, scopeLine: 596, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i8*, i32)* @parser_do_parse, variables: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!77, !77, !77, !124, !116}
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !849}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !826, file: !417, line: 595, type: !77)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 2, scope: !826, file: !417, line: 595, type: !77)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argspec", arg: 3, scope: !826, file: !417, line: 595, type: !124)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 4, scope: !826, file: !417, line: 595, type: !116)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !826, file: !417, line: 597, type: !124)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !826, file: !417, line: 598, type: !77)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !826, file: !417, line: 599, type: !116)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !826, file: !417, line: 600, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "perrdetail", file: !839, line: 21, baseType: !840)
!839 = !DIFile(filename: "./Include/parsetok.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!840 = !DICompositeType(tag: DW_TAG_structure_type, file: !839, line: 10, size: 320, align: 64, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !840, file: !839, line: 11, baseType: !116, size: 32, align: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !840, file: !839, line: 14, baseType: !77, size: 64, align: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !840, file: !839, line: 16, baseType: !116, size: 32, align: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !840, file: !839, line: 17, baseType: !116, size: 32, align: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !840, file: !839, line: 18, baseType: !124, size: 64, align: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !840, file: !839, line: 19, baseType: !116, size: 32, align: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !840, file: !839, line: 20, baseType: !116, size: 32, align: 32, offset: 288)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !850, file: !417, line: 605, type: !422)
!850 = distinct !DILexicalBlock(scope: !851, file: !417, line: 604, column: 76)
!851 = distinct !DILexicalBlock(scope: !826, file: !417, line: 604, column: 9)
!852 = !DISubprogram(name: "parser_newstobject", scope: !417, file: !417, line: 362, type: !853, isLocal: true, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._node*, i32)* @parser_newstobject, variables: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{!77, !422, !116}
!855 = !{!856, !857, !858}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !852, file: !417, line: 362, type: !422)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !852, file: !417, line: 362, type: !116)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !852, file: !417, line: 364, type: !415)
!859 = !DISubprogram(name: "parser_suite", scope: !417, file: !417, line: 642, type: !513, isLocal: true, isDefinition: true, scopeLine: 643, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_suite, variables: !860)
!860 = !{!861, !862, !863}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !859, file: !417, line: 642, type: !415)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !859, file: !417, line: 642, type: !77)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !859, file: !417, line: 642, type: !77)
!864 = !DISubprogram(name: "parser_tuple2st", scope: !417, file: !417, line: 686, type: !513, isLocal: true, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyST_Object*, %struct._object*, %struct._object*)* @parser_tuple2st, variables: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872}
!866 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !864, file: !417, line: 686, type: !415)
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !864, file: !417, line: 686, type: !77)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !864, file: !417, line: 686, type: !77)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !864, file: !417, line: 689, type: !77)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !864, file: !417, line: 690, type: !77)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tree", scope: !864, file: !417, line: 691, type: !422)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_sym", scope: !873, file: !417, line: 708, type: !116)
!873 = distinct !DILexicalBlock(scope: !874, file: !417, line: 707, column: 20)
!874 = distinct !DILexicalBlock(scope: !864, file: !417, line: 707, column: 9)
!875 = !DISubprogram(name: "build_node_tree", scope: !417, file: !417, line: 901, type: !876, isLocal: true, isDefinition: true, scopeLine: 902, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct._object*)* @build_node_tree, variables: !878)
!876 = !DISubroutineType(types: !877)
!877 = !{!422, !77}
!878 = !{!879, !880, !881, !882, !883, !885, !888, !892, !895, !898, !899, !904, !905, !909, !911, !913, !917, !919, !921, !923, !925, !927, !929}
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tuple", arg: 1, scope: !875, file: !417, line: 901, type: !77)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !875, file: !417, line: 903, type: !422)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !875, file: !417, line: 904, type: !77)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !875, file: !417, line: 905, type: !89)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !884, file: !417, line: 909, type: !77)
!884 = distinct !DILexicalBlock(scope: !875, file: !417, line: 909, column: 8)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !417, line: 909, type: !77)
!886 = distinct !DILexicalBlock(scope: !887, file: !417, line: 909, column: 96)
!887 = distinct !DILexicalBlock(scope: !884, file: !417, line: 909, column: 62)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !889, file: !417, line: 918, type: !77)
!889 = distinct !DILexicalBlock(scope: !890, file: !417, line: 918, column: 12)
!890 = distinct !DILexicalBlock(scope: !891, file: !417, line: 910, column: 24)
!891 = distinct !DILexicalBlock(scope: !875, file: !417, line: 910, column: 9)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !893, file: !417, line: 918, type: !77)
!893 = distinct !DILexicalBlock(scope: !894, file: !417, line: 918, column: 101)
!894 = distinct !DILexicalBlock(scope: !889, file: !417, line: 918, column: 67)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_num", scope: !896, file: !417, line: 924, type: !116)
!896 = distinct !DILexicalBlock(scope: !897, file: !417, line: 920, column: 30)
!897 = distinct !DILexicalBlock(scope: !891, file: !417, line: 920, column: 14)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !896, file: !417, line: 925, type: !77)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !900, file: !417, line: 941, type: !83)
!900 = distinct !DILexicalBlock(scope: !901, file: !417, line: 940, column: 34)
!901 = distinct !DILexicalBlock(scope: !902, file: !417, line: 940, column: 17)
!902 = distinct !DILexicalBlock(scope: !903, file: !417, line: 935, column: 32)
!903 = distinct !DILexicalBlock(scope: !896, file: !417, line: 935, column: 13)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !900, file: !417, line: 942, type: !101)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !906, file: !417, line: 945, type: !77)
!906 = distinct !DILexicalBlock(scope: !907, file: !417, line: 945, column: 24)
!907 = distinct !DILexicalBlock(scope: !908, file: !417, line: 944, column: 41)
!908 = distinct !DILexicalBlock(scope: !900, file: !417, line: 944, column: 21)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !910, file: !417, line: 946, type: !77)
!910 = distinct !DILexicalBlock(scope: !907, file: !417, line: 946, column: 24)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !912, file: !417, line: 947, type: !77)
!912 = distinct !DILexicalBlock(scope: !907, file: !417, line: 947, column: 24)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !914, file: !417, line: 952, type: !77)
!914 = distinct !DILexicalBlock(scope: !915, file: !417, line: 952, column: 24)
!915 = distinct !DILexicalBlock(scope: !916, file: !417, line: 951, column: 47)
!916 = distinct !DILexicalBlock(scope: !900, file: !417, line: 951, column: 21)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !918, file: !417, line: 953, type: !77)
!918 = distinct !DILexicalBlock(scope: !915, file: !417, line: 953, column: 24)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !920, file: !417, line: 954, type: !77)
!920 = distinct !DILexicalBlock(scope: !915, file: !417, line: 954, column: 24)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !922, file: !417, line: 959, type: !77)
!922 = distinct !DILexicalBlock(scope: !900, file: !417, line: 959, column: 20)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !924, file: !417, line: 960, type: !77)
!924 = distinct !DILexicalBlock(scope: !900, file: !417, line: 960, column: 20)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !926, file: !417, line: 969, type: !77)
!926 = distinct !DILexicalBlock(scope: !897, file: !417, line: 964, column: 10)
!927 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !928, file: !417, line: 972, type: !77)
!928 = distinct !DILexicalBlock(scope: !926, file: !417, line: 972, column: 12)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !930, file: !417, line: 972, type: !77)
!930 = distinct !DILexicalBlock(scope: !931, file: !417, line: 972, column: 99)
!931 = distinct !DILexicalBlock(scope: !928, file: !417, line: 972, column: 65)
!932 = !DISubprogram(name: "build_node_children", scope: !417, file: !417, line: 755, type: !933, isLocal: true, isDefinition: true, scopeLine: 756, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct._object*, %struct._node*, i32*)* @build_node_children, variables: !936)
!933 = !DISubroutineType(types: !934)
!934 = !{!422, !77, !422, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !947, !948, !949, !950, !953, !961, !963, !965, !968, !970, !973, !975, !978, !981, !982, !983, !987, !989, !992, !997, !1001, !1003, !1005, !1008, !1010, !1012, !1014, !1018, !1020, !1023, !1027, !1029, !1032, !1034, !1037, !1039, !1042, !1044, !1047, !1051, !1054, !1058, !1061, !1064, !1068, !1071, !1073}
!937 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tuple", arg: 1, scope: !932, file: !417, line: 755, type: !77)
!938 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "root", arg: 2, scope: !932, file: !417, line: 755, type: !422)
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line_num", arg: 3, scope: !932, file: !417, line: 755, type: !935)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !932, file: !417, line: 757, type: !83)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !932, file: !417, line: 758, type: !83)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !932, file: !417, line: 759, type: !116)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !944, file: !417, line: 763, type: !77)
!944 = distinct !DILexicalBlock(scope: !945, file: !417, line: 761, column: 31)
!945 = distinct !DILexicalBlock(scope: !946, file: !417, line: 761, column: 5)
!946 = distinct !DILexicalBlock(scope: !932, file: !417, line: 761, column: 5)
