; ModuleID = 'irs-onlybc/parsetok.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._node = type { i16, i8*, i32, i32, i32, %struct._node* }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }
%struct.perrdetail = type { i32, %struct._object*, i32, i32, i8*, i32, i32 }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !354)
!1 = !DIFile(filename: "parsetok.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "decoding_state", file: !4, line: 15, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Parser/tokenizer.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "STATE_INIT", value: 0)
!7 = !DIEnumerator(name: "STATE_RAW", value: 1)
!8 = !DIEnumerator(name: "STATE_NORMAL", value: 2)
!9 = !{!10, !11, !58, !100, !349, !351, !35, !50}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !108, !113, !118, !119, !124, !176, !207, !219, !225, !226, !227, !229, !231, !262, !263, !264, !273, !274, !279, !280, !282, !284, !294, !297, !315, !316, !317, !319, !321, !322, !324, !329, !334, !339, !340, !341, !342, !343, !344, !345, !346, !348}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !96, !97, !98, !99, !103, !104}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !10, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !10, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !10, size: 64, align: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !10, size: 64, align: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !100, size: 64, align: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !102)
!101 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!11, !11, !58}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !114, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!50, !11, !58, !11}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !10, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !120, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!11, !11}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !143, !145, !146, !147, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !127, file: !13, line: 241, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!11, !11, !11}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !127, file: !13, line: 242, baseType: !130, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !127, file: !13, line: 243, baseType: !130, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !127, file: !13, line: 244, baseType: !130, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !127, file: !13, line: 245, baseType: !130, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !127, file: !13, line: 246, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!11, !11, !11, !11}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !127, file: !13, line: 247, baseType: !144, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !121)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !127, file: !13, line: 248, baseType: !144, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !127, file: !13, line: 249, baseType: !144, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !127, file: !13, line: 250, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!50, !11}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !127, file: !13, line: 251, baseType: !144, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !127, file: !13, line: 252, baseType: !130, size: 64, align: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !127, file: !13, line: 253, baseType: !130, size: 64, align: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !127, file: !13, line: 254, baseType: !130, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !127, file: !13, line: 255, baseType: !130, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !127, file: !13, line: 256, baseType: !130, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !127, file: !13, line: 257, baseType: !144, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !127, file: !13, line: 258, baseType: !10, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !127, file: !13, line: 259, baseType: !144, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !127, file: !13, line: 261, baseType: !130, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !127, file: !13, line: 262, baseType: !130, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !127, file: !13, line: 263, baseType: !130, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !127, file: !13, line: 264, baseType: !130, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !127, file: !13, line: 265, baseType: !139, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !127, file: !13, line: 266, baseType: !130, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !127, file: !13, line: 267, baseType: !130, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !127, file: !13, line: 268, baseType: !130, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !127, file: !13, line: 269, baseType: !130, size: 64, align: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !127, file: !13, line: 270, baseType: !130, size: 64, align: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !127, file: !13, line: 272, baseType: !130, size: 64, align: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !127, file: !13, line: 273, baseType: !130, size: 64, align: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !127, file: !13, line: 274, baseType: !130, size: 64, align: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !127, file: !13, line: 275, baseType: !130, size: 64, align: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !127, file: !13, line: 277, baseType: !144, size: 64, align: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !177, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !180)
!180 = !{!181, !186, !187, !192, !193, !194, !199, !200, !205, !206}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !179, file: !13, line: 281, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!17, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !179, file: !13, line: 282, baseType: !130, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !179, file: !13, line: 283, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!11, !11, !17}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !179, file: !13, line: 284, baseType: !188, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !179, file: !13, line: 285, baseType: !10, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !179, file: !13, line: 286, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !11, !17, !11}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !179, file: !13, line: 287, baseType: !10, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !179, file: !13, line: 288, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!50, !11, !11}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !179, file: !13, line: 290, baseType: !130, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !179, file: !13, line: 291, baseType: !188, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !208, size: 64, align: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !210, file: !13, line: 295, baseType: !182, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !210, file: !13, line: 296, baseType: !130, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !210, file: !13, line: 297, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!50, !11, !11, !11}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !220, size: 64, align: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !11}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !139, size: 64, align: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !120, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !228, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !131)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !230, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !235)
!235 = !{!236, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !234, file: !13, line: 302, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!50, !11, !241, !50}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !13, line: 179, baseType: !10, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !13, line: 187, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !13, line: 188, baseType: !253, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !13, line: 189, baseType: !253, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !13, line: 190, baseType: !10, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !234, file: !13, line: 303, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !11, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !102, size: 64, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !265, size: 64, align: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!50, !11, !269, !10}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!50, !11, !10}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !148, size: 64, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !275, size: 64, align: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!11, !11, !11, !50}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !281, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !121)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !283, size: 64, align: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !121)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !285, size: 64, align: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !287, line: 40, size: 256, align: 64, elements: !288)
!287 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!288 = !{!289, !290, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !286, file: !287, line: 41, baseType: !35, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !286, file: !287, line: 42, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !287, line: 18, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !286, file: !287, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !286, file: !287, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !295, size: 64, align: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !13, line: 390, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !298, size: 64, align: 64, offset: 1984)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !300, line: 11, size: 320, align: 64, elements: !301)
!300 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!301 = !{!302, !303, !308, !313, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !300, line: 12, baseType: !58, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !299, file: !300, line: 13, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !300, line: 8, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!11, !11, !10}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !299, file: !300, line: 14, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !300, line: 9, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!50, !11, !11, !10}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !299, file: !300, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !299, file: !300, line: 16, baseType: !10, size: 64, align: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !318, size: 64, align: 64, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !140)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !320, size: 64, align: 64, offset: 2240)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !323, size: 64, align: 64, offset: 2368)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !325, size: 64, align: 64, offset: 2432)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!11, !25, !17}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !330, size: 64, align: 64, offset: 2496)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!11, !25, !11, !11}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !335, size: 64, align: 64, offset: 2560)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !10}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !148, size: 64, align: 64, offset: 2624)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !347, size: 32, align: 32, offset: 3072)
!347 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!354 = !{!355, !439, !448, !459, !509, !526, !537, !551, !565, !585, !660}
!355 = !DISubprogram(name: "PyParser_ParseString", scope: !356, file: !356, line: 20, type: !357, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (i8*, %struct.grammar*, i32, %struct.perrdetail*)* @PyParser_ParseString, variables: !434)
!356 = !DIFile(filename: "Parser/parsetok.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!357 = !DISubroutineType(types: !358)
!358 = !{!359, !35, !372, !50, !422}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !361, line: 17, baseType: !362)
!361 = !DIFile(filename: "Include/node.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !361, line: 10, size: 320, align: 64, elements: !363)
!363 = !{!364, !366, !367, !368, !369, !370}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !362, file: !361, line: 11, baseType: !365, size: 16, align: 16)
!365 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !362, file: !361, line: 12, baseType: !58, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !362, file: !361, line: 13, baseType: !50, size: 32, align: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !362, file: !361, line: 14, baseType: !50, size: 32, align: 32, offset: 160)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !362, file: !361, line: 15, baseType: !50, size: 32, align: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !362, file: !361, line: 16, baseType: !371, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !374, line: 67, baseType: !375)
!374 = !DIFile(filename: "Include/grammar.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 61, size: 320, align: 64, elements: !376)
!376 = !{!377, !378, !408, !420, !421}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !375, file: !374, line: 62, baseType: !50, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !375, file: !374, line: 63, baseType: !379, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !374, line: 57, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 50, size: 320, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !405}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !381, file: !374, line: 51, baseType: !50, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !381, file: !374, line: 52, baseType: !58, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !381, file: !374, line: 53, baseType: !50, size: 32, align: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !381, file: !374, line: 54, baseType: !50, size: 32, align: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !381, file: !374, line: 55, baseType: !388, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !374, line: 46, baseType: !390)
!390 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 37, size: 320, align: 64, elements: !391)
!391 = !{!392, !393, !400, !401, !402, !404}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !390, file: !374, line: 38, baseType: !50, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !390, file: !374, line: 39, baseType: !394, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !374, line: 33, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 30, size: 32, align: 16, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !396, file: !374, line: 31, baseType: !365, size: 16, align: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !396, file: !374, line: 32, baseType: !365, size: 16, align: 16, offset: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !390, file: !374, line: 42, baseType: !50, size: 32, align: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !390, file: !374, line: 43, baseType: !50, size: 32, align: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !390, file: !374, line: 44, baseType: !403, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !390, file: !374, line: 45, baseType: !50, size: 32, align: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !381, file: !374, line: 56, baseType: !406, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !407, line: 12, baseType: !58)
!407 = !DIFile(filename: "Include/bitset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !375, file: !374, line: 64, baseType: !409, size: 128, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !374, line: 26, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 23, size: 128, align: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !410, file: !374, line: 24, baseType: !50, size: 32, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !410, file: !374, line: 25, baseType: !414, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !374, line: 17, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 14, size: 128, align: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !416, file: !374, line: 15, baseType: !50, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !416, file: !374, line: 16, baseType: !58, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !375, file: !374, line: 65, baseType: !50, size: 32, align: 32, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !375, file: !374, line: 66, baseType: !50, size: 32, align: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "perrdetail", file: !424, line: 21, baseType: !425)
!424 = !DIFile(filename: "Include/parsetok.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 10, size: 320, align: 64, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !425, file: !424, line: 11, baseType: !50, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !425, file: !424, line: 14, baseType: !11, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !425, file: !424, line: 16, baseType: !50, size: 32, align: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !425, file: !424, line: 17, baseType: !50, size: 32, align: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !425, file: !424, line: 18, baseType: !58, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !425, file: !424, line: 19, baseType: !50, size: 32, align: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !425, file: !424, line: 20, baseType: !50, size: 32, align: 32, offset: 288)
!434 = !{!435, !436, !437, !438}
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !355, file: !356, line: 20, type: !35)
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !355, file: !356, line: 20, type: !372)
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !355, file: !356, line: 20, type: !50)
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 4, scope: !355, file: !356, line: 20, type: !422)
!439 = !DISubprogram(name: "PyParser_ParseStringFlags", scope: !356, file: !356, line: 26, type: !440, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (i8*, %struct.grammar*, i32, %struct.perrdetail*, i32)* @PyParser_ParseStringFlags, variables: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!359, !35, !372, !50, !422, !50}
!442 = !{!443, !444, !445, !446, !447}
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !439, file: !356, line: 26, type: !35)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !439, file: !356, line: 26, type: !372)
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !439, file: !356, line: 26, type: !50)
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 4, scope: !439, file: !356, line: 27, type: !422)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 5, scope: !439, file: !356, line: 27, type: !50)
!448 = !DISubprogram(name: "PyParser_ParseStringFlagsFilename", scope: !356, file: !356, line: 34, type: !449, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (i8*, i8*, %struct.grammar*, i32, %struct.perrdetail*, i32)* @PyParser_ParseStringFlagsFilename, variables: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!359, !35, !35, !372, !50, !422, !50}
!451 = !{!452, !453, !454, !455, !456, !457, !458}
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !448, file: !356, line: 34, type: !35)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !448, file: !356, line: 34, type: !35)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !448, file: !356, line: 35, type: !372)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !448, file: !356, line: 35, type: !50)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 5, scope: !448, file: !356, line: 36, type: !422)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 6, scope: !448, file: !356, line: 36, type: !50)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iflags", scope: !448, file: !356, line: 38, type: !50)
!459 = !DISubprogram(name: "PyParser_ParseStringObject", scope: !356, file: !356, line: 44, type: !460, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (i8*, %struct._object*, %struct.grammar*, i32, %struct.perrdetail*, i32*)* @PyParser_ParseStringObject, variables: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!359, !35, !11, !372, !50, !422, !403}
!462 = !{!463, !464, !465, !466, !467, !468, !469, !508}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !459, file: !356, line: 44, type: !35)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !459, file: !356, line: 44, type: !11)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !459, file: !356, line: 45, type: !372)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !459, file: !356, line: 45, type: !50)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 5, scope: !459, file: !356, line: 46, type: !422)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 6, scope: !459, file: !356, line: 46, type: !403)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !459, file: !356, line: 48, type: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "tok_state", file: !4, line: 22, size: 7936, align: 64, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !471, file: !4, line: 25, baseType: !58, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !471, file: !4, line: 26, baseType: !58, size: 64, align: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "inp", scope: !471, file: !4, line: 27, baseType: !58, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !471, file: !4, line: 28, baseType: !58, size: 64, align: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !471, file: !4, line: 29, baseType: !58, size: 64, align: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !471, file: !4, line: 30, baseType: !50, size: 32, align: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !471, file: !4, line: 32, baseType: !51, size: 64, align: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tabsize", scope: !471, file: !4, line: 33, baseType: !50, size: 32, align: 32, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !471, file: !4, line: 34, baseType: !50, size: 32, align: 32, offset: 480)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "indstack", scope: !471, file: !4, line: 35, baseType: !483, size: 3200, align: 32, offset: 512)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 3200, align: 32, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 100)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "atbol", scope: !471, file: !4, line: 36, baseType: !50, size: 32, align: 32, offset: 3712)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pendin", scope: !471, file: !4, line: 37, baseType: !50, size: 32, align: 32, offset: 3744)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !471, file: !4, line: 38, baseType: !35, size: 64, align: 64, offset: 3776)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nextprompt", scope: !471, file: !4, line: 38, baseType: !35, size: 64, align: 64, offset: 3840)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !471, file: !4, line: 39, baseType: !50, size: 32, align: 32, offset: 3904)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !471, file: !4, line: 40, baseType: !50, size: 32, align: 32, offset: 3936)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !471, file: !4, line: 48, baseType: !11, size: 64, align: 64, offset: 3968)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "altwarning", scope: !471, file: !4, line: 50, baseType: !50, size: 32, align: 32, offset: 4032)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "alterror", scope: !471, file: !4, line: 51, baseType: !50, size: 32, align: 32, offset: 4064)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "alttabsize", scope: !471, file: !4, line: 52, baseType: !50, size: 32, align: 32, offset: 4096)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "altindstack", scope: !471, file: !4, line: 53, baseType: !483, size: 3200, align: 32, offset: 4128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_state", scope: !471, file: !4, line: 55, baseType: !3, size: 32, align: 32, offset: 7328)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_erred", scope: !471, file: !4, line: 56, baseType: !50, size: 32, align: 32, offset: 7360)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "read_coding_spec", scope: !471, file: !4, line: 57, baseType: !50, size: 32, align: 32, offset: 7392)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !471, file: !4, line: 58, baseType: !58, size: 64, align: 64, offset: 7424)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cont_line", scope: !471, file: !4, line: 59, baseType: !50, size: 32, align: 32, offset: 7488)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !471, file: !4, line: 60, baseType: !35, size: 64, align: 64, offset: 7552)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_readline", scope: !471, file: !4, line: 62, baseType: !11, size: 64, align: 64, offset: 7616)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_buffer", scope: !471, file: !4, line: 63, baseType: !11, size: 64, align: 64, offset: 7680)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !471, file: !4, line: 65, baseType: !35, size: 64, align: 64, offset: 7744)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !471, file: !4, line: 66, baseType: !35, size: 64, align: 64, offset: 7808)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !471, file: !4, line: 67, baseType: !35, size: 64, align: 64, offset: 7872)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exec_input", scope: !459, file: !356, line: 49, type: !50)
!509 = !DISubprogram(name: "PyParser_ParseStringFlagsFilenameEx", scope: !356, file: !356, line: 71, type: !510, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (i8*, i8*, %struct.grammar*, i32, %struct.perrdetail*, i32*)* @PyParser_ParseStringFlagsFilenameEx, variables: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!359, !35, !35, !372, !50, !422, !403}
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !523}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !509, file: !356, line: 71, type: !35)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename_str", arg: 2, scope: !509, file: !356, line: 71, type: !35)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !509, file: !356, line: 72, type: !372)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !509, file: !356, line: 72, type: !50)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 5, scope: !509, file: !356, line: 73, type: !422)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 6, scope: !509, file: !356, line: 73, type: !403)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !509, file: !356, line: 75, type: !359)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !509, file: !356, line: 76, type: !11)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !522, file: !356, line: 88, type: !11)
!522 = distinct !DILexicalBlock(scope: !509, file: !356, line: 88, column: 8)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !356, line: 88, type: !11)
!524 = distinct !DILexicalBlock(scope: !525, file: !356, line: 88, column: 100)
!525 = distinct !DILexicalBlock(scope: !522, file: !356, line: 88, column: 66)
!526 = !DISubprogram(name: "PyParser_ParseFile", scope: !356, file: !356, line: 96, type: !527, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct._IO_FILE*, i8*, %struct.grammar*, i32, i8*, i8*, %struct.perrdetail*)* @PyParser_ParseFile, variables: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{!359, !51, !35, !372, !50, !35, !35, !422}
!529 = !{!530, !531, !532, !533, !534, !535, !536}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !526, file: !356, line: 96, type: !51)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !526, file: !356, line: 96, type: !35)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 3, scope: !526, file: !356, line: 96, type: !372)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !526, file: !356, line: 96, type: !50)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps1", arg: 5, scope: !526, file: !356, line: 97, type: !35)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps2", arg: 6, scope: !526, file: !356, line: 97, type: !35)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 7, scope: !526, file: !356, line: 98, type: !422)
!537 = !DISubprogram(name: "PyParser_ParseFileFlags", scope: !356, file: !356, line: 105, type: !538, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct._IO_FILE*, i8*, i8*, %struct.grammar*, i32, i8*, i8*, %struct.perrdetail*, i32)* @PyParser_ParseFileFlags, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!359, !51, !35, !35, !372, !50, !35, !35, !422, !50}
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !537, file: !356, line: 105, type: !51)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !537, file: !356, line: 105, type: !35)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 3, scope: !537, file: !356, line: 105, type: !35)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 4, scope: !537, file: !356, line: 106, type: !372)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !537, file: !356, line: 106, type: !50)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps1", arg: 6, scope: !537, file: !356, line: 107, type: !35)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps2", arg: 7, scope: !537, file: !356, line: 107, type: !35)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 8, scope: !537, file: !356, line: 108, type: !422)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !537, file: !356, line: 108, type: !50)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iflags", scope: !537, file: !356, line: 110, type: !50)
!551 = !DISubprogram(name: "PyParser_ParseFileObject", scope: !356, file: !356, line: 116, type: !552, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct._IO_FILE*, %struct._object*, i8*, %struct.grammar*, i32, i8*, i8*, %struct.perrdetail*, i32*)* @PyParser_ParseFileObject, variables: !554)
!552 = !DISubroutineType(types: !553)
!553 = !{!359, !51, !11, !35, !372, !50, !35, !35, !422, !403}
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !551, file: !356, line: 116, type: !51)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !551, file: !356, line: 116, type: !11)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 3, scope: !551, file: !356, line: 117, type: !35)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 4, scope: !551, file: !356, line: 117, type: !372)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !551, file: !356, line: 117, type: !50)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps1", arg: 6, scope: !551, file: !356, line: 118, type: !35)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps2", arg: 7, scope: !551, file: !356, line: 118, type: !35)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 8, scope: !551, file: !356, line: 119, type: !422)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !551, file: !356, line: 119, type: !403)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !551, file: !356, line: 121, type: !470)
!565 = !DISubprogram(name: "PyParser_ParseFileFlagsEx", scope: !356, file: !356, line: 138, type: !566, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct._IO_FILE*, i8*, i8*, %struct.grammar*, i32, i8*, i8*, %struct.perrdetail*, i32*)* @PyParser_ParseFileFlagsEx, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!359, !51, !35, !35, !372, !50, !35, !35, !422, !403}
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !565, file: !356, line: 138, type: !51)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !565, file: !356, line: 138, type: !35)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 3, scope: !565, file: !356, line: 139, type: !35)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 4, scope: !565, file: !356, line: 139, type: !372)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !565, file: !356, line: 139, type: !50)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps1", arg: 6, scope: !565, file: !356, line: 140, type: !35)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps2", arg: 7, scope: !565, file: !356, line: 140, type: !35)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 8, scope: !565, file: !356, line: 141, type: !422)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !565, file: !356, line: 141, type: !403)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !565, file: !356, line: 143, type: !359)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !565, file: !356, line: 144, type: !11)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !581, file: !356, line: 157, type: !11)
!581 = distinct !DILexicalBlock(scope: !565, file: !356, line: 157, column: 8)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !356, line: 157, type: !11)
!583 = distinct !DILexicalBlock(scope: !584, file: !356, line: 157, column: 99)
!584 = distinct !DILexicalBlock(scope: !581, file: !356, line: 157, column: 65)
!585 = !DISubprogram(name: "parsetok", scope: !356, file: !356, line: 184, type: !586, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: %struct._node* (%struct.tok_state*, %struct.grammar*, i32, %struct.perrdetail*, i32*)* @parsetok, variables: !588)
!586 = !DISubroutineType(types: !587)
!587 = !{!359, !470, !372, !50, !422, !403}
!588 = !{!589, !590, !591, !592, !593, !594, !619, !620, !621, !625, !626, !627, !628, !629, !630, !635, !636, !638, !639, !642, !643, !645, !646, !651, !652, !657}
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !585, file: !356, line: 184, type: !470)
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 2, scope: !585, file: !356, line: 184, type: !372)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !585, file: !356, line: 184, type: !50)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err_ret", arg: 4, scope: !585, file: !356, line: 184, type: !422)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 5, scope: !585, file: !356, line: 185, type: !403)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !585, file: !356, line: 187, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_state", file: !597, line: 31, baseType: !598)
!597 = !DIFile(filename: "Parser/parser.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!598 = !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 24, size: 288256, align: 64, elements: !599)
!599 = !{!600, !616, !617, !618}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "p_stack", scope: !598, file: !597, line: 25, baseType: !601, size: 288064, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack", file: !597, line: 22, baseType: !602)
!602 = !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 18, size: 288064, align: 64, elements: !603)
!603 = !{!604, !612}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "s_top", scope: !602, file: !597, line: 19, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "stackentry", file: !597, line: 16, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 12, size: 192, align: 64, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "s_state", scope: !607, file: !597, line: 13, baseType: !50, size: 32, align: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "s_dfa", scope: !607, file: !597, line: 14, baseType: !379, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "s_parent", scope: !607, file: !597, line: 15, baseType: !371, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "s_base", scope: !602, file: !597, line: 20, baseType: !613, size: 288000, align: 64, offset: 64)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 288000, align: 64, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 1500)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "p_grammar", scope: !598, file: !597, line: 26, baseType: !372, size: 64, align: 64, offset: 288064)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "p_tree", scope: !598, file: !597, line: 27, baseType: !359, size: 64, align: 64, offset: 288128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !598, file: !597, line: 29, baseType: !102, size: 64, align: 64, offset: 288192)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !585, file: !356, line: 188, type: !359)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "started", scope: !585, file: !356, line: 189, type: !50)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !622, file: !356, line: 202, type: !58)
!622 = distinct !DILexicalBlock(scope: !623, file: !356, line: 201, column: 14)
!623 = distinct !DILexicalBlock(scope: !624, file: !356, line: 201, column: 5)
!624 = distinct !DILexicalBlock(scope: !585, file: !356, line: 201, column: 5)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !622, file: !356, line: 202, type: !58)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !622, file: !356, line: 203, type: !50)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !622, file: !356, line: 204, type: !100)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !622, file: !356, line: 205, type: !58)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col_offset", scope: !622, file: !356, line: 206, type: !50)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !631, file: !356, line: 241, type: !100)
!631 = distinct !DILexicalBlock(scope: !632, file: !356, line: 241, column: 44)
!632 = distinct !DILexicalBlock(scope: !633, file: !356, line: 240, column: 17)
!633 = distinct !DILexicalBlock(scope: !634, file: !356, line: 239, column: 25)
!634 = distinct !DILexicalBlock(scope: !622, file: !356, line: 239, column: 13)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !631, file: !356, line: 241, type: !100)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !637, file: !356, line: 241, type: !351)
!637 = distinct !DILexicalBlock(scope: !631, file: !356, line: 241, column: 1527)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !637, file: !356, line: 241, type: !50)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !640, file: !356, line: 247, type: !100)
!640 = distinct !DILexicalBlock(scope: !641, file: !356, line: 247, column: 44)
!641 = distinct !DILexicalBlock(scope: !632, file: !356, line: 246, column: 22)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !640, file: !356, line: 247, type: !100)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !644, file: !356, line: 247, type: !351)
!644 = distinct !DILexicalBlock(scope: !640, file: !356, line: 247, column: 1527)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !644, file: !356, line: 247, type: !50)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !647, file: !356, line: 284, type: !58)
!647 = distinct !DILexicalBlock(scope: !648, file: !356, line: 283, column: 27)
!648 = distinct !DILexicalBlock(scope: !649, file: !356, line: 283, column: 13)
!649 = distinct !DILexicalBlock(scope: !650, file: !356, line: 274, column: 31)
!650 = distinct !DILexicalBlock(scope: !585, file: !356, line: 274, column: 9)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !647, file: !356, line: 285, type: !37)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !653, file: !356, line: 321, type: !100)
!653 = distinct !DILexicalBlock(scope: !654, file: !356, line: 320, column: 37)
!654 = distinct !DILexicalBlock(scope: !655, file: !356, line: 320, column: 13)
!655 = distinct !DILexicalBlock(scope: !656, file: !356, line: 316, column: 26)
!656 = distinct !DILexicalBlock(scope: !585, file: !356, line: 316, column: 9)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !658, file: !356, line: 336, type: !359)
!658 = distinct !DILexicalBlock(scope: !659, file: !356, line: 332, column: 45)
