; ModuleID = 'irs-onlybc/pgen.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }
%struct._node = type { i16, i8*, i32, i32, i32, %struct._node* }
%struct._nfagrammar = type { i32, %struct._nfa**, %struct.labellist }
%struct._nfa = type { i32, i8*, i32, %struct._nfastate*, i32, i32 }
%struct._nfastate = type { i32, %struct._nfaarc* }
%struct._nfaarc = type { i32, i32 }
%struct._ss_state = type { i8*, i32, %struct._ss_arc*, i32, i32, i32 }
%struct._ss_arc = type { i8*, i32, i32 }

@Py_DebugFlag = external global i32, align 4
@.str = private unnamed_addr constant [47 x i8] c"Compiling (meta-) parse tree into NFA grammar\0A\00", align 1
@.str.1 = private unnamed_addr constant [27 x i8] c"no mem for new nfa grammar\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"EMPTY\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"out of mem\00", align 1
@newnfa.type = internal global i32 256, align 4
@.str.4 = private unnamed_addr constant [19 x i8] c"no mem for new nfa\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"Dump of NFA for '%s' ...\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !71, globals: !336)
!1 = !DIFile(filename: "pgen.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !50, !12, !13, !23, !29, !51, !69}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfagrammar", file: !6, line: 99, baseType: !7)
!6 = !DIFile(filename: "Parser/pgen.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfagrammar", file: !6, line: 95, size: 256, align: 64, elements: !8)
!8 = !{!9, !11, !37}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "gr_nnfas", scope: !7, file: !6, line: 96, baseType: !10, size: 32, align: 32)
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "gr_nfa", scope: !7, file: !6, line: 97, baseType: !12, size: 64, align: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfa", file: !6, line: 35, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfa", file: !6, line: 29, size: 320, align: 64, elements: !16)
!16 = !{!17, !18, !21, !22, !35, !36}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nf_type", scope: !15, file: !6, line: 30, baseType: !10, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nf_name", scope: !15, file: !6, line: 31, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nf_nstates", scope: !15, file: !6, line: 32, baseType: !10, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "nf_state", scope: !15, file: !6, line: 33, baseType: !23, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfastate", file: !6, line: 27, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfastate", file: !6, line: 24, size: 128, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "st_narcs", scope: !25, file: !6, line: 25, baseType: !10, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "st_arc", scope: !25, file: !6, line: 26, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfaarc", file: !6, line: 22, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfaarc", file: !6, line: 19, size: 64, align: 32, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ar_label", scope: !31, file: !6, line: 20, baseType: !10, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ar_arrow", scope: !31, file: !6, line: 21, baseType: !10, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nf_start", scope: !15, file: !6, line: 34, baseType: !10, size: 32, align: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nf_finish", scope: !15, file: !6, line: 34, baseType: !10, size: 32, align: 32, offset: 288)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "gr_ll", scope: !7, file: !6, line: 98, baseType: !38, size: 128, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !39, line: 26, baseType: !40)
!39 = !DIFile(filename: "Include/grammar.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 23, size: 128, align: 64, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !40, file: !39, line: 24, baseType: !10, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !40, file: !39, line: 25, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !39, line: 17, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 14, size: 128, align: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !46, file: !39, line: 15, baseType: !10, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !46, file: !39, line: 16, baseType: !19, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ss_state", file: !6, line: 372, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ss_state", file: !6, line: 365, size: 320, align: 64, elements: !54)
!54 = !{!55, !58, !59, !66, !67, !68}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ss_ss", scope: !53, file: !6, line: 366, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !57, line: 12, baseType: !19)
!57 = !DIFile(filename: "Include/bitset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ss_narcs", scope: !53, file: !6, line: 367, baseType: !10, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ss_arc", scope: !53, file: !6, line: 368, baseType: !60, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ss_arc", file: !6, line: 359, size: 128, align: 64, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sa_bitset", scope: !61, file: !6, line: 360, baseType: !56, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sa_arrow", scope: !61, file: !6, line: 361, baseType: !10, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "sa_label", scope: !61, file: !6, line: 362, baseType: !10, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ss_deleted", scope: !53, file: !6, line: 369, baseType: !10, size: 32, align: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ss_finish", scope: !53, file: !6, line: 370, baseType: !10, size: 32, align: 32, offset: 224)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ss_rename", scope: !53, file: !6, line: 371, baseType: !10, size: 32, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ss_arc", file: !6, line: 363, baseType: !61)
!71 = !{!72, !128, !131, !138, !143, !150, !157, !163, !176, !186, !196, !204, !210, !220, !229, !236, !246, !273, !285, !299, !308, !315, !325}
!72 = !DISubprogram(name: "_Py_pgen", scope: !6, file: !6, line: 662, type: !73, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* (%struct._node*)* @_Py_pgen, variables: !124)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !112}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !39, line: 67, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 61, size: 320, align: 64, elements: !78)
!78 = !{!79, !80, !109, !110, !111}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !77, file: !39, line: 62, baseType: !10, size: 32, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !77, file: !39, line: 63, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !39, line: 57, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 50, size: 320, align: 64, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !108}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !83, file: !39, line: 51, baseType: !10, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !83, file: !39, line: 52, baseType: !19, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !83, file: !39, line: 53, baseType: !10, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !83, file: !39, line: 54, baseType: !10, size: 32, align: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !83, file: !39, line: 55, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !39, line: 46, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 37, size: 320, align: 64, elements: !93)
!93 = !{!94, !95, !103, !104, !105, !107}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !92, file: !39, line: 38, baseType: !10, size: 32, align: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !92, file: !39, line: 39, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !39, line: 33, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 30, size: 32, align: 16, elements: !99)
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !98, file: !39, line: 31, baseType: !101, size: 16, align: 16)
!101 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !98, file: !39, line: 32, baseType: !101, size: 16, align: 16, offset: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !92, file: !39, line: 42, baseType: !10, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !92, file: !39, line: 43, baseType: !10, size: 32, align: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !92, file: !39, line: 44, baseType: !106, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !92, file: !39, line: 45, baseType: !10, size: 32, align: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !83, file: !39, line: 56, baseType: !56, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !77, file: !39, line: 64, baseType: !38, size: 128, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !77, file: !39, line: 65, baseType: !10, size: 32, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !77, file: !39, line: 66, baseType: !10, size: 32, align: 32, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !114, line: 17, baseType: !115)
!114 = !DIFile(filename: "Include/node.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !114, line: 10, size: 320, align: 64, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !115, file: !114, line: 11, baseType: !101, size: 16, align: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !115, file: !114, line: 12, baseType: !19, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !115, file: !114, line: 13, baseType: !10, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !115, file: !114, line: 14, baseType: !10, size: 32, align: 32, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !115, file: !114, line: 15, baseType: !10, size: 32, align: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !115, file: !114, line: 16, baseType: !123, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!124 = !{!125, !126, !127}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !72, file: !6, line: 662, type: !112)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gr", scope: !72, file: !6, line: 664, type: !4)
!127 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !72, file: !6, line: 665, type: !75)
!128 = !DISubprogram(name: "Py_pgen", scope: !6, file: !6, line: 676, type: !73, isLocal: false, isDefinition: true, scopeLine: 677, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* (%struct._node*)* @Py_pgen, variables: !129)
!129 = !{!130}
!130 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !128, file: !6, line: 676, type: !112)
!131 = !DISubprogram(name: "metacompile", scope: !6, file: !6, line: 150, type: !132, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: %struct._nfagrammar* (%struct._node*)* @metacompile, variables: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{!4, !112}
!134 = !{!135, !136, !137}
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !131, file: !6, line: 150, type: !112)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gr", scope: !131, file: !6, line: 152, type: !4)
!137 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !131, file: !6, line: 153, type: !10)
!138 = !DISubprogram(name: "newnfagrammar", scope: !6, file: !6, line: 105, type: !139, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: %struct._nfagrammar* ()* @newnfagrammar, variables: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!4}
!141 = !{!142}
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gr", scope: !138, file: !6, line: 107, type: !4)
!143 = !DISubprogram(name: "compile_rule", scope: !6, file: !6, line: 169, type: !144, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._nfagrammar*, %struct._node*)* @compile_rule, variables: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !4, !112}
!146 = !{!147, !148, !149}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gr", arg: 1, scope: !143, file: !6, line: 169, type: !4)
!148 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !143, file: !6, line: 169, type: !112)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nf", scope: !143, file: !6, line: 171, type: !13)
!150 = !DISubprogram(name: "addnfa", scope: !6, file: !6, line: 121, type: !151, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, function: %struct._nfa* (%struct._nfagrammar*, i8*)* @addnfa, variables: !153)
!151 = !DISubroutineType(types: !152)
!152 = !{!13, !4, !19}
!153 = !{!154, !155, !156}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gr", arg: 1, scope: !150, file: !6, line: 121, type: !4)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !150, file: !6, line: 121, type: !19)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nf", scope: !150, file: !6, line: 123, type: !13)
!157 = !DISubprogram(name: "newnfa", scope: !6, file: !6, line: 79, type: !158, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: %struct._nfa* (i8*)* @newnfa, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{!13, !19}
!160 = !{!161, !162}
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !157, file: !6, line: 79, type: !19)
!162 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nf", scope: !157, file: !6, line: 81, type: !13)
