; ModuleID = 'programs_new/Python-new/posixmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!211 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!212 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!213 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!214 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 57, size: 32, align: 32, elements: !223)
!222 = !DIFile(filename: "Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!223 = !{!224, !225}
!224 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!225 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 100, size: 32, align: 32, elements: !228)
!227 = !DIFile(filename: "/usr/include/sys/wait.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!228 = !{!229, !230, !231}
!229 = !DIEnumerator(name: "P_ALL", value: 0)
!230 = !DIEnumerator(name: "P_PID", value: 1)
!231 = !DIEnumerator(name: "P_PGID", value: 2)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__priority_which", file: !233, line: 292, size: 32, align: 32, elements: !234)
!233 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!234 = !{!235, !236, !237}
!235 = !DIEnumerator(name: "PRIO_PROCESS", value: 0)
!236 = !DIEnumerator(name: "PRIO_PGRP", value: 1)
!237 = !DIEnumerator(name: "PRIO_USER", value: 2)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 80, size: 32, align: 32, elements: !240)
!239 = !DIFile(filename: "/usr/include/bits/statvfs.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!241 = !DIEnumerator(name: "ST_RDONLY", value: 1)
!242 = !DIEnumerator(name: "ST_NOSUID", value: 2)
!243 = !DIEnumerator(name: "ST_NODEV", value: 4)
!244 = !DIEnumerator(name: "ST_NOEXEC", value: 8)
!245 = !DIEnumerator(name: "ST_SYNCHRONOUS", value: 16)
!246 = !DIEnumerator(name: "ST_MANDLOCK", value: 64)
!247 = !DIEnumerator(name: "ST_WRITE", value: 128)
!248 = !DIEnumerator(name: "ST_APPEND", value: 256)
!249 = !DIEnumerator(name: "ST_IMMUTABLE", value: 512)
!250 = !DIEnumerator(name: "ST_NOATIME", value: 1024)
!251 = !DIEnumerator(name: "ST_NODIRATIME", value: 2048)
!252 = !DIEnumerator(name: "ST_RELATIME", value: 4096)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !254, line: 246, size: 32, align: 32, elements: !255)
!254 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIEnumerator(name: "CLD_EXITED", value: 1)
!257 = !DIEnumerator(name: "CLD_KILLED", value: 2)
!258 = !DIEnumerator(name: "CLD_DUMPED", value: 3)
!259 = !DIEnumerator(name: "CLD_TRAPPED", value: 4)
!260 = !DIEnumerator(name: "CLD_STOPPED", value: 5)
!261 = !DIEnumerator(name: "CLD_CONTINUED", value: 6)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !263, line: 29, size: 32, align: 32, elements: !264)
!263 = !DIFile(filename: "/usr/include/sys/xattr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!264 = !{!265, !266}
!265 = !DIEnumerator(name: "XATTR_CREATE", value: 1)
!266 = !DIEnumerator(name: "XATTR_REPLACE", value: 2)
!267 = !{!268, !273, !275, !276, !287, !366, !612, !613, !314, !614, !631, !632, !640, !648, !649, !652, !364, !282, !653, !322, !654, !656, !657, !659, !668, !670, !672, !505, !272, !678, !349, !679, !685, !688}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !269, line: 80, baseType: !270)
!269 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !271, line: 134, baseType: !272)
!271 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!272 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !269, line: 65, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !271, line: 135, baseType: !272)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !278, line: 109, baseType: !279)
!278 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !278, line: 105, size: 128, align: 64, elements: !280)
!280 = !{!281, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !279, file: !278, line: 107, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !283, line: 177, baseType: !284)
!283 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !285, line: 102, baseType: !286)
!285 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !271, line: 181, baseType: !287)
!287 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !279, file: !278, line: 108, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !278, line: 334, size: 3200, align: 64, elements: !291)
!291 = !{!292, !298, !302, !303, !304, !309, !372, !377, !382, !383, !388, !440, !471, !483, !489, !490, !491, !493, !495, !526, !527, !528, !537, !538, !543, !544, !546, !548, !558, !561, !579, !580, !581, !583, !585, !586, !588, !593, !598, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !290, file: !278, line: 335, baseType: !293, size: 192, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !278, line: 114, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 111, size: 192, align: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !294, file: !278, line: 112, baseType: !277, size: 128, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !294, file: !278, line: 113, baseType: !282, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !290, file: !278, line: 336, baseType: !299, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !290, file: !278, line: 337, baseType: !282, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !290, file: !278, line: 337, baseType: !282, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !290, file: !278, line: 341, baseType: !305, size: 64, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !278, line: 308, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !276}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !290, file: !278, line: 342, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !278, line: 314, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!314, !276, !315, !314}
!314 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !285, line: 48, baseType: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !318, line: 246, size: 1728, align: 64, elements: !319)
!318 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!319 = !{!320, !321, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !341, !342, !343, !344, !346, !348, !350, !354, !357, !359, !360, !361, !362, !363, !367, !368}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !317, file: !318, line: 247, baseType: !314, size: 32, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !317, file: !318, line: 252, baseType: !322, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !317, file: !318, line: 253, baseType: !322, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !317, file: !318, line: 254, baseType: !322, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !317, file: !318, line: 255, baseType: !322, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !317, file: !318, line: 256, baseType: !322, size: 64, align: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !317, file: !318, line: 257, baseType: !322, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !317, file: !318, line: 258, baseType: !322, size: 64, align: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !317, file: !318, line: 259, baseType: !322, size: 64, align: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !317, file: !318, line: 261, baseType: !322, size: 64, align: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !317, file: !318, line: 262, baseType: !322, size: 64, align: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !317, file: !318, line: 263, baseType: !322, size: 64, align: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !317, file: !318, line: 265, baseType: !334, size: 64, align: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !318, line: 161, size: 192, align: 64, elements: !336)
!336 = !{!337, !338, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !335, file: !318, line: 162, baseType: !334, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !335, file: !318, line: 163, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !335, file: !318, line: 167, baseType: !314, size: 32, align: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !317, file: !318, line: 267, baseType: !339, size: 64, align: 64, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !317, file: !318, line: 269, baseType: !314, size: 32, align: 32, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !317, file: !318, line: 273, baseType: !314, size: 32, align: 32, offset: 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !317, file: !318, line: 275, baseType: !345, size: 64, align: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !271, line: 140, baseType: !287)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !317, file: !318, line: 279, baseType: !347, size: 16, align: 16, offset: 1024)
!347 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !317, file: !318, line: 280, baseType: !349, size: 8, align: 8, offset: 1040)
!349 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !317, file: !318, line: 281, baseType: !351, size: 8, align: 8, offset: 1048)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 8, align: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 1)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !317, file: !318, line: 285, baseType: !355, size: 64, align: 64, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !318, line: 155, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !317, file: !318, line: 294, baseType: !358, size: 64, align: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !271, line: 141, baseType: !287)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !317, file: !318, line: 303, baseType: !275, size: 64, align: 64, offset: 1216)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !317, file: !318, line: 304, baseType: !275, size: 64, align: 64, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !317, file: !318, line: 305, baseType: !275, size: 64, align: 64, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !317, file: !318, line: 306, baseType: !275, size: 64, align: 64, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !317, file: !318, line: 307, baseType: !364, size: 64, align: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !365, line: 62, baseType: !366)
!365 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!366 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !317, file: !318, line: 309, baseType: !314, size: 32, align: 32, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !317, file: !318, line: 311, baseType: !369, size: 160, align: 8, offset: 1568)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 160, align: 8, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 20)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !290, file: !278, line: 343, baseType: !373, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !278, line: 316, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!276, !276, !322}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !290, file: !278, line: 344, baseType: !378, size: 64, align: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !278, line: 318, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!314, !276, !322, !276}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !290, file: !278, line: 345, baseType: !275, size: 64, align: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !290, file: !278, line: 346, baseType: !384, size: 64, align: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !278, line: 320, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!276, !276}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !290, file: !278, line: 350, baseType: !389, size: 64, align: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !278, line: 278, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 236, size: 2176, align: 64, elements: !392)
!392 = !{!393, !398, !399, !400, !401, !402, !407, !409, !410, !411, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !391, file: !278, line: 241, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !278, line: 166, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!276, !276, !276}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !391, file: !278, line: 242, baseType: !394, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !391, file: !278, line: 243, baseType: !394, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !391, file: !278, line: 244, baseType: !394, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !391, file: !278, line: 245, baseType: !394, size: 64, align: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !391, file: !278, line: 246, baseType: !403, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !278, line: 167, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!276, !276, !276, !276}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !391, file: !278, line: 247, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !278, line: 165, baseType: !385)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !391, file: !278, line: 248, baseType: !408, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !391, file: !278, line: 249, baseType: !408, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !391, file: !278, line: 250, baseType: !412, size: 64, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !278, line: 168, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!314, !276}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !391, file: !278, line: 251, baseType: !408, size: 64, align: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !391, file: !278, line: 252, baseType: !394, size: 64, align: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !391, file: !278, line: 253, baseType: !394, size: 64, align: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !391, file: !278, line: 254, baseType: !394, size: 64, align: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !391, file: !278, line: 255, baseType: !394, size: 64, align: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !391, file: !278, line: 256, baseType: !394, size: 64, align: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !391, file: !278, line: 257, baseType: !408, size: 64, align: 64, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !391, file: !278, line: 258, baseType: !275, size: 64, align: 64, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !391, file: !278, line: 259, baseType: !408, size: 64, align: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !391, file: !278, line: 261, baseType: !394, size: 64, align: 64, offset: 1216)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !391, file: !278, line: 262, baseType: !394, size: 64, align: 64, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !391, file: !278, line: 263, baseType: !394, size: 64, align: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !391, file: !278, line: 264, baseType: !394, size: 64, align: 64, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !391, file: !278, line: 265, baseType: !403, size: 64, align: 64, offset: 1472)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !391, file: !278, line: 266, baseType: !394, size: 64, align: 64, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !391, file: !278, line: 267, baseType: !394, size: 64, align: 64, offset: 1600)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !391, file: !278, line: 268, baseType: !394, size: 64, align: 64, offset: 1664)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !391, file: !278, line: 269, baseType: !394, size: 64, align: 64, offset: 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !391, file: !278, line: 270, baseType: !394, size: 64, align: 64, offset: 1792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !391, file: !278, line: 272, baseType: !394, size: 64, align: 64, offset: 1856)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !391, file: !278, line: 273, baseType: !394, size: 64, align: 64, offset: 1920)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !391, file: !278, line: 274, baseType: !394, size: 64, align: 64, offset: 1984)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !391, file: !278, line: 275, baseType: !394, size: 64, align: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !391, file: !278, line: 277, baseType: !408, size: 64, align: 64, offset: 2112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !290, file: !278, line: 351, baseType: !441, size: 64, align: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !278, line: 292, baseType: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 280, size: 640, align: 64, elements: !444)
!444 = !{!445, !450, !451, !456, !457, !458, !463, !464, !469, !470}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !443, file: !278, line: 281, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !278, line: 169, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!282, !276}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !443, file: !278, line: 282, baseType: !394, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !443, file: !278, line: 283, baseType: !452, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !278, line: 170, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!276, !276, !282}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !443, file: !278, line: 284, baseType: !452, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !443, file: !278, line: 285, baseType: !275, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !443, file: !278, line: 286, baseType: !459, size: 64, align: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !278, line: 172, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!314, !276, !282, !276}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !443, file: !278, line: 287, baseType: !275, size: 64, align: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !443, file: !278, line: 288, baseType: !465, size: 64, align: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !278, line: 231, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!314, !276, !276}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !443, file: !278, line: 290, baseType: !394, size: 64, align: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !443, file: !278, line: 291, baseType: !452, size: 64, align: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !290, file: !278, line: 352, baseType: !472, size: 64, align: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !278, line: 298, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 294, size: 192, align: 64, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !474, file: !278, line: 295, baseType: !446, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !474, file: !278, line: 296, baseType: !394, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !474, file: !278, line: 297, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !278, line: 174, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!314, !276, !276, !276}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !290, file: !278, line: 356, baseType: !484, size: 64, align: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !278, line: 321, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !276}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !283, line: 186, baseType: !282)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !290, file: !278, line: 357, baseType: !403, size: 64, align: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !290, file: !278, line: 358, baseType: !384, size: 64, align: 64, offset: 1088)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !290, file: !278, line: 359, baseType: !492, size: 64, align: 64, offset: 1152)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !278, line: 317, baseType: !395)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !290, file: !278, line: 360, baseType: !494, size: 64, align: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !278, line: 319, baseType: !480)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !290, file: !278, line: 363, baseType: !496, size: 64, align: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !278, line: 304, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 301, size: 128, align: 64, elements: !499)
!499 = !{!500, !521}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !498, file: !278, line: 302, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !278, line: 193, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!314, !276, !505, !314}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !278, line: 191, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !278, line: 178, size: 640, align: 64, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !518, !519, !520}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !507, file: !278, line: 179, baseType: !275, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !507, file: !278, line: 180, baseType: !276, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !507, file: !278, line: 181, baseType: !282, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !507, file: !278, line: 182, baseType: !282, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !507, file: !278, line: 184, baseType: !314, size: 32, align: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !507, file: !278, line: 185, baseType: !314, size: 32, align: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !507, file: !278, line: 186, baseType: !322, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !507, file: !278, line: 187, baseType: !517, size: 64, align: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !507, file: !278, line: 188, baseType: !517, size: 64, align: 64, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !507, file: !278, line: 189, baseType: !517, size: 64, align: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !507, file: !278, line: 190, baseType: !275, size: 64, align: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !498, file: !278, line: 303, baseType: !522, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !278, line: 194, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !276, !505}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !290, file: !278, line: 366, baseType: !366, size: 64, align: 64, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !290, file: !278, line: 368, baseType: !299, size: 64, align: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !290, file: !278, line: 372, baseType: !529, size: 64, align: 64, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !278, line: 233, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!314, !276, !533, !275}
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !278, line: 232, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!314, !276, !275}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !290, file: !278, line: 375, baseType: !412, size: 64, align: 64, offset: 1536)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !290, file: !278, line: 379, baseType: !539, size: 64, align: 64, offset: 1600)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !278, line: 322, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!276, !276, !276, !314}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !290, file: !278, line: 382, baseType: !282, size: 64, align: 64, offset: 1664)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !290, file: !278, line: 385, baseType: !545, size: 64, align: 64, offset: 1728)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !278, line: 323, baseType: !385)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !290, file: !278, line: 386, baseType: !547, size: 64, align: 64, offset: 1792)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !278, line: 324, baseType: !385)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !290, file: !278, line: 389, baseType: !549, size: 64, align: 64, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !551, line: 40, size: 256, align: 64, elements: !552)
!551 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!552 = !{!553, !554, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !550, file: !551, line: 41, baseType: !299, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !550, file: !551, line: 42, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !551, line: 18, baseType: !395)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !550, file: !551, line: 43, baseType: !314, size: 32, align: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !550, file: !551, line: 45, baseType: !299, size: 64, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !290, file: !278, line: 390, baseType: !559, size: 64, align: 64, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !278, line: 390, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !290, file: !278, line: 391, baseType: !562, size: 64, align: 64, offset: 1984)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !564, line: 11, size: 320, align: 64, elements: !565)
!564 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!565 = !{!566, !567, !572, !577, !578}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !564, line: 12, baseType: !322, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !563, file: !564, line: 13, baseType: !568, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !564, line: 8, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!276, !276, !275}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !563, file: !564, line: 14, baseType: !573, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !564, line: 9, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!314, !276, !276, !275}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !563, file: !564, line: 15, baseType: !322, size: 64, align: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !563, file: !564, line: 16, baseType: !275, size: 64, align: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !290, file: !278, line: 392, baseType: !289, size: 64, align: 64, offset: 2048)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !290, file: !278, line: 393, baseType: !276, size: 64, align: 64, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !290, file: !278, line: 394, baseType: !582, size: 64, align: 64, offset: 2176)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !278, line: 325, baseType: !404)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !290, file: !278, line: 395, baseType: !584, size: 64, align: 64, offset: 2240)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !278, line: 326, baseType: !480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !290, file: !278, line: 396, baseType: !282, size: 64, align: 64, offset: 2304)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !290, file: !278, line: 397, baseType: !587, size: 64, align: 64, offset: 2368)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !278, line: 327, baseType: !480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !290, file: !278, line: 398, baseType: !589, size: 64, align: 64, offset: 2432)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !278, line: 329, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!276, !289, !282}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !290, file: !278, line: 399, baseType: !594, size: 64, align: 64, offset: 2496)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !278, line: 328, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!276, !289, !276, !276}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !290, file: !278, line: 400, baseType: !599, size: 64, align: 64, offset: 2560)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !278, line: 307, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !275}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !290, file: !278, line: 401, baseType: !412, size: 64, align: 64, offset: 2624)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !290, file: !278, line: 402, baseType: !276, size: 64, align: 64, offset: 2688)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !290, file: !278, line: 403, baseType: !276, size: 64, align: 64, offset: 2752)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !290, file: !278, line: 404, baseType: !276, size: 64, align: 64, offset: 2816)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !290, file: !278, line: 405, baseType: !276, size: 64, align: 64, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !290, file: !278, line: 406, baseType: !276, size: 64, align: 64, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !290, file: !278, line: 407, baseType: !305, size: 64, align: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !290, file: !278, line: 410, baseType: !272, size: 32, align: 32, offset: 3072)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !290, file: !278, line: 412, baseType: !305, size: 64, align: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "path_t", file: !616, line: 775, baseType: !617)
!616 = !DIFile(filename: "./Modules/posixmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!617 = !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 764, size: 576, align: 64, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !626, !627, !628, !629, !630}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "function_name", scope: !617, file: !616, line: 765, baseType: !299, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "argument_name", scope: !617, file: !616, line: 766, baseType: !299, size: 64, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nullable", scope: !617, file: !616, line: 767, baseType: !314, size: 32, align: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "allow_fd", scope: !617, file: !616, line: 768, baseType: !314, size: 32, align: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "wide", scope: !617, file: !616, line: 769, baseType: !624, size: 64, align: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !365, line: 90, baseType: !314)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "narrow", scope: !617, file: !616, line: 770, baseType: !322, size: 64, align: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !617, file: !616, line: 771, baseType: !314, size: 32, align: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !617, file: !616, line: 772, baseType: !282, size: 64, align: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !617, file: !616, line: 773, baseType: !276, size: 64, align: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !617, file: !616, line: 774, baseType: !276, size: 64, align: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !634, line: 41, baseType: !635)
!634 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!635 = !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 31, size: 320, align: 64, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !635, file: !634, line: 32, baseType: !293, size: 192, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !635, file: !634, line: 33, baseType: !488, size: 64, align: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !635, file: !634, line: 34, baseType: !351, size: 8, align: 8, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !642, line: 33, baseType: !643)
!642 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!643 = !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 25, size: 256, align: 64, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !643, file: !642, line: 26, baseType: !293, size: 192, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !643, file: !642, line: 27, baseType: !647, size: 64, align: 64, offset: 192)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, align: 64, elements: !352)
!648 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !650, line: 59, baseType: !651)
!650 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !271, line: 144, baseType: !287)
!652 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cpu_mask", file: !655, line: 119, baseType: !366)
!655 = !DIFile(filename: "/usr/include/bits/sched.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !661, line: 40, baseType: !662)
!661 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!662 = !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 23, size: 320, align: 64, elements: !663)
!663 = !{!664, !665, !667}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !662, file: !661, line: 24, baseType: !293, size: 192, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !662, file: !661, line: 26, baseType: !666, size: 64, align: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !662, file: !661, line: 39, baseType: !282, size: 64, align: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !278, line: 422, baseType: !290)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !285, line: 92, baseType: !358)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !674, line: 43, size: 128, align: 64, elements: !675)
!674 = !DIFile(filename: "/usr/include/bits/uio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !673, file: !674, line: 45, baseType: !275, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !673, file: !674, line: 46, baseType: !364, size: 64, align: 64, offset: 64)
!678 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "constdef", file: !616, line: 9331, size: 128, align: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !616, line: 9332, baseType: !322, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !681, file: !616, line: 9333, baseType: !287, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence", file: !687, line: 35, baseType: !641)
!687 = !DIFile(filename: "Include/structseq.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!689 = !{!690, !695, !700, !713, !726, !746, !781, !806, !818, !826, !929, !936, !943, !948, !975, !981, !989, !993, !998, !1012, !1051, !1064, !1075, !1092, !1101, !1108, !1110, !1120, !1134, !1143, !1157, !1167, !1177, !1181, !1196, !1205, !1208, !1220, !1223, !1237, !1243, !1251, !1328, !1337, !1349, !1355, !1362, !1370, !1385, !1390, !1409, !1414, !1425, !1430, !1443, !1454, !1459, !1510, !1521, !1554, !1570, !1583, !1594, !1602, !1608, !1621, !1661, !1666, !1689, !1707, !1717, !1724, !1736, !1785, !1793, !1799, !1805, !1820, !1826, !1832, !1838, !1846, !1853, !1857, !1902, !1932, !1938, !1945, !1949, !1953, !1957, !1975, !1997, !2001, !2005, !2009, !2013, !2020, !2026, !2032, !2037, !2042, !2047, !2053, !2059, !2064, !2086, !2096, !2102, !2106, !2114, !2204, !2222, !2232, !2310, !2319, !2325, !2329, !2335, !2341, !2347, !2361, !2369, !2378, !2383, !2388, !2406, !2416, !2420, !2431, !2445, !2457, !2482, !2490, !2505, !2515, !2527, !2537, !2554, !2563, !2568, !2581, !2588, !2600, !2613, !2621, !2628, !2633, !2639, !2644, !2647, !2653, !2659, !2668, !2679, !2689, !2700, !2727, !2739, !2745, !2749, !2762, !2766, !2772, !2776, !2781, !2786, !2791, !2796, !2801, !2806, !2811, !2816, !2842, !2852, !2863, !2877, !2883, !2903, !2912, !2916, !2926, !2930, !2941, !2945, !2951, !2962, !2969, !2976, !2983, !2990, !3004, !3026, !3038, !3076, !3097, !3101, !3107, !3113, !3131, !3134, !3137, !3162, !3175, !3191, !3198, !3204, !3210, !3214, !3219, !3223}
!690 = !DISubprogram(name: "_PyLong_FromUid", scope: !616, file: !616, line: 396, type: !691, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @_PyLong_FromUid, variables: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{!276, !268}
!693 = !{!694}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uid", arg: 1, scope: !690, file: !616, line: 396, type: !268)
!695 = !DISubprogram(name: "_PyLong_FromGid", scope: !616, file: !616, line: 404, type: !696, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @_PyLong_FromGid, variables: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!276, !273}
!698 = !{!699}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gid", arg: 1, scope: !695, file: !616, line: 404, type: !273)
!700 = !DISubprogram(name: "_Py_Uid_Converter", scope: !616, file: !616, line: 412, type: !535, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_Py_Uid_Converter, variables: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !711}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !700, file: !616, line: 412, type: !276)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !700, file: !616, line: 412, type: !275)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uid", scope: !700, file: !616, line: 414, type: !268)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !700, file: !616, line: 415, type: !276)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !700, file: !616, line: 416, type: !314)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !700, file: !616, line: 417, type: !287)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uresult", scope: !700, file: !616, line: 418, type: !366)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !710, file: !616, line: 498, type: !276)
!710 = distinct !DILexicalBlock(scope: !700, file: !616, line: 498, column: 8)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !616, line: 513, type: !276)
!712 = distinct !DILexicalBlock(scope: !700, file: !616, line: 513, column: 8)
!713 = !DISubprogram(name: "_Py_Gid_Converter", scope: !616, file: !616, line: 518, type: !535, isLocal: false, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_Py_Gid_Converter, variables: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !724}
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !713, file: !616, line: 518, type: !276)
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !713, file: !616, line: 518, type: !275)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gid", scope: !713, file: !616, line: 520, type: !273)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !713, file: !616, line: 521, type: !276)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !713, file: !616, line: 522, type: !314)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !713, file: !616, line: 523, type: !287)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uresult", scope: !713, file: !616, line: 524, type: !366)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !723, file: !616, line: 605, type: !276)
!723 = distinct !DILexicalBlock(scope: !713, file: !616, line: 605, column: 8)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !616, line: 620, type: !276)
!725 = distinct !DILexicalBlock(scope: !713, file: !616, line: 620, column: 8)
!726 = !DISubprogram(name: "PyInit_posix", scope: !616, file: !616, line: 12208, type: !727, isLocal: false, isDefinition: true, scopeLine: 12209, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_posix, variables: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{!276}
!729 = !{!730, !731, !732, !733, !734, !736, !738, !740, !744}
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !726, file: !616, line: 12210, type: !276)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !726, file: !616, line: 12210, type: !276)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !726, file: !616, line: 12211, type: !276)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !726, file: !616, line: 12212, type: !653)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !735, file: !616, line: 12224, type: !276)
!735 = distinct !DILexicalBlock(scope: !726, file: !616, line: 12224, column: 8)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !737, file: !616, line: 12227, type: !276)
!737 = distinct !DILexicalBlock(scope: !726, file: !616, line: 12227, column: 8)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ignored", scope: !739, file: !616, line: 12357, type: !314)
!739 = distinct !DILexicalBlock(scope: !726, file: !616, line: 12356, column: 5)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !741, file: !616, line: 12373, type: !276)
!741 = distinct !DILexicalBlock(scope: !742, file: !616, line: 12372, column: 51)
!742 = distinct !DILexicalBlock(scope: !743, file: !616, line: 12372, column: 5)
!743 = distinct !DILexicalBlock(scope: !726, file: !616, line: 12372, column: 5)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !616, line: 12378, type: !276)
!745 = distinct !DILexicalBlock(scope: !741, file: !616, line: 12378, column: 12)
!746 = !DISubprogram(name: "os_stat", scope: !616, file: !616, line: 2480, type: !747, isLocal: true, isDefinition: true, scopeLine: 2481, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*, %struct._object*)* @os_stat, variables: !773)
!747 = !DISubroutineType(types: !748)
!748 = !{!276, !749, !276, !276}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !751, line: 57, baseType: !752)
!751 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !751, line: 47, size: 832, align: 64, elements: !753)
!753 = !{!754, !763, !764, !765, !766, !769, !770, !771, !772}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !752, file: !751, line: 48, baseType: !755, size: 320, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !751, line: 38, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !751, line: 33, size: 320, align: 64, elements: !757)
!757 = !{!758, !759, !761, !762}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !756, file: !751, line: 34, baseType: !277, size: 128, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !756, file: !751, line: 35, baseType: !760, size: 64, align: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !756, file: !751, line: 36, baseType: !282, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !756, file: !751, line: 37, baseType: !276, size: 64, align: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !752, file: !751, line: 49, baseType: !299, size: 64, align: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !752, file: !751, line: 50, baseType: !299, size: 64, align: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !752, file: !751, line: 51, baseType: !282, size: 64, align: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !752, file: !751, line: 52, baseType: !767, size: 64, align: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !551, line: 47, baseType: !550)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !752, file: !751, line: 53, baseType: !412, size: 64, align: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !752, file: !751, line: 54, baseType: !529, size: 64, align: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !752, file: !751, line: 55, baseType: !412, size: 64, align: 64, offset: 704)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !752, file: !751, line: 56, baseType: !599, size: 64, align: 64, offset: 768)
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !746, file: !616, line: 2480, type: !749)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !746, file: !616, line: 2480, type: !276)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !746, file: !616, line: 2480, type: !276)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !746, file: !616, line: 2482, type: !276)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !746, file: !616, line: 2484, type: !615)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir_fd", scope: !746, file: !616, line: 2485, type: !314)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "follow_symlinks", scope: !746, file: !616, line: 2486, type: !314)
!781 = !DISubprogram(name: "path_converter", scope: !616, file: !616, line: 788, type: !535, isLocal: true, isDefinition: true, scopeLine: 788, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @path_converter, variables: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !793, !795, !801, !802}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !781, file: !616, line: 788, type: !276)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !781, file: !616, line: 788, type: !275)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !781, file: !616, line: 789, type: !614)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !781, file: !616, line: 790, type: !276)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !781, file: !616, line: 790, type: !276)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !781, file: !616, line: 791, type: !282)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "narrow", scope: !781, file: !616, line: 792, type: !322)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !791, file: !616, line: 847, type: !314)
!791 = distinct !DILexicalBlock(scope: !792, file: !616, line: 824, column: 18)
!792 = distinct !DILexicalBlock(scope: !781, file: !616, line: 824, column: 9)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !616, line: 848, type: !276)
!794 = distinct !DILexicalBlock(scope: !791, file: !616, line: 848, column: 12)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !796, file: !616, line: 862, type: !314)
!796 = distinct !DILexicalBlock(scope: !797, file: !616, line: 861, column: 33)
!797 = distinct !DILexicalBlock(scope: !798, file: !616, line: 861, column: 17)
!798 = distinct !DILexicalBlock(scope: !799, file: !616, line: 859, column: 21)
!799 = distinct !DILexicalBlock(scope: !800, file: !616, line: 859, column: 13)
!800 = distinct !DILexicalBlock(scope: !792, file: !616, line: 853, column: 10)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !796, file: !616, line: 863, type: !314)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !616, line: 902, type: !276)
!803 = distinct !DILexicalBlock(scope: !804, file: !616, line: 902, column: 12)
!804 = distinct !DILexicalBlock(scope: !805, file: !616, line: 900, column: 35)
!805 = distinct !DILexicalBlock(scope: !781, file: !616, line: 900, column: 9)
!806 = !DISubprogram(name: "_fd_converter", scope: !616, file: !616, line: 640, type: !807, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32*, i8*)* @_fd_converter, variables: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!314, !276, !688, !299}
!809 = !{!810, !811, !812, !813, !814, !815, !816}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !806, file: !616, line: 640, type: !276)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !806, file: !616, line: 640, type: !688)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allowed", arg: 3, scope: !806, file: !616, line: 640, type: !299)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !806, file: !616, line: 642, type: !314)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "long_value", scope: !806, file: !616, line: 643, type: !287)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !806, file: !616, line: 645, type: !276)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !616, line: 654, type: !276)
!817 = distinct !DILexicalBlock(scope: !806, file: !616, line: 654, column: 8)
!818 = !DISubprogram(name: "os_stat_impl", scope: !616, file: !616, line: 2502, type: !819, isLocal: true, isDefinition: true, scopeLine: 2504, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct.path_t*, i32, i32)* @os_stat_impl, variables: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{!276, !749, !614, !314, !314}
!821 = !{!822, !823, !824, !825}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !818, file: !616, line: 2502, type: !749)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !818, file: !616, line: 2502, type: !614)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 3, scope: !818, file: !616, line: 2502, type: !314)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 4, scope: !818, file: !616, line: 2502, type: !314)
!826 = !DISubprogram(name: "posix_do_stat", scope: !616, file: !616, line: 2313, type: !827, isLocal: true, isDefinition: true, scopeLine: 2315, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct.path_t*, i32, i32)* @posix_do_stat, variables: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!276, !322, !614, !314, !314}
!829 = !{!830, !831, !832, !833, !834, !868, !869}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !826, file: !616, line: 2313, type: !322)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !826, file: !616, line: 2313, type: !614)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 3, scope: !826, file: !616, line: 2314, type: !314)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 4, scope: !826, file: !616, line: 2314, type: !314)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !826, file: !616, line: 2316, type: !835)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !836, line: 46, size: 1152, align: 64, elements: !837)
!836 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!837 = !{!838, !840, !842, !844, !846, !847, !848, !849, !850, !851, !853, !855, !862, !863, !864}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !835, file: !836, line: 48, baseType: !839, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !271, line: 133, baseType: !366)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !835, file: !836, line: 53, baseType: !841, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !271, line: 136, baseType: !366)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !835, file: !836, line: 61, baseType: !843, size: 64, align: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !271, line: 139, baseType: !366)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !835, file: !836, line: 62, baseType: !845, size: 32, align: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !271, line: 138, baseType: !272)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !835, file: !836, line: 64, baseType: !270, size: 32, align: 32, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !835, file: !836, line: 65, baseType: !274, size: 32, align: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !835, file: !836, line: 67, baseType: !314, size: 32, align: 32, offset: 288)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !835, file: !836, line: 69, baseType: !839, size: 64, align: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !835, file: !836, line: 74, baseType: !345, size: 64, align: 64, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !835, file: !836, line: 78, baseType: !852, size: 64, align: 64, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !271, line: 162, baseType: !287)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !835, file: !836, line: 80, baseType: !854, size: 64, align: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !271, line: 167, baseType: !287)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !835, file: !836, line: 91, baseType: !856, size: 128, align: 64, offset: 576)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !650, line: 120, size: 128, align: 64, elements: !857)
!857 = !{!858, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !856, file: !650, line: 122, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !271, line: 148, baseType: !287)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !856, file: !650, line: 123, baseType: !861, size: 64, align: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !271, line: 184, baseType: !287)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !835, file: !836, line: 92, baseType: !856, size: 128, align: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !835, file: !836, line: 93, baseType: !856, size: 128, align: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !835, file: !836, line: 106, baseType: !865, size: 192, align: 64, offset: 960)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 192, align: 64, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 3)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !826, file: !616, line: 2317, type: !314)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !870, file: !616, line: 2329, type: !871)
!870 = distinct !DILexicalBlock(scope: !826, file: !616, line: 2329, column: 5)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !873, line: 139, baseType: !874)
!873 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !873, line: 69, size: 1536, align: 64, elements: !875)
!875 = !{!876, !878, !879, !899, !902, !903, !904, !905, !906, !907, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !874, file: !873, line: 72, baseType: !877, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !874, file: !873, line: 73, baseType: !877, size: 64, align: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !874, file: !873, line: 74, baseType: !880, size: 64, align: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !873, line: 44, baseType: !882)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !873, line: 19, size: 832, align: 64, elements: !883)
!883 = !{!884, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !873, line: 21, baseType: !885, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !882, file: !873, line: 22, baseType: !877, size: 64, align: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !882, file: !873, line: 24, baseType: !276, size: 64, align: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !882, file: !873, line: 25, baseType: !276, size: 64, align: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !882, file: !873, line: 26, baseType: !276, size: 64, align: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !882, file: !873, line: 27, baseType: !276, size: 64, align: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !882, file: !873, line: 28, baseType: !276, size: 64, align: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !882, file: !873, line: 30, baseType: !276, size: 64, align: 64, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !882, file: !873, line: 31, baseType: !276, size: 64, align: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !882, file: !873, line: 32, baseType: !276, size: 64, align: 64, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !882, file: !873, line: 33, baseType: !314, size: 32, align: 32, offset: 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !882, file: !873, line: 34, baseType: !314, size: 32, align: 32, offset: 672)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !882, file: !873, line: 37, baseType: !314, size: 32, align: 32, offset: 704)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !882, file: !873, line: 43, baseType: !276, size: 64, align: 64, offset: 768)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !874, file: !873, line: 76, baseType: !900, size: 64, align: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !873, line: 50, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !874, file: !873, line: 77, baseType: !314, size: 32, align: 32, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !874, file: !873, line: 78, baseType: !301, size: 8, align: 8, offset: 288)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !874, file: !873, line: 80, baseType: !301, size: 8, align: 8, offset: 296)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !874, file: !873, line: 85, baseType: !314, size: 32, align: 32, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !874, file: !873, line: 86, baseType: !314, size: 32, align: 32, offset: 352)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !874, file: !873, line: 88, baseType: !908, size: 64, align: 64, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !873, line: 54, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!314, !276, !900, !314, !276}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !874, file: !873, line: 89, baseType: !908, size: 64, align: 64, offset: 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !874, file: !873, line: 90, baseType: !276, size: 64, align: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !874, file: !873, line: 91, baseType: !276, size: 64, align: 64, offset: 576)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !874, file: !873, line: 93, baseType: !276, size: 64, align: 64, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !874, file: !873, line: 94, baseType: !276, size: 64, align: 64, offset: 704)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !874, file: !873, line: 95, baseType: !276, size: 64, align: 64, offset: 768)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !874, file: !873, line: 97, baseType: !276, size: 64, align: 64, offset: 832)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !874, file: !873, line: 98, baseType: !276, size: 64, align: 64, offset: 896)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !874, file: !873, line: 99, baseType: !276, size: 64, align: 64, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !874, file: !873, line: 101, baseType: !276, size: 64, align: 64, offset: 1024)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !874, file: !873, line: 103, baseType: !314, size: 32, align: 32, offset: 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !874, file: !873, line: 105, baseType: !276, size: 64, align: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !874, file: !873, line: 106, baseType: !287, size: 64, align: 64, offset: 1216)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !874, file: !873, line: 108, baseType: !314, size: 32, align: 32, offset: 1280)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !874, file: !873, line: 109, baseType: !276, size: 64, align: 64, offset: 1344)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !874, file: !873, line: 134, baseType: !600, size: 64, align: 64, offset: 1408)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !874, file: !873, line: 135, baseType: !275, size: 64, align: 64, offset: 1472)
!929 = !DISubprogram(name: "path_and_dir_fd_invalid", scope: !616, file: !616, line: 957, type: !930, isLocal: true, isDefinition: true, scopeLine: 957, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.path_t*, i32)* @path_and_dir_fd_invalid, variables: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{!314, !322, !614, !314}
!932 = !{!933, !934, !935}
!933 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !929, file: !616, line: 957, type: !322)
!934 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !929, file: !616, line: 957, type: !614)
!935 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 3, scope: !929, file: !616, line: 957, type: !314)
!936 = !DISubprogram(name: "dir_fd_and_fd_invalid", scope: !616, file: !616, line: 968, type: !937, isLocal: true, isDefinition: true, scopeLine: 968, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i32)* @dir_fd_and_fd_invalid, variables: !939)
!937 = !DISubroutineType(types: !938)
!938 = !{!314, !322, !314, !314}
!939 = !{!940, !941, !942}
!940 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !936, file: !616, line: 968, type: !322)
!941 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 2, scope: !936, file: !616, line: 968, type: !314)
!942 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 3, scope: !936, file: !616, line: 968, type: !314)
!943 = !DISubprogram(name: "fd_and_follow_symlinks_invalid", scope: !616, file: !616, line: 979, type: !937, isLocal: true, isDefinition: true, scopeLine: 980, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i32)* @fd_and_follow_symlinks_invalid, variables: !944)
!944 = !{!945, !946, !947}
!945 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !943, file: !616, line: 979, type: !322)
!946 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 2, scope: !943, file: !616, line: 979, type: !314)
!947 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 3, scope: !943, file: !616, line: 980, type: !314)
!948 = !DISubprogram(name: "fstat64", scope: !949, file: !949, line: 517, type: !950, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.stat64*)* @fstat64, variables: !972)
!949 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!950 = !DISubroutineType(types: !951)
!951 = !{!314, !314, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !836, line: 119, size: 1152, align: 64, elements: !954)
!954 = !{!955, !956, !958, !959, !960, !961, !962, !963, !964, !965, !966, !968, !969, !970, !971}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !953, file: !836, line: 121, baseType: !839, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !953, file: !836, line: 123, baseType: !957, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !271, line: 137, baseType: !366)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !953, file: !836, line: 124, baseType: !843, size: 64, align: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !953, file: !836, line: 125, baseType: !845, size: 32, align: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !953, file: !836, line: 132, baseType: !270, size: 32, align: 32, offset: 224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !953, file: !836, line: 133, baseType: !274, size: 32, align: 32, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !953, file: !836, line: 135, baseType: !314, size: 32, align: 32, offset: 288)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !953, file: !836, line: 136, baseType: !839, size: 64, align: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !953, file: !836, line: 137, baseType: !345, size: 64, align: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !953, file: !836, line: 143, baseType: !852, size: 64, align: 64, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !953, file: !836, line: 144, baseType: !967, size: 64, align: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !271, line: 168, baseType: !287)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !953, file: !836, line: 152, baseType: !856, size: 128, align: 64, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !953, file: !836, line: 153, baseType: !856, size: 128, align: 64, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !953, file: !836, line: 154, baseType: !856, size: 128, align: 64, offset: 832)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !953, file: !836, line: 164, baseType: !865, size: 192, align: 64, offset: 960)
!972 = !{!973, !974}
!973 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !948, file: !949, line: 517, type: !314)
!974 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !948, file: !949, line: 517, type: !952)
!975 = !DISubprogram(name: "lstat64", scope: !949, file: !949, line: 510, type: !976, isLocal: false, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.stat64*)* @lstat64, variables: !978)
!976 = !DISubroutineType(types: !977)
!977 = !{!314, !299, !952}
!978 = !{!979, !980}
!979 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__path", arg: 1, scope: !975, file: !949, line: 510, type: !299)
!980 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !975, file: !949, line: 510, type: !952)
!981 = !DISubprogram(name: "fstatat64", scope: !949, file: !949, line: 524, type: !982, isLocal: false, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*, %struct.stat64*, i32)* @fstatat64, variables: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{!314, !314, !299, !952, !314}
!984 = !{!985, !986, !987, !988}
!985 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !981, file: !949, line: 524, type: !314)
!986 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__filename", arg: 2, scope: !981, file: !949, line: 524, type: !299)
!987 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 3, scope: !981, file: !949, line: 524, type: !952)
!988 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__flag", arg: 4, scope: !981, file: !949, line: 524, type: !314)
!989 = !DISubprogram(name: "stat64", scope: !949, file: !949, line: 503, type: !976, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.stat64*)* @stat64, variables: !990)
!990 = !{!991, !992}
!991 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__path", arg: 1, scope: !989, file: !949, line: 503, type: !299)
!992 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !989, file: !949, line: 503, type: !952)
!993 = !DISubprogram(name: "path_error", scope: !616, file: !616, line: 1305, type: !994, isLocal: true, isDefinition: true, scopeLine: 1306, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.path_t*)* @path_error, variables: !996)
!994 = !DISubroutineType(types: !995)
!995 = !{!276, !614}
!996 = !{!997}
!997 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !993, file: !616, line: 1305, type: !614)
!998 = !DISubprogram(name: "_pystat_fromstructstat", scope: !616, file: !616, line: 2205, type: !999, isLocal: true, isDefinition: true, scopeLine: 2206, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.stat*)* @_pystat_fromstructstat, variables: !1002)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!276, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008}
!1003 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !998, file: !616, line: 2205, type: !1001)
!1004 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ansec", scope: !998, file: !616, line: 2207, type: !366)
!1005 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mnsec", scope: !998, file: !616, line: 2207, type: !366)
!1006 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnsec", scope: !998, file: !616, line: 2207, type: !366)
!1007 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !998, file: !616, line: 2208, type: !276)
!1008 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1009, file: !616, line: 2302, type: !276)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !616, line: 2302, column: 12)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !616, line: 2301, column: 27)
!1011 = distinct !DILexicalBlock(scope: !998, file: !616, line: 2301, column: 9)
!1012 = !DISubprogram(name: "fill_time", scope: !616, file: !616, line: 2159, type: !1013, isLocal: true, isDefinition: true, scopeLine: 2160, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i32, i64, i64)* @fill_time, variables: !1016)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !276, !314, !1015, !366}
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !650, line: 75, baseType: !859)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1028, !1031, !1033, !1036, !1038, !1041, !1043, !1046, !1048}
!1017 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !1012, file: !616, line: 2159, type: !276)
!1018 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !1012, file: !616, line: 2159, type: !314)
!1019 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sec", arg: 3, scope: !1012, file: !616, line: 2159, type: !1015)
!1020 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsec", arg: 4, scope: !1012, file: !616, line: 2159, type: !366)
!1021 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !1012, file: !616, line: 2161, type: !276)
!1022 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns_fractional", scope: !1012, file: !616, line: 2162, type: !276)
!1023 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_in_ns", scope: !1012, file: !616, line: 2163, type: !276)
!1024 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns_total", scope: !1012, file: !616, line: 2164, type: !276)
!1025 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "float_s", scope: !1012, file: !616, line: 2165, type: !276)
!1026 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1027, file: !616, line: 2195, type: !276)
!1027 = distinct !DILexicalBlock(scope: !1012, file: !616, line: 2195, column: 8)
!1028 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1029, file: !616, line: 2195, type: !276)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !616, line: 2195, column: 93)
!1030 = distinct !DILexicalBlock(scope: !1027, file: !616, line: 2195, column: 59)
!1031 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1032, file: !616, line: 2196, type: !276)
!1032 = distinct !DILexicalBlock(scope: !1012, file: !616, line: 2196, column: 8)
!1033 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1034, file: !616, line: 2196, type: !276)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !616, line: 2196, column: 105)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !616, line: 2196, column: 71)
!1036 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1037, file: !616, line: 2197, type: !276)
!1037 = distinct !DILexicalBlock(scope: !1012, file: !616, line: 2197, column: 8)
!1038 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1039, file: !616, line: 2197, type: !276)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !616, line: 2197, column: 99)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !616, line: 2197, column: 65)
!1041 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1042, file: !616, line: 2198, type: !276)
!1042 = distinct !DILexicalBlock(scope: !1012, file: !616, line: 2198, column: 8)
!1043 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1044, file: !616, line: 2198, type: !276)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !616, line: 2198, column: 100)
!1045 = distinct !DILexicalBlock(scope: !1042, file: !616, line: 2198, column: 66)
!1046 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1047, file: !616, line: 2199, type: !276)
!1047 = distinct !DILexicalBlock(scope: !1012, file: !616, line: 2199, column: 8)
!1048 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1049, file: !616, line: 2199, type: !276)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !616, line: 2199, column: 99)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !616, line: 2199, column: 65)
!1051 = !DISubprogram(name: "path_cleanup", scope: !616, file: !616, line: 781, type: !1052, isLocal: true, isDefinition: true, scopeLine: 781, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.path_t*)* @path_cleanup, variables: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !614}
!1054 = !{!1055, !1056, !1060}
!1055 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !1051, file: !616, line: 781, type: !614)
!1056 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !1057, file: !616, line: 783, type: !276)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !616, line: 783, column: 12)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !616, line: 782, column: 24)
!1059 = distinct !DILexicalBlock(scope: !1051, file: !616, line: 782, column: 9)
!1060 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1061, file: !616, line: 783, type: !276)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !616, line: 783, column: 125)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !616, line: 783, column: 90)
!1063 = distinct !DILexicalBlock(scope: !1057, file: !616, line: 783, column: 67)
!1064 = !DISubprogram(name: "os_access", scope: !616, file: !616, line: 2622, type: !747, isLocal: true, isDefinition: true, scopeLine: 2623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*, %struct._object*)* @os_access, variables: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1066 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1064, file: !616, line: 2622, type: !749)
!1067 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1064, file: !616, line: 2622, type: !276)
!1068 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !1064, file: !616, line: 2622, type: !276)
!1069 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1064, file: !616, line: 2624, type: !276)
!1070 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !1064, file: !616, line: 2626, type: !615)
!1071 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !1064, file: !616, line: 2627, type: !314)
!1072 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir_fd", scope: !1064, file: !616, line: 2628, type: !314)
!1073 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "effective_ids", scope: !1064, file: !616, line: 2629, type: !314)
!1074 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "follow_symlinks", scope: !1064, file: !616, line: 2630, type: !314)
!1075 = !DISubprogram(name: "os_access_impl", scope: !616, file: !616, line: 2646, type: !1076, isLocal: true, isDefinition: true, scopeLine: 2648, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct.path_t*, i32, i32, i32, i32)* @os_access_impl, variables: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!276, !749, !614, !314, !314, !314, !314}
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1089}
!1079 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1075, file: !616, line: 2646, type: !749)
!1080 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !1075, file: !616, line: 2646, type: !614)
!1081 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !1075, file: !616, line: 2646, type: !314)
!1082 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 4, scope: !1075, file: !616, line: 2646, type: !314)
!1083 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "effective_ids", arg: 5, scope: !1075, file: !616, line: 2646, type: !314)
!1084 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 6, scope: !1075, file: !616, line: 2646, type: !314)
!1085 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1075, file: !616, line: 2649, type: !276)
!1086 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !1075, file: !616, line: 2654, type: !314)
!1087 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !1088, file: !616, line: 2690, type: !871)
!1088 = distinct !DILexicalBlock(scope: !1075, file: !616, line: 2690, column: 5)
!1089 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !1090, file: !616, line: 2695, type: !314)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !616, line: 2694, column: 27)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !616, line: 2692, column: 9)
!1092 = !DISubprogram(name: "os_ttyname", scope: !616, file: !616, line: 2758, type: !1093, isLocal: true, isDefinition: true, scopeLine: 2759, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*)* @os_ttyname, variables: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!276, !749, !276}
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1092, file: !616, line: 2758, type: !749)
!1097 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1092, file: !616, line: 2758, type: !276)
!1098 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1092, file: !616, line: 2760, type: !276)
!1099 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !1092, file: !616, line: 2761, type: !314)
!1100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_return_value", scope: !1092, file: !616, line: 2762, type: !322)
!1101 = !DISubprogram(name: "os_ttyname_impl", scope: !616, file: !616, line: 2778, type: !1102, isLocal: true, isDefinition: true, scopeLine: 2780, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.PyModuleDef*, i32)* @os_ttyname_impl, variables: !1104)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!322, !749, !314}
!1104 = !{!1105, !1106, !1107}
!1105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1101, file: !616, line: 2778, type: !749)
!1106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 2, scope: !1101, file: !616, line: 2778, type: !314)
!1107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !1101, file: !616, line: 2781, type: !322)
!1108 = !DISubprogram(name: "posix_error", scope: !616, file: !616, line: 1267, type: !727, isLocal: true, isDefinition: true, scopeLine: 1268, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @posix_error, variables: !1109)
!1109 = !{}
!1110 = !DISubprogram(name: "posix_chdir", scope: !616, file: !616, line: 2823, type: !405, isLocal: true, isDefinition: true, scopeLine: 2824, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @posix_chdir, variables: !1111)
