; ModuleID = 'irs-onlybc/prep_cif.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ffi_cif = type { i32, i32, %struct._ffi_type**, %struct._ffi_type*, i32, i32 }
%struct._ffi_type = type { i64, i16, i16, %struct._ffi_type** }
%struct.ffi_closure = type { [24 x i8], %struct.ffi_cif*, void (%struct.ffi_cif*, i8*, i8**, i8*)*, i8* }

; Function Attrs: uwtable
define hidden i32 @ffi_prep_cif_core(%struct.ffi_cif* %cif, i32 %abi, i32 %isvariadic, i32 %nfixedargs, i32 %ntotalargs, %struct._ffi_type* %rtype, %struct._ffi_type** %atypes) #0 {
entry:
  %retval = alloca i32, align 4
  %cif.addr = alloca %struct.ffi_cif*, align 8
  %abi.addr = alloca i32, align 4
  %isvariadic.addr = alloca i32, align 4
  %nfixedargs.addr = alloca i32, align 4
  %ntotalargs.addr = alloca i32, align 4
  %rtype.addr = alloca %struct._ffi_type*, align 8
  %atypes.addr = alloca %struct._ffi_type**, align 8
  %bytes = alloca i32, align 4
  %i = alloca i32, align 4
  %ptr = alloca %struct._ffi_type**, align 8
  %cleanup.dest.slot = alloca i32
  store %struct.ffi_cif* %cif, %struct.ffi_cif** %cif.addr, align 8, !tbaa !116
  call void @llvm.dbg.declare(metadata %struct.ffi_cif** %cif.addr, metadata !53, metadata !120), !dbg !121
  store i32 %abi, i32* %abi.addr, align 4, !tbaa !122
  call void @llvm.dbg.declare(metadata i32* %abi.addr, metadata !54, metadata !120), !dbg !123
  store i32 %isvariadic, i32* %isvariadic.addr, align 4, !tbaa !124

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !22)
!1 = !DIFile(filename: "prep_cif.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 204, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffi.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FFI_OK", value: 0)
!7 = !DIEnumerator(name: "FFI_BAD_TYPEDEF", value: 1)
!8 = !DIEnumerator(name: "FFI_BAD_ABI", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ffi_abi", file: !10, line: 75, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffitarget.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "FFI_FIRST_ABI", value: 0)
!13 = !DIEnumerator(name: "FFI_SYSV", value: 1)
!14 = !DIEnumerator(name: "FFI_UNIX64", value: 2)
!15 = !DIEnumerator(name: "FFI_LAST_ABI", value: 3)
!16 = !DIEnumerator(name: "FFI_DEFAULT_ABI", value: 2)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 62, baseType: !21)
!20 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !{!23, !63, !72, !82, !106}
!23 = !DISubprogram(name: "ffi_prep_cif_core", scope: !24, file: !24, line: 100, type: !25, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_cif*, i32, i32, i32, i32, %struct._ffi_type*, %struct._ffi_type**)* @ffi_prep_cif_core, variables: !52)
!24 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/libffi/src/prep_cif.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28, !33, !35, !35, !35, !38, !37}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_status", file: !4, line: 208, baseType: !3)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_cif", file: !4, line: 222, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 212, size: 256, align: 64, elements: !31)
!31 = !{!32, !34, !36, !49, !50, !51}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !30, file: !4, line: 213, baseType: !33, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_abi", file: !10, line: 108, baseType: !9)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !30, file: !4, line: 214, baseType: !35, size: 32, align: 32, offset: 32)
!35 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !30, file: !4, line: 215, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_type", file: !4, line: 118, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ffi_type", file: !4, line: 112, size: 192, align: 64, elements: !41)
!41 = !{!42, !43, !45, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !40, file: !4, line: 114, baseType: !19, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !40, file: !4, line: 115, baseType: !44, size: 16, align: 16, offset: 64)
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !4, line: 116, baseType: !44, size: 16, align: 16, offset: 80)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !40, file: !4, line: 117, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !30, file: !4, line: 216, baseType: !38, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !30, file: !4, line: 217, baseType: !35, size: 32, align: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !30, file: !4, line: 218, baseType: !35, size: 32, align: 32, offset: 224)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 1, scope: !23, file: !24, line: 100, type: !28)
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "abi", arg: 2, scope: !23, file: !24, line: 100, type: !33)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isvariadic", arg: 3, scope: !23, file: !24, line: 101, type: !35)
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfixedargs", arg: 4, scope: !23, file: !24, line: 102, type: !35)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ntotalargs", arg: 5, scope: !23, file: !24, line: 103, type: !35)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rtype", arg: 6, scope: !23, file: !24, line: 104, type: !38)
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atypes", arg: 7, scope: !23, file: !24, line: 104, type: !37)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !23, file: !24, line: 106, type: !35)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !23, file: !24, line: 107, type: !35)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !23, file: !24, line: 108, type: !37)
!63 = !DISubprogram(name: "ffi_prep_cif", scope: !24, file: !24, line: 210, type: !64, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_cif*, i32, i32, %struct._ffi_type*, %struct._ffi_type**)* @ffi_prep_cif, variables: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{!27, !28, !33, !35, !38, !37}
!66 = !{!67, !68, !69, !70, !71}
!67 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 1, scope: !63, file: !24, line: 210, type: !28)
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "abi", arg: 2, scope: !63, file: !24, line: 210, type: !33)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nargs", arg: 3, scope: !63, file: !24, line: 210, type: !35)
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rtype", arg: 4, scope: !63, file: !24, line: 211, type: !38)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atypes", arg: 5, scope: !63, file: !24, line: 211, type: !37)
!72 = !DISubprogram(name: "ffi_prep_cif_var", scope: !24, file: !24, line: 216, type: !73, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_cif*, i32, i32, i32, %struct._ffi_type*, %struct._ffi_type**)* @ffi_prep_cif_var, variables: !75)
!73 = !DISubroutineType(types: !74)
!74 = !{!27, !28, !33, !35, !35, !38, !37}
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 1, scope: !72, file: !24, line: 216, type: !28)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "abi", arg: 2, scope: !72, file: !24, line: 217, type: !33)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfixedargs", arg: 3, scope: !72, file: !24, line: 218, type: !35)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ntotalargs", arg: 4, scope: !72, file: !24, line: 219, type: !35)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rtype", arg: 5, scope: !72, file: !24, line: 220, type: !38)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atypes", arg: 6, scope: !72, file: !24, line: 221, type: !37)
!82 = !DISubprogram(name: "ffi_prep_closure", scope: !24, file: !24, line: 229, type: !83, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_closure*, %struct.ffi_cif*, void (%struct.ffi_cif*, i8*, i8**, i8*)*, i8*)* @ffi_prep_closure, variables: !101)
!83 = !DISubroutineType(types: !84)
!84 = !{!27, !85, !28, !96, !18}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_closure", file: !4, line: 310, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 299, size: 384, align: 64, elements: !88)
!88 = !{!89, !94, !95, !100}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tramp", scope: !87, file: !4, line: 304, baseType: !90, size: 192, align: 8)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 192, align: 8, elements: !92)
!91 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !{!93}
!93 = !DISubrange(count: 24)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !87, file: !4, line: 306, baseType: !28, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !87, file: !4, line: 307, baseType: !96, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !28, !18, !99, !18}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !87, file: !4, line: 308, baseType: !18, size: 64, align: 64, offset: 320)
!101 = !{!102, !103, !104, !105}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 1, scope: !82, file: !24, line: 229, type: !85)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 2, scope: !82, file: !24, line: 230, type: !28)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fun", arg: 3, scope: !82, file: !24, line: 231, type: !96)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 4, scope: !82, file: !24, line: 232, type: !18)
!106 = !DISubprogram(name: "initialize_aggregate", scope: !24, file: !24, line: 37, type: !107, isLocal: true, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._ffi_type*)* @initialize_aggregate, variables: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{!27, !38}
!109 = !{!110, !111}
!110 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !106, file: !24, line: 37, type: !38)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !106, file: !24, line: 39, type: !37)
!112 = !{i32 2, !"Dwarf Version", i32 4}
!113 = !{i32 2, !"Debug Info Version", i32 3}
!114 = !{i32 1, !"PIC Level", i32 2}
!115 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!116 = !{!117, !117, i64 0}
!117 = !{!"any pointer", !118, i64 0}
!118 = !{!"omnipotent char", !119, i64 0}
!119 = !{!"Simple C/C++ TBAA"}
!120 = !DIExpression()
!121 = !DILocation(line: 100, column: 79, scope: !23)
!122 = !{!118, !118, i64 0}
!123 = !DILocation(line: 100, column: 92, scope: !23)
!124 = !{!125, !125, i64 0}
!125 = !{!"int", !118, i64 0}
!126 = !DILocation(line: 101, column: 22, scope: !23)
!127 = !DILocation(line: 102, column: 43, scope: !23)
!128 = !DILocation(line: 103, column: 43, scope: !23)
!129 = !DILocation(line: 104, column: 19, scope: !23)
!130 = !DILocation(line: 104, column: 37, scope: !23)
!131 = !DILocation(line: 106, column: 3, scope: !23)
!132 = !DILocation(line: 106, column: 12, scope: !23)
!133 = !DILocation(line: 107, column: 3, scope: !23)
!134 = !DILocation(line: 107, column: 16, scope: !23)
!135 = !DILocation(line: 108, column: 3, scope: !23)
!136 = !DILocation(line: 108, column: 14, scope: !23)
!137 = !DILocation(line: 115, column: 10, scope: !138)
!138 = distinct !DILexicalBlock(scope: !23, file: !24, line: 115, column: 7)
!139 = !DILocation(line: 115, column: 14, scope: !138)
!140 = !DILocation(line: 115, column: 30, scope: !138)
!141 = !DILocation(line: 115, column: 33, scope: !142)
!142 = !DILexicalBlockFile(scope: !138, file: !24, discriminator: 1)
!143 = !DILocation(line: 115, column: 37, scope: !138)
!144 = !DILocation(line: 115, column: 7, scope: !23)
!145 = !DILocation(line: 116, column: 5, scope: !138)
!146 = !DILocation(line: 122, column: 14, scope: !23)
!147 = !DILocation(line: 122, column: 3, scope: !23)
!148 = !DILocation(line: 122, column: 8, scope: !23)
!149 = !DILocation(line: 122, column: 12, scope: !23)
!150 = !{!151, !118, i64 0}
!151 = !{!"", !118, i64 0, !125, i64 4, !117, i64 8, !117, i64 16, !125, i64 24, !125, i64 28}
!152 = !DILocation(line: 123, column: 20, scope: !23)
!153 = !DILocation(line: 123, column: 3, scope: !23)
!154 = !DILocation(line: 123, column: 8, scope: !23)
!155 = !DILocation(line: 123, column: 18, scope: !23)
!156 = !{!151, !117, i64 8}
!157 = !DILocation(line: 124, column: 16, scope: !23)
!158 = !DILocation(line: 124, column: 3, scope: !23)
!159 = !DILocation(line: 124, column: 8, scope: !23)
!160 = !DILocation(line: 124, column: 14, scope: !23)
!161 = !{!151, !125, i64 4}
!162 = !DILocation(line: 125, column: 16, scope: !23)
!163 = !DILocation(line: 125, column: 3, scope: !23)
!164 = !DILocation(line: 125, column: 8, scope: !23)
