; ModuleID = 'programs_new/Python-new/pyarena.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._arena = type { %struct._block*, %struct._block*, %struct._object* }
%struct._block = type { i64, i64, %struct._block*, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !364)
!1 = !DIFile(filename: "pyarena.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !23, !26, !11, !73, !361, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArena", file: !6, line: 12, baseType: !7)
!6 = !DIFile(filename: "Include/pyarena.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arena", file: !8, line: 45, size: 192, align: 64, elements: !9)
!8 = !DIFile(filename: "Python/pyarena.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!9 = !{!10, !24, !25}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "a_head", scope: !7, file: !8, line: 50, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !8, line: 38, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_block", file: !8, line: 16, size: 256, align: 64, elements: !14)
!14 = !{!15, !19, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ab_size", scope: !13, file: !8, line: 21, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 62, baseType: !18)
!17 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ab_offset", scope: !13, file: !8, line: 26, baseType: !16, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ab_next", scope: !13, file: !8, line: 32, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ab_mem", scope: !13, file: !8, line: 37, baseType: !23, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "a_cur", scope: !7, file: !8, line: 57, baseType: !11, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "a_objects", scope: !7, file: !8, line: 63, baseType: !26, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !28, line: 109, baseType: !29)
!28 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !28, line: 105, size: 128, align: 64, elements: !30)
!30 = !{!31, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !29, file: !28, line: 107, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !33, line: 177, baseType: !34)
!33 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !35, line: 102, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !37, line: 181, baseType: !38)
!37 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!38 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !29, file: !28, line: 108, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !28, line: 334, size: 3200, align: 64, elements: !42)
!42 = !{!43, !49, !53, !54, !55, !60, !120, !125, !130, !131, !136, !188, !219, !231, !237, !238, !239, !241, !243, !274, !275, !276, !285, !286, !291, !292, !294, !296, !306, !309, !327, !328, !329, !331, !333, !334, !336, !341, !346, !351, !352, !353, !354, !355, !356, !357, !358, !360}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !41, file: !28, line: 335, baseType: !44, size: 192, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !28, line: 114, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 111, size: 192, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !45, file: !28, line: 112, baseType: !27, size: 128, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !45, file: !28, line: 113, baseType: !32, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !41, file: !28, line: 336, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !41, file: !28, line: 337, baseType: !32, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !41, file: !28, line: 337, baseType: !32, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !41, file: !28, line: 341, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !28, line: 308, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !26}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !41, file: !28, line: 342, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !28, line: 314, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !26, !66, !65}
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !35, line: 48, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 246, size: 1728, align: 64, elements: !70)
!69 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!70 = !{!71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !92, !93, !94, !95, !97, !99, !101, !105, !108, !110, !111, !112, !113, !114, !115, !116}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 247, baseType: !65, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 252, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 253, baseType: !73, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 254, baseType: !73, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 255, baseType: !73, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 256, baseType: !73, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 257, baseType: !73, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 258, baseType: !73, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 259, baseType: !73, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 261, baseType: !73, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 262, baseType: !73, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 263, baseType: !73, size: 64, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 265, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 161, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !86, file: !69, line: 162, baseType: !85, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !86, file: !69, line: 163, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !86, file: !69, line: 167, baseType: !65, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 267, baseType: !90, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 269, baseType: !65, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 273, baseType: !65, size: 32, align: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 275, baseType: !96, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 140, baseType: !38)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 279, baseType: !98, size: 16, align: 16, offset: 1024)
!98 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 280, baseType: !100, size: 8, align: 8, offset: 1040)
!100 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 281, baseType: !102, size: 8, align: 8, offset: 1048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 285, baseType: !106, size: 64, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 155, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 294, baseType: !109, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !37, line: 141, baseType: !38)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !68, file: !69, line: 303, baseType: !23, size: 64, align: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !68, file: !69, line: 304, baseType: !23, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !68, file: !69, line: 305, baseType: !23, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !68, file: !69, line: 306, baseType: !23, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 307, baseType: !16, size: 64, align: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 309, baseType: !65, size: 32, align: 32, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 311, baseType: !117, size: 160, align: 8, offset: 1568)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, align: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 20)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !41, file: !28, line: 343, baseType: !121, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !28, line: 316, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!26, !26, !73}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !41, file: !28, line: 344, baseType: !126, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !28, line: 318, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!65, !26, !73, !26}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !41, file: !28, line: 345, baseType: !23, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !41, file: !28, line: 346, baseType: !132, size: 64, align: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !28, line: 320, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!26, !26}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !41, file: !28, line: 350, baseType: !137, size: 64, align: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !28, line: 278, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 236, size: 2176, align: 64, elements: !140)
!140 = !{!141, !146, !147, !148, !149, !150, !155, !157, !158, !159, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !139, file: !28, line: 241, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !28, line: 166, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!26, !26, !26}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !139, file: !28, line: 242, baseType: !142, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !139, file: !28, line: 243, baseType: !142, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !139, file: !28, line: 244, baseType: !142, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !139, file: !28, line: 245, baseType: !142, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !139, file: !28, line: 246, baseType: !151, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !28, line: 167, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!26, !26, !26, !26}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !139, file: !28, line: 247, baseType: !156, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !28, line: 165, baseType: !133)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !139, file: !28, line: 248, baseType: !156, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !139, file: !28, line: 249, baseType: !156, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !139, file: !28, line: 250, baseType: !160, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !28, line: 168, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!65, !26}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !139, file: !28, line: 251, baseType: !156, size: 64, align: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !139, file: !28, line: 252, baseType: !142, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !139, file: !28, line: 253, baseType: !142, size: 64, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !139, file: !28, line: 254, baseType: !142, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !139, file: !28, line: 255, baseType: !142, size: 64, align: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !139, file: !28, line: 256, baseType: !142, size: 64, align: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !139, file: !28, line: 257, baseType: !156, size: 64, align: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !139, file: !28, line: 258, baseType: !23, size: 64, align: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !139, file: !28, line: 259, baseType: !156, size: 64, align: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !139, file: !28, line: 261, baseType: !142, size: 64, align: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !139, file: !28, line: 262, baseType: !142, size: 64, align: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !139, file: !28, line: 263, baseType: !142, size: 64, align: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !139, file: !28, line: 264, baseType: !142, size: 64, align: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !139, file: !28, line: 265, baseType: !151, size: 64, align: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !139, file: !28, line: 266, baseType: !142, size: 64, align: 64, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !139, file: !28, line: 267, baseType: !142, size: 64, align: 64, offset: 1600)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !139, file: !28, line: 268, baseType: !142, size: 64, align: 64, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !139, file: !28, line: 269, baseType: !142, size: 64, align: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !139, file: !28, line: 270, baseType: !142, size: 64, align: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !139, file: !28, line: 272, baseType: !142, size: 64, align: 64, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !139, file: !28, line: 273, baseType: !142, size: 64, align: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !139, file: !28, line: 274, baseType: !142, size: 64, align: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !139, file: !28, line: 275, baseType: !142, size: 64, align: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !139, file: !28, line: 277, baseType: !156, size: 64, align: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !41, file: !28, line: 351, baseType: !189, size: 64, align: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !28, line: 292, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 280, size: 640, align: 64, elements: !192)
!192 = !{!193, !198, !199, !204, !205, !206, !211, !212, !217, !218}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !191, file: !28, line: 281, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !28, line: 169, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!32, !26}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !191, file: !28, line: 282, baseType: !142, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !191, file: !28, line: 283, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !28, line: 170, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!26, !26, !32}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !191, file: !28, line: 284, baseType: !200, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !191, file: !28, line: 285, baseType: !23, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !191, file: !28, line: 286, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !28, line: 172, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!65, !26, !32, !26}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !191, file: !28, line: 287, baseType: !23, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !191, file: !28, line: 288, baseType: !213, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !28, line: 231, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!65, !26, !26}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !191, file: !28, line: 290, baseType: !142, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !191, file: !28, line: 291, baseType: !200, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !41, file: !28, line: 352, baseType: !220, size: 64, align: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !28, line: 298, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 294, size: 192, align: 64, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !222, file: !28, line: 295, baseType: !194, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !222, file: !28, line: 296, baseType: !142, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !222, file: !28, line: 297, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !28, line: 174, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!65, !26, !26, !26}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !41, file: !28, line: 356, baseType: !232, size: 64, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !28, line: 321, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !26}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !33, line: 186, baseType: !32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !41, file: !28, line: 357, baseType: !151, size: 64, align: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !41, file: !28, line: 358, baseType: !132, size: 64, align: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !41, file: !28, line: 359, baseType: !240, size: 64, align: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !28, line: 317, baseType: !143)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !41, file: !28, line: 360, baseType: !242, size: 64, align: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !28, line: 319, baseType: !228)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !41, file: !28, line: 363, baseType: !244, size: 64, align: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !28, line: 304, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 301, size: 128, align: 64, elements: !247)
!247 = !{!248, !269}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !246, file: !28, line: 302, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !28, line: 193, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!65, !26, !253, !65}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !28, line: 191, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !28, line: 178, size: 640, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !255, file: !28, line: 179, baseType: !23, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !255, file: !28, line: 180, baseType: !26, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !255, file: !28, line: 181, baseType: !32, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !255, file: !28, line: 182, baseType: !32, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !255, file: !28, line: 184, baseType: !65, size: 32, align: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !255, file: !28, line: 185, baseType: !65, size: 32, align: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !255, file: !28, line: 186, baseType: !73, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !255, file: !28, line: 187, baseType: !265, size: 64, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !255, file: !28, line: 188, baseType: !265, size: 64, align: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !255, file: !28, line: 189, baseType: !265, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !255, file: !28, line: 190, baseType: !23, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !246, file: !28, line: 303, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !28, line: 194, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !26, !253}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !41, file: !28, line: 366, baseType: !18, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !41, file: !28, line: 368, baseType: !50, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !41, file: !28, line: 372, baseType: !277, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !28, line: 233, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!65, !26, !281, !23}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !28, line: 232, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!65, !26, !23}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !41, file: !28, line: 375, baseType: !160, size: 64, align: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !41, file: !28, line: 379, baseType: !287, size: 64, align: 64, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !28, line: 322, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!26, !26, !26, !65}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !41, file: !28, line: 382, baseType: !32, size: 64, align: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !41, file: !28, line: 385, baseType: !293, size: 64, align: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !28, line: 323, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !41, file: !28, line: 386, baseType: !295, size: 64, align: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !28, line: 324, baseType: !133)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !41, file: !28, line: 389, baseType: !297, size: 64, align: 64, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !299, line: 40, size: 256, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!300 = !{!301, !302, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !298, file: !299, line: 41, baseType: !50, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !298, file: !299, line: 42, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !299, line: 18, baseType: !143)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !298, file: !299, line: 43, baseType: !65, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !298, file: !299, line: 45, baseType: !50, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !41, file: !28, line: 390, baseType: !307, size: 64, align: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !28, line: 390, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !41, file: !28, line: 391, baseType: !310, size: 64, align: 64, offset: 1984)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !312, line: 11, size: 320, align: 64, elements: !313)
!312 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!313 = !{!314, !315, !320, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !312, line: 12, baseType: !73, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !311, file: !312, line: 13, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !312, line: 8, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!26, !26, !23}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !311, file: !312, line: 14, baseType: !321, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !312, line: 9, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!65, !26, !26, !23}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !311, file: !312, line: 15, baseType: !73, size: 64, align: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !311, file: !312, line: 16, baseType: !23, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !41, file: !28, line: 392, baseType: !40, size: 64, align: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !41, file: !28, line: 393, baseType: !26, size: 64, align: 64, offset: 2112)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !41, file: !28, line: 394, baseType: !330, size: 64, align: 64, offset: 2176)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !28, line: 325, baseType: !152)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !41, file: !28, line: 395, baseType: !332, size: 64, align: 64, offset: 2240)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !28, line: 326, baseType: !228)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !41, file: !28, line: 396, baseType: !32, size: 64, align: 64, offset: 2304)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !41, file: !28, line: 397, baseType: !335, size: 64, align: 64, offset: 2368)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !28, line: 327, baseType: !228)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !41, file: !28, line: 398, baseType: !337, size: 64, align: 64, offset: 2432)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !28, line: 329, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!26, !40, !32}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !41, file: !28, line: 399, baseType: !342, size: 64, align: 64, offset: 2496)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !28, line: 328, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!26, !40, !26, !26}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !41, file: !28, line: 400, baseType: !347, size: 64, align: 64, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !28, line: 307, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !23}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !41, file: !28, line: 401, baseType: !160, size: 64, align: 64, offset: 2624)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !41, file: !28, line: 402, baseType: !26, size: 64, align: 64, offset: 2688)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !41, file: !28, line: 403, baseType: !26, size: 64, align: 64, offset: 2752)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !41, file: !28, line: 404, baseType: !26, size: 64, align: 64, offset: 2816)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !41, file: !28, line: 405, baseType: !26, size: 64, align: 64, offset: 2880)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !41, file: !28, line: 406, baseType: !26, size: 64, align: 64, offset: 2944)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !41, file: !28, line: 407, baseType: !56, size: 64, align: 64, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !41, file: !28, line: 410, baseType: !359, size: 32, align: 32, offset: 3072)
!359 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !41, file: !28, line: 412, baseType: !56, size: 64, align: 64, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !33, line: 153, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !363, line: 122, baseType: !18)
!363 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!364 = !{!365, !370, !377, !384, !395, !401, !408}
!365 = !DISubprogram(name: "PyArena_New", scope: !8, file: !8, line: 128, type: !366, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._arena* ()* @PyArena_New, variables: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!4}
!368 = !{!369}
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arena", scope: !365, file: !8, line: 130, type: !4)
!370 = !DISubprogram(name: "PyArena_Free", scope: !8, file: !8, line: 157, type: !371, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._arena*)* @PyArena_Free, variables: !373)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !4}
!373 = !{!374, !375}
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arena", arg: 1, scope: !370, file: !8, line: 157, type: !4)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !376, file: !8, line: 175, type: !26)
!376 = distinct !DILexicalBlock(scope: !370, file: !8, line: 175, column: 8)
!377 = !DISubprogram(name: "PyArena_Malloc", scope: !8, file: !8, line: 180, type: !378, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._arena*, i64)* @PyArena_Malloc, variables: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!23, !4, !16}
!380 = !{!381, !382, !383}
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arena", arg: 1, scope: !377, file: !8, line: 180, type: !4)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !377, file: !8, line: 180, type: !16)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !377, file: !8, line: 182, type: !23)
!384 = !DISubprogram(name: "PyArena_AddPyObject", scope: !8, file: !8, line: 203, type: !385, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._arena*, %struct._object*)* @PyArena_AddPyObject, variables: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{!65, !4, !26}
!387 = !{!388, !389, !390, !391}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arena", arg: 1, scope: !384, file: !8, line: 203, type: !4)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !384, file: !8, line: 203, type: !26)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !384, file: !8, line: 205, type: !65)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !392, file: !8, line: 207, type: !26)
!392 = distinct !DILexicalBlock(scope: !393, file: !8, line: 207, column: 12)
!393 = distinct !DILexicalBlock(scope: !394, file: !8, line: 206, column: 17)
!394 = distinct !DILexicalBlock(scope: !384, file: !8, line: 206, column: 9)
!395 = !DISubprogram(name: "block_new", scope: !8, file: !8, line: 76, type: !396, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: %struct._block* (i64)* @block_new, variables: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!11, !16}
!398 = !{!399, !400}
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !395, file: !8, line: 76, type: !16)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !395, file: !8, line: 80, type: !11)
