; ModuleID = 'programs_new/Python-new/pyexpat.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyExpat_CAPI = type { i8*, i32, i32, i32, i32, i8* (i32)*, i32 (%struct.XML_ParserStruct*)*, i64 (%struct.XML_ParserStruct*)*, i64 (%struct.XML_ParserStruct*)*, i32 (%struct.XML_ParserStruct*, i8*, i32, i32)*, %struct.XML_ParserStruct* (i8*, %struct.XML_Memory_Handling_Suite*, i8*)*, void (%struct.XML_ParserStruct*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*, i32)*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*)*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*, i32)*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*, i8**)*, void (i8*, i8*)*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*)*, void (i8*, i8*)*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*)*)*, void (%struct.XML_ParserStruct*, i32 (i8*, i8*, %struct.XML_Encoding*)*, i8*)*, void (%struct.XML_ParserStruct*, i8*)*, void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i8*, i32)*)*, i32 (%struct.XML_ParserStruct*, i8*)*, i32 (i8*, i8*, %struct.XML_Encoding*)* }
%struct.XML_ParserStruct = type opaque
%struct.XML_Memory_Handling_Suite = type { i8* (i64)*, i8* (i8*, i64)*, void (i8*)* }
%struct.XML_Encoding = type { [256 x i32], i8*, i32 (i8*, i8*)*, void (i8*)* }

!60 = !DIEnumerator(name: "XML_FEATURE_SIZEOF_XML_CHAR", value: 6)
!61 = !DIEnumerator(name: "XML_FEATURE_SIZEOF_XML_LCHAR", value: 7)
!62 = !DIEnumerator(name: "XML_FEATURE_NS", value: 8)
!63 = !DIEnumerator(name: "XML_FEATURE_LARGE_SIZE", value: 9)
!64 = !DIEnumerator(name: "XML_FEATURE_ATTR_INFO", value: 10)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XML_ParamEntityParsing", file: !4, line: 876, size: 32, align: 32, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "XML_PARAM_ENTITY_PARSING_NEVER", value: 0)
!68 = !DIEnumerator(name: "XML_PARAM_ENTITY_PARSING_UNLESS_STANDALONE", value: 1)
!69 = !DIEnumerator(name: "XML_PARAM_ENTITY_PARSING_ALWAYS", value: 2)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XML_Content_Type", file: !4, line: 101, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "XML_CTYPE_EMPTY", value: 1)
!73 = !DIEnumerator(name: "XML_CTYPE_ANY", value: 2)
!74 = !DIEnumerator(name: "XML_CTYPE_MIXED", value: 3)
!75 = !DIEnumerator(name: "XML_CTYPE_NAME", value: 4)
!76 = !DIEnumerator(name: "XML_CTYPE_CHOICE", value: 5)
!77 = !DIEnumerator(name: "XML_CTYPE_SEQ", value: 6)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XML_Content_Quant", file: !4, line: 110, size: 32, align: 32, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIEnumerator(name: "XML_CQUANT_NONE", value: 0)
!81 = !DIEnumerator(name: "XML_CQUANT_OPT", value: 1)
!82 = !DIEnumerator(name: "XML_CQUANT_REP", value: 2)
!83 = !DIEnumerator(name: "XML_CQUANT_PLUS", value: 3)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HandlerTypes", file: !85, line: 16, size: 32, align: 32, elements: !86)
!85 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/pyexpat.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!87 = !DIEnumerator(name: "StartElement", value: 0)
!88 = !DIEnumerator(name: "EndElement", value: 1)
!89 = !DIEnumerator(name: "ProcessingInstruction", value: 2)
!90 = !DIEnumerator(name: "CharacterData", value: 3)
!91 = !DIEnumerator(name: "UnparsedEntityDecl", value: 4)
!92 = !DIEnumerator(name: "NotationDecl", value: 5)
!93 = !DIEnumerator(name: "StartNamespaceDecl", value: 6)
!94 = !DIEnumerator(name: "EndNamespaceDecl", value: 7)
!95 = !DIEnumerator(name: "Comment", value: 8)
!96 = !DIEnumerator(name: "StartCdataSection", value: 9)
!97 = !DIEnumerator(name: "EndCdataSection", value: 10)
!98 = !DIEnumerator(name: "Default", value: 11)
!99 = !DIEnumerator(name: "DefaultHandlerExpand", value: 12)
!100 = !DIEnumerator(name: "NotStandalone", value: 13)
!101 = !DIEnumerator(name: "ExternalEntityRef", value: 14)
!102 = !DIEnumerator(name: "StartDoctypeDecl", value: 15)
!103 = !DIEnumerator(name: "EndDoctypeDecl", value: 16)
!104 = !DIEnumerator(name: "EntityDecl", value: 17)
!105 = !DIEnumerator(name: "XmlDecl", value: 18)
!106 = !DIEnumerator(name: "ElementDecl", value: 19)
!107 = !DIEnumerator(name: "AttlistDecl", value: 20)
!108 = !DIEnumerator(name: "SkippedEntity", value: 21)
!109 = !DIEnumerator(name: "_DummyDecl", value: 22)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !111, line: 23, size: 32, align: 32, elements: !112)
!111 = !DIFile(filename: "./Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!112 = !{!113, !114, !115, !116, !117}
!113 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!114 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!115 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!116 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!117 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !119, line: 451, size: 32, align: 32, elements: !120)
!119 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!120 = !{!121, !122, !123, !124}
!121 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!122 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!123 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!124 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!125 = !{!126, !127, !174, !465, !479, !487, !495, !151, !503, !615, !616, !166, !617, !635, !636, !639, !647, !663, !665, !139, !667, !675, !676, !218, !686}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !129, line: 109, baseType: !130)
!129 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !129, line: 105, size: 128, align: 64, elements: !131)
!131 = !{!132, !140}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !130, file: !129, line: 107, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !134, line: 177, baseType: !135)
!134 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !136, line: 102, baseType: !137)
!136 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !138, line: 181, baseType: !139)
!138 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!139 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !130, file: !129, line: 108, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !129, line: 334, size: 3200, align: 64, elements: !143)
!143 = !{!144, !150, !154, !155, !156, !161, !224, !229, !234, !235, !240, !292, !323, !335, !341, !342, !343, !345, !347, !378, !379, !380, !389, !390, !395, !396, !398, !400, !410, !413, !431, !432, !433, !435, !437, !438, !440, !445, !450, !455, !456, !457, !458, !459, !460, !461, !462, !464}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !142, file: !129, line: 335, baseType: !145, size: 192, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !129, line: 114, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 111, size: 192, align: 64, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !146, file: !129, line: 112, baseType: !128, size: 128, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !146, file: !129, line: 113, baseType: !133, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !142, file: !129, line: 336, baseType: !151, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !142, file: !129, line: 337, baseType: !133, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !142, file: !129, line: 337, baseType: !133, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !142, file: !129, line: 341, baseType: !157, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !129, line: 308, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !127}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !142, file: !129, line: 342, baseType: !162, size: 64, align: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !129, line: 314, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !127, !167, !166}
!166 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !136, line: 48, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 246, size: 1728, align: 64, elements: !171)
!170 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!171 = !{!172, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !193, !194, !195, !196, !198, !200, !202, !206, !209, !211, !212, !213, !214, !215, !219, !220}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 247, baseType: !166, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 252, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 253, baseType: !174, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 254, baseType: !174, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 255, baseType: !174, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 256, baseType: !174, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 257, baseType: !174, size: 64, align: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 258, baseType: !174, size: 64, align: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 259, baseType: !174, size: 64, align: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 261, baseType: !174, size: 64, align: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 262, baseType: !174, size: 64, align: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 263, baseType: !174, size: 64, align: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 265, baseType: !186, size: 64, align: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 161, size: 192, align: 64, elements: !188)
!188 = !{!189, !190, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !187, file: !170, line: 162, baseType: !186, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !187, file: !170, line: 163, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !187, file: !170, line: 167, baseType: !166, size: 32, align: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 267, baseType: !191, size: 64, align: 64, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 269, baseType: !166, size: 32, align: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 273, baseType: !166, size: 32, align: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 275, baseType: !197, size: 64, align: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !138, line: 140, baseType: !139)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 279, baseType: !199, size: 16, align: 16, offset: 1024)
!199 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 280, baseType: !201, size: 8, align: 8, offset: 1040)
!201 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 281, baseType: !203, size: 8, align: 8, offset: 1048)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 8, align: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 285, baseType: !207, size: 64, align: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 155, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 294, baseType: !210, size: 64, align: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !138, line: 141, baseType: !139)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !169, file: !170, line: 303, baseType: !126, size: 64, align: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !169, file: !170, line: 304, baseType: !126, size: 64, align: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !169, file: !170, line: 305, baseType: !126, size: 64, align: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !169, file: !170, line: 306, baseType: !126, size: 64, align: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 307, baseType: !216, size: 64, align: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !217, line: 62, baseType: !218)
!217 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!218 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 309, baseType: !166, size: 32, align: 32, offset: 1536)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 311, baseType: !221, size: 160, align: 8, offset: 1568)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 160, align: 8, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 20)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !142, file: !129, line: 343, baseType: !225, size: 64, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !129, line: 316, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!127, !127, !174}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !142, file: !129, line: 344, baseType: !230, size: 64, align: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !129, line: 318, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!166, !127, !174, !127}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !142, file: !129, line: 345, baseType: !126, size: 64, align: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !142, file: !129, line: 346, baseType: !236, size: 64, align: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !129, line: 320, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!127, !127}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !142, file: !129, line: 350, baseType: !241, size: 64, align: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !129, line: 278, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 236, size: 2176, align: 64, elements: !244)
!244 = !{!245, !250, !251, !252, !253, !254, !259, !261, !262, !263, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !243, file: !129, line: 241, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !129, line: 166, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!127, !127, !127}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !243, file: !129, line: 242, baseType: !246, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !243, file: !129, line: 243, baseType: !246, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !243, file: !129, line: 244, baseType: !246, size: 64, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !243, file: !129, line: 245, baseType: !246, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !243, file: !129, line: 246, baseType: !255, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !129, line: 167, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!127, !127, !127, !127}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !243, file: !129, line: 247, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !129, line: 165, baseType: !237)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !243, file: !129, line: 248, baseType: !260, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !243, file: !129, line: 249, baseType: !260, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !243, file: !129, line: 250, baseType: !264, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !129, line: 168, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!166, !127}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !243, file: !129, line: 251, baseType: !260, size: 64, align: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !243, file: !129, line: 252, baseType: !246, size: 64, align: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !243, file: !129, line: 253, baseType: !246, size: 64, align: 64, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !243, file: !129, line: 254, baseType: !246, size: 64, align: 64, offset: 832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !243, file: !129, line: 255, baseType: !246, size: 64, align: 64, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !243, file: !129, line: 256, baseType: !246, size: 64, align: 64, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !243, file: !129, line: 257, baseType: !260, size: 64, align: 64, offset: 1024)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !243, file: !129, line: 258, baseType: !126, size: 64, align: 64, offset: 1088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !243, file: !129, line: 259, baseType: !260, size: 64, align: 64, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !243, file: !129, line: 261, baseType: !246, size: 64, align: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !243, file: !129, line: 262, baseType: !246, size: 64, align: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !243, file: !129, line: 263, baseType: !246, size: 64, align: 64, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !243, file: !129, line: 264, baseType: !246, size: 64, align: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !243, file: !129, line: 265, baseType: !255, size: 64, align: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !243, file: !129, line: 266, baseType: !246, size: 64, align: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !243, file: !129, line: 267, baseType: !246, size: 64, align: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !243, file: !129, line: 268, baseType: !246, size: 64, align: 64, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !243, file: !129, line: 269, baseType: !246, size: 64, align: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !243, file: !129, line: 270, baseType: !246, size: 64, align: 64, offset: 1792)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !243, file: !129, line: 272, baseType: !246, size: 64, align: 64, offset: 1856)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !243, file: !129, line: 273, baseType: !246, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !243, file: !129, line: 274, baseType: !246, size: 64, align: 64, offset: 1984)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !243, file: !129, line: 275, baseType: !246, size: 64, align: 64, offset: 2048)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !243, file: !129, line: 277, baseType: !260, size: 64, align: 64, offset: 2112)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !142, file: !129, line: 351, baseType: !293, size: 64, align: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !129, line: 292, baseType: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 280, size: 640, align: 64, elements: !296)
!296 = !{!297, !302, !303, !308, !309, !310, !315, !316, !321, !322}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !295, file: !129, line: 281, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !129, line: 169, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!133, !127}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !295, file: !129, line: 282, baseType: !246, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !295, file: !129, line: 283, baseType: !304, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !129, line: 170, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!127, !127, !133}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !295, file: !129, line: 284, baseType: !304, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !295, file: !129, line: 285, baseType: !126, size: 64, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !295, file: !129, line: 286, baseType: !311, size: 64, align: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !129, line: 172, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!166, !127, !133, !127}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !295, file: !129, line: 287, baseType: !126, size: 64, align: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !295, file: !129, line: 288, baseType: !317, size: 64, align: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !129, line: 231, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!166, !127, !127}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !295, file: !129, line: 290, baseType: !246, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !295, file: !129, line: 291, baseType: !304, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !142, file: !129, line: 352, baseType: !324, size: 64, align: 64, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !129, line: 298, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 294, size: 192, align: 64, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !326, file: !129, line: 295, baseType: !298, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !326, file: !129, line: 296, baseType: !246, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !326, file: !129, line: 297, baseType: !331, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !129, line: 174, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!166, !127, !127, !127}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !142, file: !129, line: 356, baseType: !336, size: 64, align: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !129, line: 321, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!340, !127}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !134, line: 186, baseType: !133)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !142, file: !129, line: 357, baseType: !255, size: 64, align: 64, offset: 1024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !142, file: !129, line: 358, baseType: !236, size: 64, align: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !142, file: !129, line: 359, baseType: !344, size: 64, align: 64, offset: 1152)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !129, line: 317, baseType: !247)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !142, file: !129, line: 360, baseType: !346, size: 64, align: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !129, line: 319, baseType: !332)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !142, file: !129, line: 363, baseType: !348, size: 64, align: 64, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !129, line: 304, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 301, size: 128, align: 64, elements: !351)
!351 = !{!352, !373}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !350, file: !129, line: 302, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !129, line: 193, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!166, !127, !357, !166}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !129, line: 191, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !129, line: 178, size: 640, align: 64, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !370, !371, !372}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !359, file: !129, line: 179, baseType: !126, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !359, file: !129, line: 180, baseType: !127, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !359, file: !129, line: 181, baseType: !133, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !359, file: !129, line: 182, baseType: !133, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !359, file: !129, line: 184, baseType: !166, size: 32, align: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !359, file: !129, line: 185, baseType: !166, size: 32, align: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !359, file: !129, line: 186, baseType: !174, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !359, file: !129, line: 187, baseType: !369, size: 64, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !359, file: !129, line: 188, baseType: !369, size: 64, align: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !359, file: !129, line: 189, baseType: !369, size: 64, align: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !359, file: !129, line: 190, baseType: !126, size: 64, align: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !350, file: !129, line: 303, baseType: !374, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !129, line: 194, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !127, !357}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !142, file: !129, line: 366, baseType: !218, size: 64, align: 64, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !142, file: !129, line: 368, baseType: !151, size: 64, align: 64, offset: 1408)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !142, file: !129, line: 372, baseType: !381, size: 64, align: 64, offset: 1472)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !129, line: 233, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!166, !127, !385, !126}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !129, line: 232, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!166, !127, !126}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !142, file: !129, line: 375, baseType: !264, size: 64, align: 64, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !142, file: !129, line: 379, baseType: !391, size: 64, align: 64, offset: 1600)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !129, line: 322, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!127, !127, !127, !166}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !142, file: !129, line: 382, baseType: !133, size: 64, align: 64, offset: 1664)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !142, file: !129, line: 385, baseType: !397, size: 64, align: 64, offset: 1728)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !129, line: 323, baseType: !237)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !142, file: !129, line: 386, baseType: !399, size: 64, align: 64, offset: 1792)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !129, line: 324, baseType: !237)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !142, file: !129, line: 389, baseType: !401, size: 64, align: 64, offset: 1856)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !403, line: 40, size: 256, align: 64, elements: !404)
!403 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !{!405, !406, !408, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !402, file: !403, line: 41, baseType: !151, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !402, file: !403, line: 42, baseType: !407, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !403, line: 18, baseType: !247)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !402, file: !403, line: 43, baseType: !166, size: 32, align: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !402, file: !403, line: 45, baseType: !151, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !142, file: !129, line: 390, baseType: !411, size: 64, align: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !129, line: 390, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !142, file: !129, line: 391, baseType: !414, size: 64, align: 64, offset: 1984)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !416, line: 11, size: 320, align: 64, elements: !417)
!416 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!417 = !{!418, !419, !424, !429, !430}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !416, line: 12, baseType: !174, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !415, file: !416, line: 13, baseType: !420, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !416, line: 8, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!127, !127, !126}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !415, file: !416, line: 14, baseType: !425, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !416, line: 9, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!166, !127, !127, !126}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !415, file: !416, line: 15, baseType: !174, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !415, file: !416, line: 16, baseType: !126, size: 64, align: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !142, file: !129, line: 392, baseType: !141, size: 64, align: 64, offset: 2048)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !142, file: !129, line: 393, baseType: !127, size: 64, align: 64, offset: 2112)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !142, file: !129, line: 394, baseType: !434, size: 64, align: 64, offset: 2176)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !129, line: 325, baseType: !256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !142, file: !129, line: 395, baseType: !436, size: 64, align: 64, offset: 2240)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !129, line: 326, baseType: !332)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !142, file: !129, line: 396, baseType: !133, size: 64, align: 64, offset: 2304)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !142, file: !129, line: 397, baseType: !439, size: 64, align: 64, offset: 2368)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !129, line: 327, baseType: !332)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !142, file: !129, line: 398, baseType: !441, size: 64, align: 64, offset: 2432)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !129, line: 329, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!127, !141, !133}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !142, file: !129, line: 399, baseType: !446, size: 64, align: 64, offset: 2496)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !129, line: 328, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!127, !141, !127, !127}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !142, file: !129, line: 400, baseType: !451, size: 64, align: 64, offset: 2560)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !129, line: 307, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !126}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !142, file: !129, line: 401, baseType: !264, size: 64, align: 64, offset: 2624)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !142, file: !129, line: 402, baseType: !127, size: 64, align: 64, offset: 2688)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !142, file: !129, line: 403, baseType: !127, size: 64, align: 64, offset: 2752)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !142, file: !129, line: 404, baseType: !127, size: 64, align: 64, offset: 2816)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !142, file: !129, line: 405, baseType: !127, size: 64, align: 64, offset: 2880)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !142, file: !129, line: 406, baseType: !127, size: 64, align: 64, offset: 2944)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !142, file: !129, line: 407, baseType: !157, size: 64, align: 64, offset: 3008)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !142, file: !129, line: 410, baseType: !463, size: 32, align: 32, offset: 3072)
!463 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !142, file: !129, line: 412, baseType: !157, size: 64, align: 64, offset: 3136)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "xmlparseobject", file: !85, line: 64, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 50, size: 576, align: 64, elements: !468)
!468 = !{!469, !470, !474, !475, !476, !477, !478, !482, !483, !484, !485}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !467, file: !85, line: 51, baseType: !128, size: 128, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "itself", scope: !467, file: !85, line: 53, baseType: !471, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Parser", file: !4, line: 25, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "XML_ParserStruct", file: !4, line: 24, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_attributes", scope: !467, file: !85, line: 54, baseType: !166, size: 32, align: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "specified_attributes", scope: !467, file: !85, line: 55, baseType: !166, size: 32, align: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "in_callback", scope: !467, file: !85, line: 56, baseType: !166, size: 32, align: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ns_prefixes", scope: !467, file: !85, line: 57, baseType: !166, size: 32, align: 32, offset: 288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !467, file: !85, line: 58, baseType: !479, size: 64, align: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Char", file: !481, line: 98, baseType: !153)
!481 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/expat_external.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !467, file: !85, line: 60, baseType: !166, size: 32, align: 32, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_used", scope: !467, file: !85, line: 61, baseType: !166, size: 32, align: 32, offset: 416)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "intern", scope: !467, file: !85, line: 62, baseType: !127, size: 64, align: 64, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !467, file: !85, line: 63, baseType: !486, size: 64, align: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !489, line: 40, baseType: !490)
!489 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!490 = !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 23, size: 320, align: 64, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !490, file: !489, line: 24, baseType: !145, size: 192, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !490, file: !489, line: 26, baseType: !486, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !490, file: !489, line: 39, baseType: !133, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !497, line: 33, baseType: !498)
!497 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!498 = !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 25, size: 256, align: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !498, file: !497, line: 26, baseType: !145, size: 192, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !498, file: !497, line: 27, baseType: !502, size: 64, align: 64, offset: 192)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, align: 64, elements: !204)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !505, line: 139, baseType: !506)
!505 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !505, line: 69, size: 1536, align: 64, elements: !507)
!507 = !{!508, !510, !511, !531, !588, !589, !590, !591, !592, !593, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !506, file: !505, line: 72, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !505, line: 73, baseType: !509, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !506, file: !505, line: 74, baseType: !512, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !505, line: 44, baseType: !514)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !505, line: 19, size: 832, align: 64, elements: !515)
!515 = !{!516, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !505, line: 21, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !514, file: !505, line: 22, baseType: !509, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !514, file: !505, line: 24, baseType: !127, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !514, file: !505, line: 25, baseType: !127, size: 64, align: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !514, file: !505, line: 26, baseType: !127, size: 64, align: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !514, file: !505, line: 27, baseType: !127, size: 64, align: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !514, file: !505, line: 28, baseType: !127, size: 64, align: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !514, file: !505, line: 30, baseType: !127, size: 64, align: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !514, file: !505, line: 31, baseType: !127, size: 64, align: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !514, file: !505, line: 32, baseType: !127, size: 64, align: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !514, file: !505, line: 33, baseType: !166, size: 32, align: 32, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !514, file: !505, line: 34, baseType: !166, size: 32, align: 32, offset: 672)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !514, file: !505, line: 37, baseType: !166, size: 32, align: 32, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !514, file: !505, line: 43, baseType: !127, size: 64, align: 64, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !506, file: !505, line: 76, baseType: !532, size: 64, align: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !534, line: 17, size: 3072, align: 64, elements: !535)
!534 = !DIFile(filename: "./Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!535 = !{!536, !537, !538, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !587}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !533, file: !534, line: 18, baseType: !145, size: 192, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !533, file: !534, line: 19, baseType: !532, size: 64, align: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !533, file: !534, line: 20, baseType: !539, size: 64, align: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !541, line: 33, baseType: !542)
!541 = !DIFile(filename: "./Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!542 = !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 11, size: 1152, align: 64, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !559, !560, !561, !562, !563, !564}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !542, file: !541, line: 12, baseType: !128, size: 128, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !542, file: !541, line: 13, baseType: !166, size: 32, align: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !542, file: !541, line: 14, baseType: !166, size: 32, align: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !542, file: !541, line: 15, baseType: !166, size: 32, align: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !542, file: !541, line: 16, baseType: !166, size: 32, align: 32, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !542, file: !541, line: 17, baseType: !166, size: 32, align: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !542, file: !541, line: 18, baseType: !127, size: 64, align: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !542, file: !541, line: 19, baseType: !127, size: 64, align: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !542, file: !541, line: 20, baseType: !127, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !542, file: !541, line: 21, baseType: !127, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !542, file: !541, line: 22, baseType: !127, size: 64, align: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !542, file: !541, line: 23, baseType: !127, size: 64, align: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !542, file: !541, line: 25, baseType: !557, size: 64, align: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !542, file: !541, line: 26, baseType: !127, size: 64, align: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !542, file: !541, line: 27, baseType: !127, size: 64, align: 64, offset: 832)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !542, file: !541, line: 28, baseType: !166, size: 32, align: 32, offset: 896)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !542, file: !541, line: 29, baseType: !127, size: 64, align: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !542, file: !541, line: 31, baseType: !126, size: 64, align: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !542, file: !541, line: 32, baseType: !127, size: 64, align: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !533, file: !534, line: 21, baseType: !127, size: 64, align: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !533, file: !534, line: 22, baseType: !127, size: 64, align: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !533, file: !534, line: 23, baseType: !127, size: 64, align: 64, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !533, file: !534, line: 24, baseType: !486, size: 64, align: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !533, file: !534, line: 28, baseType: !486, size: 64, align: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !533, file: !534, line: 29, baseType: !127, size: 64, align: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !533, file: !534, line: 38, baseType: !127, size: 64, align: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !533, file: !534, line: 38, baseType: !127, size: 64, align: 64, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !533, file: !534, line: 38, baseType: !127, size: 64, align: 64, offset: 832)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !533, file: !534, line: 40, baseType: !127, size: 64, align: 64, offset: 896)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !533, file: !534, line: 42, baseType: !166, size: 32, align: 32, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !533, file: !534, line: 48, baseType: !166, size: 32, align: 32, offset: 992)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !533, file: !534, line: 49, baseType: !166, size: 32, align: 32, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !533, file: !534, line: 50, baseType: !153, size: 8, align: 8, offset: 1056)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !533, file: !534, line: 51, baseType: !580, size: 1920, align: 32, offset: 1088)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 1920, align: 32, elements: !222)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !534, line: 15, baseType: !582)
!582 = !DICompositeType(tag: DW_TAG_structure_type, file: !534, line: 11, size: 96, align: 32, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !582, file: !534, line: 12, baseType: !166, size: 32, align: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !582, file: !534, line: 13, baseType: !166, size: 32, align: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !582, file: !534, line: 14, baseType: !166, size: 32, align: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !533, file: !534, line: 52, baseType: !502, size: 64, align: 64, offset: 3008)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !506, file: !505, line: 77, baseType: !166, size: 32, align: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !506, file: !505, line: 78, baseType: !153, size: 8, align: 8, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !506, file: !505, line: 80, baseType: !153, size: 8, align: 8, offset: 296)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !506, file: !505, line: 85, baseType: !166, size: 32, align: 32, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !506, file: !505, line: 86, baseType: !166, size: 32, align: 32, offset: 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !506, file: !505, line: 88, baseType: !594, size: 64, align: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !505, line: 54, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!166, !127, !532, !166, !127}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !506, file: !505, line: 89, baseType: !594, size: 64, align: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !506, file: !505, line: 90, baseType: !127, size: 64, align: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !506, file: !505, line: 91, baseType: !127, size: 64, align: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !506, file: !505, line: 93, baseType: !127, size: 64, align: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !506, file: !505, line: 94, baseType: !127, size: 64, align: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !506, file: !505, line: 95, baseType: !127, size: 64, align: 64, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !506, file: !505, line: 97, baseType: !127, size: 64, align: 64, offset: 832)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !506, file: !505, line: 98, baseType: !127, size: 64, align: 64, offset: 896)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !506, file: !505, line: 99, baseType: !127, size: 64, align: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !506, file: !505, line: 101, baseType: !127, size: 64, align: 64, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !506, file: !505, line: 103, baseType: !166, size: 32, align: 32, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !506, file: !505, line: 105, baseType: !127, size: 64, align: 64, offset: 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !506, file: !505, line: 106, baseType: !139, size: 64, align: 64, offset: 1216)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !506, file: !505, line: 108, baseType: !166, size: 32, align: 32, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !506, file: !505, line: 109, baseType: !127, size: 64, align: 64, offset: 1344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !506, file: !505, line: 134, baseType: !452, size: 64, align: 64, offset: 1408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !506, file: !505, line: 135, baseType: !126, size: 64, align: 64, offset: 1472)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Bool", file: !4, line: 28, baseType: !558)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !119, line: 351, baseType: !619)
!619 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 217, size: 384, align: 64, elements: !620)
!620 = !{!621, !622, !623, !624, !632}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !619, file: !119, line: 291, baseType: !128, size: 128, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !619, file: !119, line: 292, baseType: !133, size: 64, align: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !619, file: !119, line: 293, baseType: !340, size: 64, align: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !619, file: !119, line: 349, baseType: !625, size: 32, align: 32, offset: 256)
!625 = !DICompositeType(tag: DW_TAG_structure_type, scope: !619, file: !119, line: 294, size: 32, align: 32, elements: !626)
!626 = !{!627, !628, !629, !630, !631}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !625, file: !119, line: 303, baseType: !463, size: 2, align: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !625, file: !119, line: 331, baseType: !463, size: 3, align: 32, offset: 2)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !625, file: !119, line: 336, baseType: !463, size: 1, align: 32, offset: 5)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !625, file: !119, line: 340, baseType: !463, size: 1, align: 32, offset: 6)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !625, file: !119, line: 345, baseType: !463, size: 1, align: 32, offset: 7)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !619, file: !119, line: 350, baseType: !633, size: 64, align: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !217, line: 90, baseType: !166)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !119, line: 121, baseType: !463)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !119, line: 134, baseType: !558)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !119, line: 363, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 356, size: 576, align: 64, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !641, file: !119, line: 357, baseType: !618, size: 384, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !641, file: !119, line: 358, baseType: !133, size: 64, align: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !641, file: !119, line: 360, baseType: !174, size: 64, align: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !641, file: !119, line: 361, baseType: !133, size: 64, align: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !119, line: 376, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 368, size: 640, align: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !649, file: !119, line: 369, baseType: !640, size: 576, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !649, file: !119, line: 375, baseType: !653, size: 64, align: 64, offset: 576)
!653 = !DICompositeType(tag: DW_TAG_union_type, scope: !649, file: !119, line: 370, size: 64, align: 64, elements: !654)
!654 = !{!655, !656, !658, !661}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !653, file: !119, line: 371, baseType: !126, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !653, file: !119, line: 372, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !653, file: !119, line: 373, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !119, line: 129, baseType: !199)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !653, file: !119, line: 374, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !669, line: 41, baseType: !670)
!669 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!670 = !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 31, size: 320, align: 64, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !670, file: !669, line: 32, baseType: !145, size: 192, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !670, file: !669, line: 33, baseType: !340, size: 64, align: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !670, file: !669, line: 34, baseType: !203, size: 8, align: 8, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !678, line: 30, baseType: !679)
!678 = !DIFile(filename: "./Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!679 = !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 23, size: 448, align: 64, elements: !680)
!680 = !{!681, !682, !683, !684, !685}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !679, file: !678, line: 24, baseType: !145, size: 192, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !679, file: !678, line: 25, baseType: !133, size: 64, align: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !679, file: !678, line: 26, baseType: !174, size: 64, align: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !679, file: !678, line: 27, baseType: !174, size: 64, align: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !679, file: !678, line: 29, baseType: !166, size: 32, align: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_UnknownEncodingHandler", file: !4, line: 528, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!166, !126, !690, !692}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Encoding", file: !4, line: 511, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 506, size: 8384, align: 64, elements: !695)
!695 = !{!696, !700, !701, !705}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !694, file: !4, line: 507, baseType: !697, size: 8192, align: 32)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 8192, align: 32, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !694, file: !4, line: 508, baseType: !126, size: 64, align: 64, offset: 8192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !694, file: !4, line: 509, baseType: !702, size: 64, align: 64, offset: 8256)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!166, !126, !151}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !694, file: !4, line: 510, baseType: !452, size: 64, align: 64, offset: 8320)
!706 = !{!707, !924, !946, !997, !1004, !1010, !1027, !1033, !1040, !1043, !1061, !1070, !1080, !1085, !1124, !1133, !1138, !1141, !1150, !1180, !1187, !1202, !1218, !1224, !1243, !1261, !1275, !1288, !1301, !1313, !1325, !1339, !1353, !1368, !1385, !1403, !1415, !1437, !1454, !1492, !1516, !1535, !1549, !1560, !1564, !1570, !1598, !1614, !1628, !1637, !1647, !1653, !1671, !1688, !1722, !1739, !1744, !1748, !1776, !1781, !1790, !1796, !1913, !1933, !1947, !1966, !1971}
!707 = !DISubprogram(name: "PyInit_pyexpat", scope: !85, file: !85, line: 1725, type: !708, isLocal: false, isDefinition: true, scopeLine: 1726, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_pyexpat, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!127}
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !732, !734, !736, !749, !750, !753, !757, !758, !762, !764, !768, !771, !773, !776, !778, !780, !782, !784, !786, !788, !790, !792, !794, !796, !798, !800, !802, !804, !806, !808, !810, !812, !814, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !836, !838, !840, !842, !844, !846, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !874, !876, !878, !880, !882, !884, !886, !888, !890, !892, !894, !896, !898, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922}
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !707, file: !85, line: 1727, type: !127)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !707, file: !85, line: 1727, type: !127)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errmod_name", scope: !707, file: !85, line: 1728, type: !127)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors_module", scope: !707, file: !85, line: 1729, type: !127)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modelmod_name", scope: !707, file: !85, line: 1730, type: !127)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "model_module", scope: !707, file: !85, line: 1731, type: !127)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sys_modules", scope: !707, file: !85, line: 1732, type: !127)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpnum", scope: !707, file: !85, line: 1733, type: !127)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpstr", scope: !707, file: !85, line: 1733, type: !127)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codes_dict", scope: !707, file: !85, line: 1734, type: !127)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rev_codes_dict", scope: !707, file: !85, line: 1735, type: !127)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !707, file: !85, line: 1736, type: !166)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "capi_object", scope: !707, file: !85, line: 1738, type: !127)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !725, file: !85, line: 1771, type: !726)
!725 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1770, column: 5)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Expat_Version", file: !4, line: 1002, baseType: !727)
!727 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 998, size: 96, align: 32, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !727, file: !4, line: 999, baseType: !166, size: 32, align: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !727, file: !4, line: 1000, baseType: !166, size: 32, align: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "micro", scope: !727, file: !4, line: 1001, baseType: !166, size: 32, align: 32, offset: 64)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !85, line: 1793, type: !127)
!733 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1793, column: 8)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !735, file: !85, line: 1803, type: !127)
!735 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1803, column: 8)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "features", scope: !737, file: !85, line: 1810, type: !738)
!737 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1809, column: 5)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Feature", file: !4, line: 1030, baseType: !741)
!741 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1026, size: 192, align: 64, elements: !742)
!742 = !{!743, !744, !748}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "feature", scope: !741, file: !4, line: 1027, baseType: !52, size: 32, align: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !4, line: 1028, baseType: !745, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_LChar", file: !481, line: 99, baseType: !153)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !741, file: !4, line: 1029, baseType: !139, size: 64, align: 64, offset: 128)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !737, file: !85, line: 1811, type: !127)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !751, file: !85, line: 1816, type: !166)
!751 = distinct !DILexicalBlock(scope: !752, file: !85, line: 1815, column: 14)
!752 = distinct !DILexicalBlock(scope: !737, file: !85, line: 1812, column: 13)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !754, file: !85, line: 1818, type: !166)
!754 = distinct !DILexicalBlock(scope: !755, file: !85, line: 1817, column: 65)
!755 = distinct !DILexicalBlock(scope: !756, file: !85, line: 1817, column: 13)
!756 = distinct !DILexicalBlock(scope: !751, file: !85, line: 1817, column: 13)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !754, file: !85, line: 1819, type: !127)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !759, file: !85, line: 1822, type: !127)
!759 = distinct !DILexicalBlock(scope: !760, file: !85, line: 1822, column: 24)
!760 = distinct !DILexicalBlock(scope: !761, file: !85, line: 1821, column: 41)
!761 = distinct !DILexicalBlock(scope: !754, file: !85, line: 1821, column: 21)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !763, file: !85, line: 1827, type: !127)
!763 = distinct !DILexicalBlock(scope: !754, file: !85, line: 1827, column: 20)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !765, file: !85, line: 1842, type: !127)
!765 = distinct !DILexicalBlock(scope: !766, file: !85, line: 1842, column: 12)
!766 = distinct !DILexicalBlock(scope: !767, file: !85, line: 1841, column: 67)
!767 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1841, column: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !85, line: 1842, type: !127)
!769 = distinct !DILexicalBlock(scope: !770, file: !85, line: 1842, column: 106)
!770 = distinct !DILexicalBlock(scope: !765, file: !85, line: 1842, column: 72)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !772, file: !85, line: 1843, type: !127)
!772 = distinct !DILexicalBlock(scope: !766, file: !85, line: 1843, column: 12)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !85, line: 1843, type: !127)
!774 = distinct !DILexicalBlock(scope: !775, file: !85, line: 1843, column: 110)
!775 = distinct !DILexicalBlock(scope: !772, file: !85, line: 1843, column: 76)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !85, line: 1863, type: !127)
!777 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1863, column: 549)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !85, line: 1863, type: !127)
!779 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1863, column: 754)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !781, file: !85, line: 1864, type: !127)
!781 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1864, column: 534)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !85, line: 1864, type: !127)
!783 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1864, column: 739)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !785, file: !85, line: 1865, type: !127)
!785 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1865, column: 559)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !787, file: !85, line: 1865, type: !127)
!787 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1865, column: 764)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !85, line: 1866, type: !127)
!789 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1866, column: 569)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !791, file: !85, line: 1866, type: !127)
!791 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1866, column: 774)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !85, line: 1867, type: !127)
!793 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1867, column: 574)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !795, file: !85, line: 1867, type: !127)
!795 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1867, column: 779)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !85, line: 1868, type: !127)
!797 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1868, column: 564)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !85, line: 1868, type: !127)
!799 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1868, column: 769)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !85, line: 1869, type: !127)
!801 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1869, column: 564)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !85, line: 1869, type: !127)
!803 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1869, column: 769)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !805, file: !85, line: 1870, type: !127)
!805 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1870, column: 599)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !807, file: !85, line: 1870, type: !127)
!807 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1870, column: 804)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !85, line: 1871, type: !127)
!809 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1871, column: 614)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !811, file: !85, line: 1871, type: !127)
!811 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1871, column: 819)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !813, file: !85, line: 1872, type: !127)
!813 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1872, column: 584)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !85, line: 1872, type: !127)
!815 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1872, column: 789)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !85, line: 1873, type: !127)
!817 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1873, column: 584)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !819, file: !85, line: 1873, type: !127)
!819 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1873, column: 789)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !821, file: !85, line: 1874, type: !127)
!821 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1874, column: 604)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !823, file: !85, line: 1874, type: !127)
!823 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1874, column: 809)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !825, file: !85, line: 1875, type: !127)
!825 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1875, column: 564)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !827, file: !85, line: 1875, type: !127)
!827 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1875, column: 769)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !829, file: !85, line: 1876, type: !127)
!829 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1876, column: 564)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !831, file: !85, line: 1876, type: !127)
!831 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1876, column: 769)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !833, file: !85, line: 1877, type: !127)
!833 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1877, column: 589)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !835, file: !85, line: 1877, type: !127)
!835 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1877, column: 794)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !85, line: 1878, type: !127)
!837 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1878, column: 649)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !839, file: !85, line: 1878, type: !127)
!839 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1878, column: 854)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !85, line: 1879, type: !127)
!841 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1879, column: 584)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !843, file: !85, line: 1879, type: !127)
!843 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1879, column: 789)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !845, file: !85, line: 1880, type: !127)
!845 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1880, column: 584)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !847, file: !85, line: 1880, type: !127)
!847 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1880, column: 789)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !849, file: !85, line: 1881, type: !127)
!849 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1881, column: 594)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !85, line: 1881, type: !127)
!851 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1881, column: 799)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !853, file: !85, line: 1882, type: !127)
!853 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1882, column: 614)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !85, line: 1882, type: !127)
!855 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1882, column: 819)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !857, file: !85, line: 1883, type: !127)
!857 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1883, column: 624)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !859, file: !85, line: 1883, type: !127)
!859 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1883, column: 829)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !861, file: !85, line: 1884, type: !127)
!861 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1884, column: 574)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !863, file: !85, line: 1884, type: !127)
!863 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1884, column: 779)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !85, line: 1885, type: !127)
!865 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1885, column: 584)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !85, line: 1885, type: !127)
!867 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1885, column: 789)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !869, file: !85, line: 1886, type: !127)
!869 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1886, column: 609)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !871, file: !85, line: 1886, type: !127)
!871 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1886, column: 814)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !85, line: 1887, type: !127)
!873 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1887, column: 624)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !85, line: 1887, type: !127)
!875 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1887, column: 829)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !85, line: 1888, type: !127)
!877 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1888, column: 664)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !879, file: !85, line: 1888, type: !127)
!879 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1888, column: 869)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !881, file: !85, line: 1890, type: !127)
!881 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1890, column: 574)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !883, file: !85, line: 1890, type: !127)
!883 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1890, column: 779)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !885, file: !85, line: 1892, type: !127)
!885 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1892, column: 594)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !85, line: 1892, type: !127)
!887 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1892, column: 799)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !889, file: !85, line: 1893, type: !127)
!889 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1893, column: 569)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !891, file: !85, line: 1893, type: !127)
!891 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1893, column: 774)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !893, file: !85, line: 1894, type: !127)
!893 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1894, column: 544)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !85, line: 1894, type: !127)
!895 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1894, column: 749)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !897, file: !85, line: 1895, type: !127)
!897 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1895, column: 549)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !85, line: 1895, type: !127)
!899 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1895, column: 754)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !85, line: 1896, type: !127)
!901 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1896, column: 544)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !903, file: !85, line: 1896, type: !127)
!903 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1896, column: 749)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !905, file: !85, line: 1897, type: !127)
!905 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1897, column: 549)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !907, file: !85, line: 1897, type: !127)
!907 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1897, column: 754)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !909, file: !85, line: 1898, type: !127)
!909 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1898, column: 569)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !911, file: !85, line: 1898, type: !127)
!911 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1898, column: 774)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !913, file: !85, line: 1899, type: !127)
!913 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1899, column: 539)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !915, file: !85, line: 1899, type: !127)
!915 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1899, column: 744)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !85, line: 1900, type: !127)
!917 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1900, column: 544)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !919, file: !85, line: 1900, type: !127)
!919 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1900, column: 749)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !921, file: !85, line: 1901, type: !127)
!921 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1901, column: 554)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !923, file: !85, line: 1901, type: !127)
!923 = distinct !DILexicalBlock(scope: !707, file: !85, line: 1901, column: 759)
!924 = !DISubprogram(name: "xmlparse_dealloc", scope: !85, file: !85, line: 1242, type: !925, isLocal: true, isDefinition: true, scopeLine: 1243, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.xmlparseobject*)* @xmlparse_dealloc, variables: !927)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !465}
!927 = !{!928, !929, !930, !933, !938, !941, !943}
!928 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !924, file: !85, line: 1242, type: !465)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !924, file: !85, line: 1244, type: !166)
!930 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !931, file: !85, line: 1251, type: !127)
!931 = distinct !DILexicalBlock(scope: !932, file: !85, line: 1250, column: 39)
!932 = distinct !DILexicalBlock(scope: !924, file: !85, line: 1250, column: 9)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !934, file: !85, line: 1255, type: !127)
!934 = distinct !DILexicalBlock(scope: !935, file: !85, line: 1255, column: 16)
!935 = distinct !DILexicalBlock(scope: !936, file: !85, line: 1252, column: 62)
!936 = distinct !DILexicalBlock(scope: !937, file: !85, line: 1252, column: 9)
!937 = distinct !DILexicalBlock(scope: !931, file: !85, line: 1252, column: 9)
!938 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !939, file: !85, line: 1255, type: !127)
!939 = distinct !DILexicalBlock(scope: !940, file: !85, line: 1255, column: 104)
!940 = distinct !DILexicalBlock(scope: !934, file: !85, line: 1255, column: 70)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !942, file: !85, line: 1264, type: !127)
!942 = distinct !DILexicalBlock(scope: !924, file: !85, line: 1264, column: 8)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !944, file: !85, line: 1264, type: !127)
!944 = distinct !DILexicalBlock(scope: !945, file: !85, line: 1264, column: 104)
!945 = distinct !DILexicalBlock(scope: !942, file: !85, line: 1264, column: 70)
!946 = !DISubprogram(name: "my_StartElementHandler", scope: !85, file: !85, line: 438, type: !947, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, i8**)* @my_StartElementHandler, variables: !950)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !126, !690, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!950 = !{!951, !952, !953, !954, !955, !958, !959, !960, !961, !962, !966, !967, !971, !975, !977, !982, !984, !987, !989, !993, !995}
!951 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "userData", arg: 1, scope: !946, file: !85, line: 438, type: !126)
!952 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !946, file: !85, line: 439, type: !690)
!953 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atts", arg: 3, scope: !946, file: !85, line: 439, type: !949)
!954 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !946, file: !85, line: 441, type: !465)
!955 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "container", scope: !956, file: !85, line: 444, type: !127)
!956 = distinct !DILexicalBlock(scope: !957, file: !85, line: 443, column: 43)
!957 = distinct !DILexicalBlock(scope: !946, file: !85, line: 443, column: 9)
!958 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !956, file: !85, line: 444, type: !127)
!959 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !956, file: !85, line: 444, type: !127)
!960 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !956, file: !85, line: 445, type: !166)
!961 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !956, file: !85, line: 445, type: !166)
!962 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !963, file: !85, line: 473, type: !127)
!963 = distinct !DILexicalBlock(scope: !964, file: !85, line: 472, column: 38)
!964 = distinct !DILexicalBlock(scope: !965, file: !85, line: 472, column: 9)
!965 = distinct !DILexicalBlock(scope: !956, file: !85, line: 472, column: 9)
!966 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !963, file: !85, line: 474, type: !127)
!967 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !968, file: !85, line: 477, type: !127)
!968 = distinct !DILexicalBlock(scope: !969, file: !85, line: 477, column: 20)
!969 = distinct !DILexicalBlock(scope: !970, file: !85, line: 475, column: 34)
!970 = distinct !DILexicalBlock(scope: !963, file: !85, line: 475, column: 17)
!971 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !972, file: !85, line: 483, type: !127)
!972 = distinct !DILexicalBlock(scope: !973, file: !85, line: 483, column: 20)
!973 = distinct !DILexicalBlock(scope: !974, file: !85, line: 481, column: 34)
!974 = distinct !DILexicalBlock(scope: !963, file: !85, line: 481, column: 17)
!975 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !976, file: !85, line: 484, type: !127)
