; ModuleID = 'irs-onlybc/pystrtod.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !421)
!1 = !DIFile(filename: "pystrtod.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !6, !7, !8, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !9, line: 177, baseType: !10)
!9 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !11, line: 102, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !13, line: 181, baseType: !14)
!13 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !31, !367, !379, !385, !392}
!17 = !DISubprogram(name: "_Py_parse_inf_or_nan", scope: !18, file: !18, line: 28, type: !19, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i8**)* @_Py_parse_inf_or_nan, variables: !25)
!18 = !DIFile(filename: "Python/pystrtod.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !22, !24}
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!25 = !{!26, !27, !28, !29, !30}
!26 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !17, file: !18, line: 28, type: !22)
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "endptr", arg: 2, scope: !17, file: !18, line: 28, type: !24)
!28 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !17, file: !18, line: 30, type: !21)
!29 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !17, file: !18, line: 31, type: !22)
!30 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negate", scope: !17, file: !18, line: 32, type: !15)
!31 = !DISubprogram(name: "PyOS_string_to_double", scope: !18, file: !18, line: 337, type: !32, isLocal: false, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i8**, %struct._object*)* @PyOS_string_to_double, variables: !360)
!32 = !DISubroutineType(types: !33)
!33 = !{!21, !22, !24, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !36, line: 109, baseType: !37)
!36 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !36, line: 105, size: 128, align: 64, elements: !38)
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !37, file: !36, line: 107, baseType: !8, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !37, file: !36, line: 108, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !36, line: 334, size: 3200, align: 64, elements: !43)
!43 = !{!44, !50, !51, !52, !53, !58, !119, !124, !129, !130, !135, !187, !218, !230, !236, !237, !238, !240, !242, !273, !274, !275, !284, !285, !290, !291, !293, !295, !305, !308, !326, !327, !328, !330, !332, !333, !335, !340, !345, !350, !351, !352, !353, !354, !355, !356, !357, !359}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !42, file: !36, line: 335, baseType: !45, size: 192, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !36, line: 114, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 111, size: 192, align: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !46, file: !36, line: 112, baseType: !35, size: 128, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !46, file: !36, line: 113, baseType: !8, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !42, file: !36, line: 336, baseType: !22, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !42, file: !36, line: 337, baseType: !8, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !42, file: !36, line: 337, baseType: !8, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !42, file: !36, line: 341, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !36, line: 308, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !34}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !42, file: !36, line: 342, baseType: !59, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !36, line: 314, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!15, !34, !63, !15}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !11, line: 48, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 246, size: 1728, align: 64, elements: !67)
!66 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !93, !95, !97, !101, !104, !106, !107, !108, !109, !110, !114, !115}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 247, baseType: !15, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 252, baseType: !4, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 253, baseType: !4, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 254, baseType: !4, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 255, baseType: !4, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 256, baseType: !4, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 257, baseType: !4, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 258, baseType: !4, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 259, baseType: !4, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 261, baseType: !4, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 262, baseType: !4, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 263, baseType: !4, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 265, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 161, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !66, line: 162, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !66, line: 163, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !66, line: 167, baseType: !15, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 267, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 269, baseType: !15, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 273, baseType: !15, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 275, baseType: !92, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !13, line: 140, baseType: !14)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 279, baseType: !94, size: 16, align: 16, offset: 1024)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 280, baseType: !96, size: 8, align: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 281, baseType: !98, size: 8, align: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 285, baseType: !102, size: 64, align: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 155, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 294, baseType: !105, size: 64, align: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !13, line: 141, baseType: !14)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !65, file: !66, line: 303, baseType: !6, size: 64, align: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !65, file: !66, line: 304, baseType: !6, size: 64, align: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !65, file: !66, line: 305, baseType: !6, size: 64, align: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !65, file: !66, line: 306, baseType: !6, size: 64, align: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 307, baseType: !111, size: 64, align: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 62, baseType: !113)
!112 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!113 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 309, baseType: !15, size: 32, align: 32, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 311, baseType: !116, size: 160, align: 8, offset: 1568)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 20)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !42, file: !36, line: 343, baseType: !120, size: 64, align: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !36, line: 316, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!34, !34, !4}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !42, file: !36, line: 344, baseType: !125, size: 64, align: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !36, line: 318, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!15, !34, !4, !34}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !42, file: !36, line: 345, baseType: !6, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !42, file: !36, line: 346, baseType: !131, size: 64, align: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !36, line: 320, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!34, !34}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !42, file: !36, line: 350, baseType: !136, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !36, line: 278, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 236, size: 2176, align: 64, elements: !139)
!139 = !{!140, !145, !146, !147, !148, !149, !154, !156, !157, !158, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !138, file: !36, line: 241, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !36, line: 166, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!34, !34, !34}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !138, file: !36, line: 242, baseType: !141, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !138, file: !36, line: 243, baseType: !141, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !138, file: !36, line: 244, baseType: !141, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !138, file: !36, line: 245, baseType: !141, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !138, file: !36, line: 246, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !36, line: 167, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!34, !34, !34, !34}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !138, file: !36, line: 247, baseType: !155, size: 64, align: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !36, line: 165, baseType: !132)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !138, file: !36, line: 248, baseType: !155, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !138, file: !36, line: 249, baseType: !155, size: 64, align: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !138, file: !36, line: 250, baseType: !159, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !36, line: 168, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!15, !34}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !138, file: !36, line: 251, baseType: !155, size: 64, align: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !138, file: !36, line: 252, baseType: !141, size: 64, align: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !138, file: !36, line: 253, baseType: !141, size: 64, align: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !138, file: !36, line: 254, baseType: !141, size: 64, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !138, file: !36, line: 255, baseType: !141, size: 64, align: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !138, file: !36, line: 256, baseType: !141, size: 64, align: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !138, file: !36, line: 257, baseType: !155, size: 64, align: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !138, file: !36, line: 258, baseType: !6, size: 64, align: 64, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !138, file: !36, line: 259, baseType: !155, size: 64, align: 64, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !138, file: !36, line: 261, baseType: !141, size: 64, align: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !138, file: !36, line: 262, baseType: !141, size: 64, align: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !138, file: !36, line: 263, baseType: !141, size: 64, align: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !138, file: !36, line: 264, baseType: !141, size: 64, align: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !138, file: !36, line: 265, baseType: !150, size: 64, align: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !138, file: !36, line: 266, baseType: !141, size: 64, align: 64, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !138, file: !36, line: 267, baseType: !141, size: 64, align: 64, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !138, file: !36, line: 268, baseType: !141, size: 64, align: 64, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !138, file: !36, line: 269, baseType: !141, size: 64, align: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !138, file: !36, line: 270, baseType: !141, size: 64, align: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !138, file: !36, line: 272, baseType: !141, size: 64, align: 64, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !138, file: !36, line: 273, baseType: !141, size: 64, align: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !138, file: !36, line: 274, baseType: !141, size: 64, align: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !138, file: !36, line: 275, baseType: !141, size: 64, align: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !138, file: !36, line: 277, baseType: !155, size: 64, align: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !42, file: !36, line: 351, baseType: !188, size: 64, align: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !36, line: 292, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 280, size: 640, align: 64, elements: !191)
!191 = !{!192, !197, !198, !203, !204, !205, !210, !211, !216, !217}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !190, file: !36, line: 281, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !36, line: 169, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!8, !34}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !190, file: !36, line: 282, baseType: !141, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !190, file: !36, line: 283, baseType: !199, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !36, line: 170, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!34, !34, !8}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !190, file: !36, line: 284, baseType: !199, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !190, file: !36, line: 285, baseType: !6, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !190, file: !36, line: 286, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !36, line: 172, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!15, !34, !8, !34}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !190, file: !36, line: 287, baseType: !6, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !190, file: !36, line: 288, baseType: !212, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !36, line: 231, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!15, !34, !34}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !190, file: !36, line: 290, baseType: !141, size: 64, align: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !190, file: !36, line: 291, baseType: !199, size: 64, align: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !42, file: !36, line: 352, baseType: !219, size: 64, align: 64, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !36, line: 298, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 294, size: 192, align: 64, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !221, file: !36, line: 295, baseType: !193, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !221, file: !36, line: 296, baseType: !141, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !221, file: !36, line: 297, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !36, line: 174, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!15, !34, !34, !34}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !42, file: !36, line: 356, baseType: !231, size: 64, align: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !36, line: 321, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !34}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !9, line: 186, baseType: !8)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !42, file: !36, line: 357, baseType: !150, size: 64, align: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !42, file: !36, line: 358, baseType: !131, size: 64, align: 64, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !42, file: !36, line: 359, baseType: !239, size: 64, align: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !36, line: 317, baseType: !142)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !42, file: !36, line: 360, baseType: !241, size: 64, align: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !36, line: 319, baseType: !227)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !42, file: !36, line: 363, baseType: !243, size: 64, align: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !36, line: 304, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 301, size: 128, align: 64, elements: !246)
!246 = !{!247, !268}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !245, file: !36, line: 302, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !36, line: 193, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!15, !34, !252, !15}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !36, line: 191, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !36, line: 178, size: 640, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !265, !266, !267}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !36, line: 179, baseType: !6, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !254, file: !36, line: 180, baseType: !34, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !36, line: 181, baseType: !8, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !254, file: !36, line: 182, baseType: !8, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !254, file: !36, line: 184, baseType: !15, size: 32, align: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !254, file: !36, line: 185, baseType: !15, size: 32, align: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !254, file: !36, line: 186, baseType: !4, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !254, file: !36, line: 187, baseType: !264, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !254, file: !36, line: 188, baseType: !264, size: 64, align: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !254, file: !36, line: 189, baseType: !264, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !254, file: !36, line: 190, baseType: !6, size: 64, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !245, file: !36, line: 303, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !36, line: 194, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !34, !252}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !42, file: !36, line: 366, baseType: !113, size: 64, align: 64, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !42, file: !36, line: 368, baseType: !22, size: 64, align: 64, offset: 1408)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !42, file: !36, line: 372, baseType: !276, size: 64, align: 64, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !36, line: 233, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!15, !34, !280, !6}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !36, line: 232, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!15, !34, !6}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !42, file: !36, line: 375, baseType: !159, size: 64, align: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !42, file: !36, line: 379, baseType: !286, size: 64, align: 64, offset: 1600)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !36, line: 322, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!34, !34, !34, !15}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !42, file: !36, line: 382, baseType: !8, size: 64, align: 64, offset: 1664)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !42, file: !36, line: 385, baseType: !292, size: 64, align: 64, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !36, line: 323, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !42, file: !36, line: 386, baseType: !294, size: 64, align: 64, offset: 1792)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !36, line: 324, baseType: !132)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !42, file: !36, line: 389, baseType: !296, size: 64, align: 64, offset: 1856)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !298, line: 40, size: 256, align: 64, elements: !299)
!298 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!299 = !{!300, !301, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !297, file: !298, line: 41, baseType: !22, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !297, file: !298, line: 42, baseType: !302, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !298, line: 18, baseType: !142)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !297, file: !298, line: 43, baseType: !15, size: 32, align: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !297, file: !298, line: 45, baseType: !22, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !42, file: !36, line: 390, baseType: !306, size: 64, align: 64, offset: 1920)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !36, line: 390, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !42, file: !36, line: 391, baseType: !309, size: 64, align: 64, offset: 1984)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !311, line: 11, size: 320, align: 64, elements: !312)
!311 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!312 = !{!313, !314, !319, !324, !325}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !311, line: 12, baseType: !4, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !310, file: !311, line: 13, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !311, line: 8, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!34, !34, !6}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !310, file: !311, line: 14, baseType: !320, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !311, line: 9, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!15, !34, !34, !6}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !310, file: !311, line: 15, baseType: !4, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !310, file: !311, line: 16, baseType: !6, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !42, file: !36, line: 392, baseType: !41, size: 64, align: 64, offset: 2048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !42, file: !36, line: 393, baseType: !34, size: 64, align: 64, offset: 2112)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !42, file: !36, line: 394, baseType: !329, size: 64, align: 64, offset: 2176)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !36, line: 325, baseType: !151)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !42, file: !36, line: 395, baseType: !331, size: 64, align: 64, offset: 2240)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !36, line: 326, baseType: !227)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !42, file: !36, line: 396, baseType: !8, size: 64, align: 64, offset: 2304)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !42, file: !36, line: 397, baseType: !334, size: 64, align: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !36, line: 327, baseType: !227)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !42, file: !36, line: 398, baseType: !336, size: 64, align: 64, offset: 2432)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !36, line: 329, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!34, !41, !8}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !42, file: !36, line: 399, baseType: !341, size: 64, align: 64, offset: 2496)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !36, line: 328, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!34, !41, !34, !34}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !42, file: !36, line: 400, baseType: !346, size: 64, align: 64, offset: 2560)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !36, line: 307, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !6}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !42, file: !36, line: 401, baseType: !159, size: 64, align: 64, offset: 2624)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !42, file: !36, line: 402, baseType: !34, size: 64, align: 64, offset: 2688)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !42, file: !36, line: 403, baseType: !34, size: 64, align: 64, offset: 2752)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !42, file: !36, line: 404, baseType: !34, size: 64, align: 64, offset: 2816)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !42, file: !36, line: 405, baseType: !34, size: 64, align: 64, offset: 2880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !42, file: !36, line: 406, baseType: !34, size: 64, align: 64, offset: 2944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !42, file: !36, line: 407, baseType: !54, size: 64, align: 64, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !42, file: !36, line: 410, baseType: !358, size: 32, align: 32, offset: 3072)
!358 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !42, file: !36, line: 412, baseType: !54, size: 64, align: 64, offset: 3136)
!360 = !{!361, !362, !363, !364, !365, !366}
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !31, file: !18, line: 337, type: !22)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "endptr", arg: 2, scope: !31, file: !18, line: 338, type: !24)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "overflow_exception", arg: 3, scope: !31, file: !18, line: 339, type: !34)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !31, file: !18, line: 341, type: !21)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !31, file: !18, line: 341, type: !21)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fail_pos", scope: !31, file: !18, line: 342, type: !4)
!367 = !DISubprogram(name: "PyOS_double_to_string", scope: !18, file: !18, line: 1173, type: !368, isLocal: false, isDefinition: true, scopeLine: 1178, flags: DIFlagPrototyped, isOptimized: true, function: i8* (double, i8, i32, i32, i32*)* @PyOS_double_to_string, variables: !371)
!368 = !DISubroutineType(types: !369)
!369 = !{!4, !21, !5, !15, !15, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!371 = !{!372, !373, !374, !375, !376, !377, !378}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val", arg: 1, scope: !367, file: !18, line: 1173, type: !21)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_code", arg: 2, scope: !367, file: !18, line: 1174, type: !5)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "precision", arg: 3, scope: !367, file: !18, line: 1175, type: !15)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !367, file: !18, line: 1176, type: !15)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 5, scope: !367, file: !18, line: 1177, type: !370)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "float_strings", scope: !367, file: !18, line: 1179, type: !24)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !367, file: !18, line: 1180, type: !15)
!379 = !DISubprogram(name: "case_insensitive_match", scope: !18, file: !18, line: 10, type: !380, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @case_insensitive_match, variables: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{!15, !22, !22}
!382 = !{!383, !384}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !379, file: !18, line: 10, type: !22)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 2, scope: !379, file: !18, line: 10, type: !22)
!385 = !DISubprogram(name: "_PyOS_ascii_strtod", scope: !18, file: !18, line: 131, type: !19, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i8**)* @_PyOS_ascii_strtod, variables: !386)
!386 = !{!387, !388, !389, !390, !391}
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nptr", arg: 1, scope: !385, file: !18, line: 131, type: !22)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "endptr", arg: 2, scope: !385, file: !18, line: 131, type: !24)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !385, file: !18, line: 133, type: !21)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_387controlword", scope: !385, file: !18, line: 134, type: !94)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_387controlword", scope: !385, file: !18, line: 134, type: !94)
!392 = !DISubprogram(name: "format_float_short", scope: !18, file: !18, line: 925, type: !393, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, function: i8* (double, i8, i32, i32, i32, i32, i32, i8**, i32*)* @format_float_short, variables: !395)
!393 = !DISubroutineType(types: !394)
