; ModuleID = 'programs_new/Python-new/pytime.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !359)
!1 = !DIFile(filename: "pytime.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!7 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!8 = !{!9, !14, !15, !352, !353, !98, !13}
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !10, line: 75, baseType: !11)
!10 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 148, baseType: !13)
!12 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !17, line: 109, baseType: !18)
!17 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !17, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !26}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !17, line: 107, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !22, line: 177, baseType: !23)
!22 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 102, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !12, line: 181, baseType: !13)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !17, line: 108, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !17, line: 334, size: 3200, align: 64, elements: !29)
!29 = !{!30, !36, !40, !41, !42, !47, !111, !116, !121, !122, !127, !179, !210, !222, !228, !229, !230, !232, !234, !265, !266, !267, !276, !277, !282, !283, !285, !287, !297, !300, !318, !319, !320, !322, !324, !325, !327, !332, !337, !342, !343, !344, !345, !346, !347, !348, !349, !351}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !17, line: 335, baseType: !31, size: 192, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !17, line: 114, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 111, size: 192, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !17, line: 112, baseType: !16, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !32, file: !17, line: 113, baseType: !21, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !28, file: !17, line: 336, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !28, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !28, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !28, file: !17, line: 341, baseType: !43, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !17, line: 308, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !15}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !28, file: !17, line: 342, baseType: !48, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !17, line: 314, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !15, !53, !52}
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 48, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 246, size: 1728, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!57 = !{!58, !59, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !84, !86, !88, !92, !95, !97, !99, !100, !101, !102, !106, !107}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 247, baseType: !52, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 252, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 253, baseType: !60, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 254, baseType: !60, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 255, baseType: !60, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 256, baseType: !60, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 257, baseType: !60, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 258, baseType: !60, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 259, baseType: !60, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 261, baseType: !60, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 262, baseType: !60, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 263, baseType: !60, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 265, baseType: !72, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 161, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !56, line: 162, baseType: !72, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !56, line: 163, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !56, line: 167, baseType: !52, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 267, baseType: !77, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 269, baseType: !52, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 273, baseType: !52, size: 32, align: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 275, baseType: !83, size: 64, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 140, baseType: !13)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 279, baseType: !85, size: 16, align: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 280, baseType: !87, size: 8, align: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 281, baseType: !89, size: 8, align: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 285, baseType: !93, size: 64, align: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 155, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 294, baseType: !96, size: 64, align: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !12, line: 141, baseType: !13)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 303, baseType: !98, size: 64, align: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 304, baseType: !98, size: 64, align: 64, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !55, file: !56, line: 305, baseType: !98, size: 64, align: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !55, file: !56, line: 306, baseType: !98, size: 64, align: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 307, baseType: !103, size: 64, align: 64, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 62, baseType: !105)
!104 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!105 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 309, baseType: !52, size: 32, align: 32, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 311, baseType: !108, size: 160, align: 8, offset: 1568)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 20)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !28, file: !17, line: 343, baseType: !112, size: 64, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !17, line: 316, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!15, !15, !60}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !28, file: !17, line: 344, baseType: !117, size: 64, align: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !17, line: 318, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!52, !15, !60, !15}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !28, file: !17, line: 345, baseType: !98, size: 64, align: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !28, file: !17, line: 346, baseType: !123, size: 64, align: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !17, line: 320, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!15, !15}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !28, file: !17, line: 350, baseType: !128, size: 64, align: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !17, line: 278, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 236, size: 2176, align: 64, elements: !131)
!131 = !{!132, !137, !138, !139, !140, !141, !146, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !130, file: !17, line: 241, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !17, line: 166, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!15, !15, !15}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !130, file: !17, line: 242, baseType: !133, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !130, file: !17, line: 243, baseType: !133, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !130, file: !17, line: 244, baseType: !133, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !130, file: !17, line: 245, baseType: !133, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !130, file: !17, line: 246, baseType: !142, size: 64, align: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !17, line: 167, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!15, !15, !15, !15}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !130, file: !17, line: 247, baseType: !147, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !17, line: 165, baseType: !124)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !130, file: !17, line: 248, baseType: !147, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !130, file: !17, line: 249, baseType: !147, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !130, file: !17, line: 250, baseType: !151, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !17, line: 168, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!52, !15}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !130, file: !17, line: 251, baseType: !147, size: 64, align: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !130, file: !17, line: 252, baseType: !133, size: 64, align: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !130, file: !17, line: 253, baseType: !133, size: 64, align: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !130, file: !17, line: 254, baseType: !133, size: 64, align: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !130, file: !17, line: 255, baseType: !133, size: 64, align: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !130, file: !17, line: 256, baseType: !133, size: 64, align: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !130, file: !17, line: 257, baseType: !147, size: 64, align: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !130, file: !17, line: 258, baseType: !98, size: 64, align: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !130, file: !17, line: 259, baseType: !147, size: 64, align: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !130, file: !17, line: 261, baseType: !133, size: 64, align: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !130, file: !17, line: 262, baseType: !133, size: 64, align: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !130, file: !17, line: 263, baseType: !133, size: 64, align: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !130, file: !17, line: 264, baseType: !133, size: 64, align: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !130, file: !17, line: 265, baseType: !142, size: 64, align: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !130, file: !17, line: 266, baseType: !133, size: 64, align: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !130, file: !17, line: 267, baseType: !133, size: 64, align: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !130, file: !17, line: 268, baseType: !133, size: 64, align: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !130, file: !17, line: 269, baseType: !133, size: 64, align: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !130, file: !17, line: 270, baseType: !133, size: 64, align: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !130, file: !17, line: 272, baseType: !133, size: 64, align: 64, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !130, file: !17, line: 273, baseType: !133, size: 64, align: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !130, file: !17, line: 274, baseType: !133, size: 64, align: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !130, file: !17, line: 275, baseType: !133, size: 64, align: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !130, file: !17, line: 277, baseType: !147, size: 64, align: 64, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !28, file: !17, line: 351, baseType: !180, size: 64, align: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !17, line: 292, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 280, size: 640, align: 64, elements: !183)
!183 = !{!184, !189, !190, !195, !196, !197, !202, !203, !208, !209}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !182, file: !17, line: 281, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !17, line: 169, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!21, !15}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !182, file: !17, line: 282, baseType: !133, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !182, file: !17, line: 283, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !17, line: 170, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!15, !15, !21}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !182, file: !17, line: 284, baseType: !191, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !182, file: !17, line: 285, baseType: !98, size: 64, align: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !182, file: !17, line: 286, baseType: !198, size: 64, align: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !17, line: 172, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!52, !15, !21, !15}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !182, file: !17, line: 287, baseType: !98, size: 64, align: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !182, file: !17, line: 288, baseType: !204, size: 64, align: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !17, line: 231, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!52, !15, !15}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !182, file: !17, line: 290, baseType: !133, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !182, file: !17, line: 291, baseType: !191, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !28, file: !17, line: 352, baseType: !211, size: 64, align: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !17, line: 298, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 294, size: 192, align: 64, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !213, file: !17, line: 295, baseType: !185, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !213, file: !17, line: 296, baseType: !133, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !213, file: !17, line: 297, baseType: !218, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !17, line: 174, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!52, !15, !15, !15}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !28, file: !17, line: 356, baseType: !223, size: 64, align: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !17, line: 321, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !15}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !22, line: 186, baseType: !21)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !28, file: !17, line: 357, baseType: !142, size: 64, align: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !28, file: !17, line: 358, baseType: !123, size: 64, align: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !28, file: !17, line: 359, baseType: !231, size: 64, align: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !17, line: 317, baseType: !134)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !28, file: !17, line: 360, baseType: !233, size: 64, align: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !17, line: 319, baseType: !219)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !28, file: !17, line: 363, baseType: !235, size: 64, align: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !17, line: 304, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 301, size: 128, align: 64, elements: !238)
!238 = !{!239, !260}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !237, file: !17, line: 302, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !17, line: 193, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!52, !15, !244, !52}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !17, line: 191, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !17, line: 178, size: 640, align: 64, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !257, !258, !259}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !246, file: !17, line: 179, baseType: !98, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !246, file: !17, line: 180, baseType: !15, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !246, file: !17, line: 181, baseType: !21, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !246, file: !17, line: 182, baseType: !21, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !246, file: !17, line: 184, baseType: !52, size: 32, align: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !246, file: !17, line: 185, baseType: !52, size: 32, align: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !246, file: !17, line: 186, baseType: !60, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !246, file: !17, line: 187, baseType: !256, size: 64, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !246, file: !17, line: 188, baseType: !256, size: 64, align: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !246, file: !17, line: 189, baseType: !256, size: 64, align: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !246, file: !17, line: 190, baseType: !98, size: 64, align: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !237, file: !17, line: 303, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !17, line: 194, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !15, !244}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !28, file: !17, line: 366, baseType: !105, size: 64, align: 64, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !28, file: !17, line: 368, baseType: !37, size: 64, align: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !28, file: !17, line: 372, baseType: !268, size: 64, align: 64, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !17, line: 233, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!52, !15, !272, !98}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !17, line: 232, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!52, !15, !98}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !28, file: !17, line: 375, baseType: !151, size: 64, align: 64, offset: 1536)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !28, file: !17, line: 379, baseType: !278, size: 64, align: 64, offset: 1600)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !17, line: 322, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!15, !15, !15, !52}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !28, file: !17, line: 382, baseType: !21, size: 64, align: 64, offset: 1664)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !28, file: !17, line: 385, baseType: !284, size: 64, align: 64, offset: 1728)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !17, line: 323, baseType: !124)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !28, file: !17, line: 386, baseType: !286, size: 64, align: 64, offset: 1792)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !17, line: 324, baseType: !124)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !28, file: !17, line: 389, baseType: !288, size: 64, align: 64, offset: 1856)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !290, line: 40, size: 256, align: 64, elements: !291)
!290 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!291 = !{!292, !293, !295, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !289, file: !290, line: 41, baseType: !37, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !289, file: !290, line: 42, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !290, line: 18, baseType: !134)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !289, file: !290, line: 43, baseType: !52, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !289, file: !290, line: 45, baseType: !37, size: 64, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !28, file: !17, line: 390, baseType: !298, size: 64, align: 64, offset: 1920)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !17, line: 390, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !28, file: !17, line: 391, baseType: !301, size: 64, align: 64, offset: 1984)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !303, line: 11, size: 320, align: 64, elements: !304)
!303 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!304 = !{!305, !306, !311, !316, !317}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !303, line: 12, baseType: !60, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !302, file: !303, line: 13, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !303, line: 8, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!15, !15, !98}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !302, file: !303, line: 14, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !303, line: 9, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!52, !15, !15, !98}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !302, file: !303, line: 15, baseType: !60, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !302, file: !303, line: 16, baseType: !98, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !28, file: !17, line: 392, baseType: !27, size: 64, align: 64, offset: 2048)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !28, file: !17, line: 393, baseType: !15, size: 64, align: 64, offset: 2112)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !28, file: !17, line: 394, baseType: !321, size: 64, align: 64, offset: 2176)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !17, line: 325, baseType: !143)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !28, file: !17, line: 395, baseType: !323, size: 64, align: 64, offset: 2240)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !17, line: 326, baseType: !219)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !28, file: !17, line: 396, baseType: !21, size: 64, align: 64, offset: 2304)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !28, file: !17, line: 397, baseType: !326, size: 64, align: 64, offset: 2368)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !17, line: 327, baseType: !219)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !28, file: !17, line: 398, baseType: !328, size: 64, align: 64, offset: 2432)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !17, line: 329, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!15, !27, !21}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !28, file: !17, line: 399, baseType: !333, size: 64, align: 64, offset: 2496)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !17, line: 328, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!15, !27, !15, !15}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !28, file: !17, line: 400, baseType: !338, size: 64, align: 64, offset: 2560)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !17, line: 307, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !98}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !28, file: !17, line: 401, baseType: !151, size: 64, align: 64, offset: 2624)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !28, file: !17, line: 402, baseType: !15, size: 64, align: 64, offset: 2688)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !28, file: !17, line: 403, baseType: !15, size: 64, align: 64, offset: 2752)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !28, file: !17, line: 404, baseType: !15, size: 64, align: 64, offset: 2816)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !28, file: !17, line: 405, baseType: !15, size: 64, align: 64, offset: 2880)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !28, file: !17, line: 406, baseType: !15, size: 64, align: 64, offset: 2944)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !28, file: !17, line: 407, baseType: !43, size: 64, align: 64, offset: 3008)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !28, file: !17, line: 410, baseType: !350, size: 32, align: 32, offset: 3072)
!350 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !28, file: !17, line: 412, baseType: !43, size: 64, align: 64, offset: 3136)
!352 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !355, line: 56, size: 64, align: 32, elements: !356)
!355 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !354, file: !355, line: 58, baseType: !52, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !354, file: !355, line: 59, baseType: !52, size: 32, align: 32, offset: 32)
!359 = !{!360, !374, !388, !394, !399, !413, !422, !428, !432, !447, !448}
!360 = !DISubprogram(name: "_PyTime_gettimeofday", scope: !361, file: !361, line: 105, type: !362, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.timeval*)* @_PyTime_gettimeofday, variables: !372)
!361 = !DIFile(filename: "Python/pytime.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DISubroutineType(types: !363)
!363 = !{null, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyTime_timeval", file: !4, line: 17, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !367, line: 30, size: 128, align: 64, elements: !368)
!367 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !366, file: !367, line: 32, baseType: !11, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !366, file: !367, line: 33, baseType: !371, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !12, line: 150, baseType: !13)
!372 = !{!373}
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !360, file: !361, line: 105, type: !364)
!374 = !DISubprogram(name: "_PyTime_gettimeofday_info", scope: !361, file: !361, line: 111, type: !375, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.timeval*, %struct._Py_clock_info_t*)* @_PyTime_gettimeofday_info, variables: !385)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !364, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_clock_info_t", file: !4, line: 31, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 26, size: 192, align: 64, elements: !380)
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !379, file: !4, line: 27, baseType: !37, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "monotonic", scope: !379, file: !4, line: 28, baseType: !52, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "adjustable", scope: !379, file: !4, line: 29, baseType: !52, size: 32, align: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !379, file: !4, line: 30, baseType: !352, size: 64, align: 64, offset: 128)
!385 = !{!386, !387}
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !374, file: !361, line: 111, type: !364)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 2, scope: !374, file: !361, line: 111, type: !377)
!388 = !DISubprogram(name: "_PyLong_AsTime_t", scope: !361, file: !361, line: 124, type: !389, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @_PyLong_AsTime_t, variables: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!9, !15}
!391 = !{!392, !393}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !388, file: !361, line: 124, type: !15)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !388, file: !361, line: 127, type: !14)
!394 = !DISubprogram(name: "_PyLong_FromTime_t", scope: !361, file: !361, line: 143, type: !395, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @_PyLong_FromTime_t, variables: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!15, !9}
!397 = !{!398}
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t", arg: 1, scope: !394, file: !361, line: 143, type: !9)
!399 = !DISubprogram(name: "_PyTime_ObjectToTime_t", scope: !361, file: !361, line: 204, type: !400, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, i32)* @_PyTime_ObjectToTime_t, variables: !404)
!400 = !DISubroutineType(types: !401)
!401 = !{!52, !15, !402, !403}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyTime_round_t", file: !4, line: 62, baseType: !3)
!404 = !{!405, !406, !407, !408, !411, !412}
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !399, file: !361, line: 204, type: !15)
!406 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sec", arg: 2, scope: !399, file: !361, line: 204, type: !402)
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "round", arg: 3, scope: !399, file: !361, line: 204, type: !403)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !409, file: !361, line: 207, type: !352)
!409 = distinct !DILexicalBlock(scope: !410, file: !361, line: 206, column: 129)
!410 = distinct !DILexicalBlock(scope: !399, file: !361, line: 206, column: 9)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intpart", scope: !409, file: !361, line: 207, type: !352)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !409, file: !361, line: 207, type: !352)
!413 = !DISubprogram(name: "_PyTime_ObjectToTimespec", scope: !361, file: !361, line: 235, type: !414, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, i64*, i32)* @_PyTime_ObjectToTimespec, variables: !417)
!414 = !DISubroutineType(types: !415)
!415 = !{!52, !15, !402, !416, !403}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!417 = !{!418, !419, !420, !421}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !413, file: !361, line: 235, type: !15)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sec", arg: 2, scope: !413, file: !361, line: 235, type: !402)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsec", arg: 3, scope: !413, file: !361, line: 235, type: !416)
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "round", arg: 4, scope: !413, file: !361, line: 236, type: !403)
!422 = !DISubprogram(name: "_PyTime_ObjectToTimeval", scope: !361, file: !361, line: 242, type: !414, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, i64*, i32)* @_PyTime_ObjectToTimeval, variables: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !422, file: !361, line: 242, type: !15)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sec", arg: 2, scope: !422, file: !361, line: 242, type: !402)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "usec", arg: 3, scope: !422, file: !361, line: 242, type: !416)
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "round", arg: 4, scope: !422, file: !361, line: 243, type: !403)
!428 = !DISubprogram(name: "_PyTime_Init", scope: !361, file: !361, line: 249, type: !429, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyTime_Init, variables: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{null}
!431 = !{}
!432 = !DISubprogram(name: "pygettimeofday", scope: !361, file: !361, line: 22, type: !375, isLocal: true, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.timeval*, %struct._Py_clock_info_t*)* @pygettimeofday, variables: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !432, file: !361, line: 22, type: !364)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 2, scope: !432, file: !361, line: 22, type: !377)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !432, file: !361, line: 60, type: !52)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !438, file: !361, line: 79, type: !439)
!438 = distinct !DILexicalBlock(scope: !432, file: !361, line: 78, column: 5)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeb", file: !440, line: 31, size: 128, align: 64, elements: !441)
!440 = !DIFile(filename: "/usr/include/sys/timeb.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!441 = !{!442, !443, !444, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !439, file: !440, line: 33, baseType: !9, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "millitm", scope: !439, file: !440, line: 34, baseType: !85, size: 16, align: 16, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "timezone", scope: !439, file: !440, line: 35, baseType: !445, size: 16, align: 16, offset: 80)
!445 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dstflag", scope: !439, file: !440, line: 36, baseType: !445, size: 16, align: 16, offset: 96)
!447 = !DISubprogram(name: "error_time_t_overflow", scope: !361, file: !361, line: 117, type: !429, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @error_time_t_overflow, variables: !431)
!448 = !DISubprogram(name: "_PyTime_ObjectToDenominator", scope: !361, file: !361, line: 154, type: !449, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, i64*, double, i32)* @_PyTime_ObjectToDenominator, variables: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!52, !15, !402, !416, !352, !403}
!451 = !{!452, !453, !454, !455, !456, !457, !460, !461, !462}
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !448, file: !361, line: 154, type: !15)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sec", arg: 2, scope: !448, file: !361, line: 154, type: !402)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "numerator", arg: 3, scope: !448, file: !361, line: 154, type: !416)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "denominator", arg: 4, scope: !448, file: !361, line: 155, type: !352)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "round", arg: 5, scope: !448, file: !361, line: 155, type: !403)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !458, file: !361, line: 159, type: !352)
!458 = distinct !DILexicalBlock(scope: !459, file: !361, line: 158, column: 129)
!459 = distinct !DILexicalBlock(scope: !448, file: !361, line: 158, column: 9)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intpart", scope: !458, file: !361, line: 159, type: !352)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !458, file: !361, line: 159, type: !352)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "floatpart", scope: !458, file: !361, line: 161, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !352)
!464 = !{i32 2, !"Dwarf Version", i32 4}
!465 = !{i32 2, !"Debug Info Version", i32 3}
!466 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!467 = !{!468, !468, i64 0}
!468 = !{!"any pointer", !469, i64 0}
!469 = !{!"omnipotent char", !470, i64 0}
!470 = !{!"Simple C/C++ TBAA"}
!471 = !DIExpression()
!472 = !DILocation(line: 105, column: 39, scope: !360)
!473 = !DILocation(line: 107, column: 20, scope: !360)
!474 = !DILocation(line: 107, column: 5, scope: !360)
!475 = !DILocation(line: 108, column: 1, scope: !360)
!476 = !DILocation(line: 22, column: 33, scope: !432)
!477 = !DILocation(line: 22, column: 55, scope: !432)
!478 = !DILocation(line: 60, column: 5, scope: !432)
!479 = !DILocation(line: 60, column: 9, scope: !432)
!480 = !DILocation(line: 64, column: 24, scope: !432)
!481 = !DILocation(line: 64, column: 11, scope: !432)
!482 = !DILocation(line: 64, column: 9, scope: !432)
!483 = !{!484, !484, i64 0}
!484 = !{!"int", !469, i64 0}
!485 = !DILocation(line: 66, column: 9, scope: !486)
!486 = distinct !DILexicalBlock(scope: !432, file: !361, line: 66, column: 9)
!487 = !DILocation(line: 66, column: 13, scope: !486)
!488 = !DILocation(line: 66, column: 9, scope: !432)
!489 = !DILocation(line: 67, column: 13, scope: !490)
!490 = distinct !DILexicalBlock(scope: !491, file: !361, line: 67, column: 13)
!491 = distinct !DILexicalBlock(scope: !486, file: !361, line: 66, column: 19)
!492 = !DILocation(line: 67, column: 13, scope: !491)
!493 = !DILocation(line: 68, column: 13, scope: !494)
!494 = distinct !DILexicalBlock(scope: !490, file: !361, line: 67, column: 19)
!495 = !DILocation(line: 68, column: 19, scope: !494)
!496 = !DILocation(line: 68, column: 34, scope: !494)
!497 = !{!498, !468, i64 0}
