; ModuleID = 'programs_new/Python-new/readline.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !373, globals: !810)
!1 = !DIFile(filename: "readline.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 190, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!7 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!8 = !{!9, !10, !16, !28, !359, !40, !365, !55, !105, !367, !63, !369}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "readlinestate", file: !12, line: 87, baseType: !13)
!12 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/readline.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 80, size: 384, align: 64, elements: !14)
!14 = !{!15, !354, !355, !356, !357, !358}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "completion_display_matches_hook", scope: !13, file: !12, line: 81, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !50, !113, !118, !123, !124, !129, !181, !212, !224, !230, !231, !232, !234, !236, !267, !268, !269, !278, !279, !284, !285, !287, !289, !299, !302, !320, !321, !322, !324, !326, !327, !329, !334, !339, !344, !345, !346, !347, !348, !349, !350, !351, !353}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !16}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !16, !56, !55}
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 246, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!60 = !{!61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !87, !89, !91, !95, !98, !100, !101, !102, !103, !104, !108, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 247, baseType: !55, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 252, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 253, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 254, baseType: !63, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 255, baseType: !63, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 256, baseType: !63, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 257, baseType: !63, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 258, baseType: !63, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 259, baseType: !63, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 261, baseType: !63, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 262, baseType: !63, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 263, baseType: !63, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 265, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 161, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !59, line: 162, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !59, line: 163, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !59, line: 167, baseType: !55, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 267, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 269, baseType: !55, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 273, baseType: !55, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 275, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 279, baseType: !88, size: 16, align: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 280, baseType: !90, size: 8, align: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 281, baseType: !92, size: 8, align: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 285, baseType: !96, size: 64, align: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 155, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 294, baseType: !99, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 303, baseType: !9, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 304, baseType: !9, size: 64, align: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 305, baseType: !9, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 306, baseType: !9, size: 64, align: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 307, baseType: !105, size: 64, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 309, baseType: !55, size: 32, align: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 311, baseType: !110, size: 160, align: 8, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !114, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!16, !16, !63}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !119, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!55, !16, !63, !16}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !9, size: 64, align: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !125, size: 64, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!16, !16}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !130, size: 64, align: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !133)
!133 = !{!134, !139, !140, !141, !142, !143, !148, !150, !151, !152, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !132, file: !18, line: 241, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!16, !16, !16}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !132, file: !18, line: 242, baseType: !135, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !132, file: !18, line: 243, baseType: !135, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !132, file: !18, line: 244, baseType: !135, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !132, file: !18, line: 245, baseType: !135, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !132, file: !18, line: 246, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!16, !16, !16, !16}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !132, file: !18, line: 247, baseType: !149, size: 64, align: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !126)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !132, file: !18, line: 248, baseType: !149, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !132, file: !18, line: 249, baseType: !149, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !132, file: !18, line: 250, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!55, !16}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !132, file: !18, line: 251, baseType: !149, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !132, file: !18, line: 252, baseType: !135, size: 64, align: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !132, file: !18, line: 253, baseType: !135, size: 64, align: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !132, file: !18, line: 254, baseType: !135, size: 64, align: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !132, file: !18, line: 255, baseType: !135, size: 64, align: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !132, file: !18, line: 256, baseType: !135, size: 64, align: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !132, file: !18, line: 257, baseType: !149, size: 64, align: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !132, file: !18, line: 258, baseType: !9, size: 64, align: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !132, file: !18, line: 259, baseType: !149, size: 64, align: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !132, file: !18, line: 261, baseType: !135, size: 64, align: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !132, file: !18, line: 262, baseType: !135, size: 64, align: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !132, file: !18, line: 263, baseType: !135, size: 64, align: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !132, file: !18, line: 264, baseType: !135, size: 64, align: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !132, file: !18, line: 265, baseType: !144, size: 64, align: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !132, file: !18, line: 266, baseType: !135, size: 64, align: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !132, file: !18, line: 267, baseType: !135, size: 64, align: 64, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !132, file: !18, line: 268, baseType: !135, size: 64, align: 64, offset: 1664)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !132, file: !18, line: 269, baseType: !135, size: 64, align: 64, offset: 1728)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !132, file: !18, line: 270, baseType: !135, size: 64, align: 64, offset: 1792)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !132, file: !18, line: 272, baseType: !135, size: 64, align: 64, offset: 1856)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !132, file: !18, line: 273, baseType: !135, size: 64, align: 64, offset: 1920)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !132, file: !18, line: 274, baseType: !135, size: 64, align: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !132, file: !18, line: 275, baseType: !135, size: 64, align: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !132, file: !18, line: 277, baseType: !149, size: 64, align: 64, offset: 2112)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !182, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !18, line: 281, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!22, !16}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !18, line: 282, baseType: !135, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !18, line: 283, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!16, !16, !22}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !18, line: 284, baseType: !193, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !18, line: 285, baseType: !9, size: 64, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !18, line: 286, baseType: !200, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!55, !16, !22, !16}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !18, line: 287, baseType: !9, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !18, line: 288, baseType: !206, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!55, !16, !16}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !18, line: 290, baseType: !135, size: 64, align: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !18, line: 291, baseType: !193, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !213, size: 64, align: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !215)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !18, line: 295, baseType: !187, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !18, line: 296, baseType: !135, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !18, line: 297, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!55, !16, !16, !16}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !225, size: 64, align: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !16}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !144, size: 64, align: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !125, size: 64, align: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !233, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !136)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !235, size: 64, align: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !237, size: 64, align: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !240)
!240 = !{!241, !262}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !18, line: 302, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!55, !16, !246, !55}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !259, !260, !261}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !248, file: !18, line: 179, baseType: !9, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !248, file: !18, line: 180, baseType: !16, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !248, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !248, file: !18, line: 184, baseType: !55, size: 32, align: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !248, file: !18, line: 185, baseType: !55, size: 32, align: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !248, file: !18, line: 186, baseType: !63, size: 64, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !248, file: !18, line: 187, baseType: !258, size: 64, align: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !248, file: !18, line: 188, baseType: !258, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !248, file: !18, line: 189, baseType: !258, size: 64, align: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !248, file: !18, line: 190, baseType: !9, size: 64, align: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !18, line: 303, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !16, !246}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !107, size: 64, align: 64, offset: 1344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !270, size: 64, align: 64, offset: 1472)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!55, !16, !274, !9}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!55, !16, !9}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !153, size: 64, align: 64, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !280, size: 64, align: 64, offset: 1600)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!16, !16, !16, !55}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !286, size: 64, align: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !126)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !288, size: 64, align: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !126)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !290, size: 64, align: 64, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !292, line: 40, size: 256, align: 64, elements: !293)
!292 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!293 = !{!294, !295, !297, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !291, file: !292, line: 41, baseType: !40, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !291, file: !292, line: 42, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !292, line: 18, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !291, file: !292, line: 43, baseType: !55, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !291, file: !292, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !300, size: 64, align: 64, offset: 1920)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !18, line: 390, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !303, size: 64, align: 64, offset: 1984)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, align: 64, elements: !306)
!305 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!306 = !{!307, !308, !313, !318, !319}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 12, baseType: !63, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !304, file: !305, line: 13, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!16, !16, !9}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !304, file: !305, line: 14, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!55, !16, !16, !9}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 15, baseType: !63, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !304, file: !305, line: 16, baseType: !9, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !16, size: 64, align: 64, offset: 2112)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !323, size: 64, align: 64, offset: 2176)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !145)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !325, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !221)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !328, size: 64, align: 64, offset: 2368)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !221)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !330, size: 64, align: 64, offset: 2432)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!16, !30, !22}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !335, size: 64, align: 64, offset: 2496)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!16, !30, !16, !16}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !340, size: 64, align: 64, offset: 2560)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !9}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !153, size: 64, align: 64, offset: 2624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !16, size: 64, align: 64, offset: 2688)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !16, size: 64, align: 64, offset: 2752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !16, size: 64, align: 64, offset: 2816)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !16, size: 64, align: 64, offset: 2880)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !16, size: 64, align: 64, offset: 2944)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !352, size: 32, align: 32, offset: 3072)
!352 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "startup_hook", scope: !13, file: !12, line: 82, baseType: !16, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pre_input_hook", scope: !13, file: !12, line: 83, baseType: !16, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "completer", scope: !13, file: !12, line: 84, baseType: !16, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "begidx", scope: !13, file: !12, line: 85, baseType: !16, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "endidx", scope: !13, file: !12, line: 86, baseType: !16, size: 64, align: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "rl_compdisp_func_t", file: !361, line: 58, baseType: !362)
!361 = !DIFile(filename: "/usr/include/readline/rltypedefs.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DISubroutineType(types: !363)
!363 = !{null, !364, !55, !55}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !366, line: 54, baseType: !28)
!366 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "rl_compentry_func_t", file: !361, line: 50, baseType: !371)
!371 = !DISubroutineType(types: !372)
!372 = !{!63, !40, !55}
!373 = !{!374, !380, !386, !390, !395, !399, !409, !419, !432, !447, !451, !467, !472, !476, !480, !509, !513, !517, !521, !525, !530, !535, !541, !547, !554, !558, !563, !594, !598, !602, !606, !636, !676, !679, !699, !736, !741, !750, !754, !768, !772, !791}
!374 = !DISubprogram(name: "PyInit_readline", scope: !12, file: !12, line: 1250, type: !375, isLocal: false, isDefinition: true, scopeLine: 1251, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_readline, variables: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{!16}
!377 = !{!378, !379}
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !374, file: !12, line: 1252, type: !16)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod_state", scope: !374, file: !12, line: 1253, type: !10)
!380 = !DISubprogram(name: "parse_and_bind", scope: !12, file: !12, line: 132, type: !137, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @parse_and_bind, variables: !381)
!381 = !{!382, !383, !384, !385}
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !380, file: !12, line: 132, type: !16)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !380, file: !12, line: 132, type: !16)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !380, file: !12, line: 134, type: !63)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !380, file: !12, line: 134, type: !63)
!386 = !DISubprogram(name: "get_line_buffer", scope: !12, file: !12, line: 678, type: !137, isLocal: true, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_line_buffer, variables: !387)
!387 = !{!388, !389}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !386, file: !12, line: 678, type: !16)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !386, file: !12, line: 678, type: !16)
!390 = !DISubprogram(name: "insert_text", scope: !12, file: !12, line: 708, type: !137, isLocal: true, isDefinition: true, scopeLine: 709, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @insert_text, variables: !391)
!391 = !{!392, !393, !394}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !390, file: !12, line: 708, type: !16)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !390, file: !12, line: 708, type: !16)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !390, file: !12, line: 710, type: !63)
!395 = !DISubprogram(name: "redisplay", scope: !12, file: !12, line: 725, type: !137, isLocal: true, isDefinition: true, scopeLine: 726, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @redisplay, variables: !396)
!396 = !{!397, !398}
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !395, file: !12, line: 725, type: !16)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !395, file: !12, line: 725, type: !16)
!399 = !DISubprogram(name: "read_init_file", scope: !12, file: !12, line: 156, type: !137, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @read_init_file, variables: !400)
!400 = !{!401, !402, !403, !404, !405}
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !399, file: !12, line: 156, type: !16)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !399, file: !12, line: 156, type: !16)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename_obj", scope: !399, file: !12, line: 158, type: !16)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename_bytes", scope: !399, file: !12, line: 158, type: !16)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !406, file: !12, line: 165, type: !16)
!406 = distinct !DILexicalBlock(scope: !407, file: !12, line: 165, column: 12)
!407 = distinct !DILexicalBlock(scope: !408, file: !12, line: 161, column: 44)
!408 = distinct !DILexicalBlock(scope: !399, file: !12, line: 161, column: 9)
!409 = !DISubprogram(name: "read_history_file", scope: !12, file: !12, line: 182, type: !137, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @read_history_file, variables: !410)
!410 = !{!411, !412, !413, !414, !415}
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !409, file: !12, line: 182, type: !16)
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !409, file: !12, line: 182, type: !16)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename_obj", scope: !409, file: !12, line: 184, type: !16)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename_bytes", scope: !409, file: !12, line: 184, type: !16)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !416, file: !12, line: 191, type: !16)
!416 = distinct !DILexicalBlock(scope: !417, file: !12, line: 191, column: 12)
!417 = distinct !DILexicalBlock(scope: !418, file: !12, line: 187, column: 44)
!418 = distinct !DILexicalBlock(scope: !409, file: !12, line: 187, column: 9)
!419 = !DISubprogram(name: "write_history_file", scope: !12, file: !12, line: 209, type: !137, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @write_history_file, variables: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !429}
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !419, file: !12, line: 209, type: !16)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !419, file: !12, line: 209, type: !16)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename_obj", scope: !419, file: !12, line: 211, type: !16)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename_bytes", scope: !419, file: !12, line: 211, type: !16)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !419, file: !12, line: 212, type: !63)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !419, file: !12, line: 213, type: !55)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !428, file: !12, line: 227, type: !16)
!428 = distinct !DILexicalBlock(scope: !419, file: !12, line: 227, column: 8)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !430, file: !12, line: 227, type: !16)
!430 = distinct !DILexicalBlock(scope: !431, file: !12, line: 227, column: 106)
!431 = distinct !DILexicalBlock(scope: !428, file: !12, line: 227, column: 72)
!432 = !DISubprogram(name: "get_history_item", scope: !12, file: !12, line: 622, type: !137, isLocal: true, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_history_item, variables: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !432, file: !12, line: 622, type: !16)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !432, file: !12, line: 622, type: !16)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !432, file: !12, line: 624, type: !55)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hist_ent", scope: !432, file: !12, line: 625, type: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "HIST_ENTRY", file: !440, line: 50, baseType: !441)
!440 = !DIFile(filename: "/usr/include/readline/history.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_hist_entry", file: !440, line: 46, size: 192, align: 64, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !441, file: !440, line: 47, baseType: !63, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !441, file: !440, line: 48, baseType: !63, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !440, line: 49, baseType: !446, size: 64, align: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "histdata_t", file: !440, line: 40, baseType: !9)
!447 = !DISubprogram(name: "get_current_history_length", scope: !12, file: !12, line: 665, type: !137, isLocal: true, isDefinition: true, scopeLine: 666, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_current_history_length, variables: !448)
!448 = !{!449, !450}
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !447, file: !12, line: 665, type: !16)
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !447, file: !12, line: 665, type: !16)
!451 = !DISubprogram(name: "_py_get_history_length", scope: !12, file: !12, line: 606, type: !452, isLocal: true, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_py_get_history_length, variables: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!55}
!454 = !{!455, !466}
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hist_st", scope: !451, file: !12, line: 608, type: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_STATE", file: !440, line: 62, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "_hist_state", file: !440, line: 56, size: 192, align: 64, elements: !459)
!459 = !{!460, !462, !463, !464, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !458, file: !440, line: 57, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !458, file: !440, line: 58, baseType: !55, size: 32, align: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !458, file: !440, line: 59, baseType: !55, size: 32, align: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !458, file: !440, line: 60, baseType: !55, size: 32, align: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !458, file: !440, line: 61, baseType: !55, size: 32, align: 32, offset: 160)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !451, file: !12, line: 609, type: !55)
!467 = !DISubprogram(name: "set_history_length", scope: !12, file: !12, line: 243, type: !137, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_history_length, variables: !468)
!468 = !{!469, !470, !471}
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !467, file: !12, line: 243, type: !16)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !467, file: !12, line: 243, type: !16)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !467, file: !12, line: 245, type: !55)
!472 = !DISubprogram(name: "get_history_length", scope: !12, file: !12, line: 262, type: !137, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_history_length, variables: !473)
!473 = !{!474, !475}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !472, file: !12, line: 262, type: !16)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !472, file: !12, line: 262, type: !16)
!476 = !DISubprogram(name: "set_completer", scope: !12, file: !12, line: 572, type: !137, isLocal: true, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_completer, variables: !477)
!477 = !{!478, !479}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !476, file: !12, line: 572, type: !16)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !476, file: !12, line: 572, type: !16)
!480 = !DISubprogram(name: "set_hook", scope: !12, file: !12, line: 276, type: !481, isLocal: true, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object**, %struct._object*)* @set_hook, variables: !484)
!481 = !DISubroutineType(types: !482)
!482 = !{!16, !40, !483, !16}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!484 = !{!485, !486, !487, !488, !489, !493, !497, !501, !504, !506}
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 1, scope: !480, file: !12, line: 276, type: !40)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hook_var", arg: 2, scope: !480, file: !12, line: 276, type: !483)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 3, scope: !480, file: !12, line: 276, type: !16)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "function", scope: !480, file: !12, line: 278, type: !16)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !480, file: !12, line: 279, type: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 640, align: 8, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 80)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !494, file: !12, line: 284, type: !16)
!494 = distinct !DILexicalBlock(scope: !495, file: !12, line: 284, column: 12)
!495 = distinct !DILexicalBlock(scope: !496, file: !12, line: 283, column: 40)
!496 = distinct !DILexicalBlock(scope: !480, file: !12, line: 283, column: 9)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !498, file: !12, line: 284, type: !16)
!498 = distinct !DILexicalBlock(scope: !499, file: !12, line: 284, column: 117)
!499 = distinct !DILexicalBlock(scope: !500, file: !12, line: 284, column: 86)
!500 = distinct !DILexicalBlock(scope: !494, file: !12, line: 284, column: 63)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !502, file: !12, line: 287, type: !16)
!502 = distinct !DILexicalBlock(scope: !503, file: !12, line: 286, column: 42)
!503 = distinct !DILexicalBlock(scope: !496, file: !12, line: 286, column: 14)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !505, file: !12, line: 290, type: !16)
!505 = distinct !DILexicalBlock(scope: !502, file: !12, line: 290, column: 12)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !507, file: !12, line: 290, type: !16)
!507 = distinct !DILexicalBlock(scope: !508, file: !12, line: 290, column: 99)
!508 = distinct !DILexicalBlock(scope: !505, file: !12, line: 290, column: 65)
!509 = !DISubprogram(name: "get_completer", scope: !12, file: !12, line: 586, type: !137, isLocal: true, isDefinition: true, scopeLine: 587, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_completer, variables: !510)
!510 = !{!511, !512}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !509, file: !12, line: 586, type: !16)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !509, file: !12, line: 586, type: !16)
!513 = !DISubprogram(name: "get_completion_type", scope: !12, file: !12, line: 379, type: !137, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_completion_type, variables: !514)
!514 = !{!515, !516}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !513, file: !12, line: 379, type: !16)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !513, file: !12, line: 379, type: !16)
!517 = !DISubprogram(name: "get_begidx", scope: !12, file: !12, line: 392, type: !137, isLocal: true, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_begidx, variables: !518)
!518 = !{!519, !520}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !517, file: !12, line: 392, type: !16)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !517, file: !12, line: 392, type: !16)
!521 = !DISubprogram(name: "get_endidx", scope: !12, file: !12, line: 406, type: !137, isLocal: true, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_endidx, variables: !522)
!522 = !{!523, !524}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !521, file: !12, line: 406, type: !16)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !521, file: !12, line: 406, type: !16)
!525 = !DISubprogram(name: "set_completer_delims", scope: !12, file: !12, line: 420, type: !137, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_completer_delims, variables: !526)
!526 = !{!527, !528, !529}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !525, file: !12, line: 420, type: !16)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !525, file: !12, line: 420, type: !16)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "break_chars", scope: !525, file: !12, line: 422, type: !63)
!530 = !DISubprogram(name: "py_add_history", scope: !12, file: !12, line: 540, type: !137, isLocal: true, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_add_history, variables: !531)
!531 = !{!532, !533, !534}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !530, file: !12, line: 540, type: !16)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !530, file: !12, line: 540, type: !16)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !530, file: !12, line: 542, type: !63)
!535 = !DISubprogram(name: "py_remove_history", scope: !12, file: !12, line: 477, type: !137, isLocal: true, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_remove_history, variables: !536)
!536 = !{!537, !538, !539, !540}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !535, file: !12, line: 477, type: !16)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !535, file: !12, line: 477, type: !16)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry_number", scope: !535, file: !12, line: 479, type: !55)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !535, file: !12, line: 480, type: !438)
!541 = !DISubprogram(name: "_py_free_history_entry", scope: !12, file: !12, line: 454, type: !542, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._hist_entry*)* @_py_free_history_entry, variables: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !438}
!544 = !{!545, !546}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !541, file: !12, line: 454, type: !438)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !541, file: !12, line: 456, type: !446)
!547 = !DISubprogram(name: "py_replace_history", scope: !12, file: !12, line: 506, type: !137, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_replace_history, variables: !548)
!548 = !{!549, !550, !551, !552, !553}
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !547, file: !12, line: 506, type: !16)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !547, file: !12, line: 506, type: !16)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry_number", scope: !547, file: !12, line: 508, type: !55)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !547, file: !12, line: 509, type: !63)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_entry", scope: !547, file: !12, line: 510, type: !438)
!554 = !DISubprogram(name: "get_completer_delims", scope: !12, file: !12, line: 559, type: !137, isLocal: true, isDefinition: true, scopeLine: 560, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_completer_delims, variables: !555)
!555 = !{!556, !557}
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !554, file: !12, line: 559, type: !16)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !554, file: !12, line: 559, type: !16)
!558 = !DISubprogram(name: "set_completion_display_matches_hook", scope: !12, file: !12, line: 310, type: !137, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_completion_display_matches_hook, variables: !559)
!559 = !{!560, !561, !562}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !558, file: !12, line: 310, type: !16)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !558, file: !12, line: 310, type: !16)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !558, file: !12, line: 312, type: !16)
!563 = !DISubprogram(name: "on_completion_display_matches_hook", scope: !12, file: !12, line: 860, type: !362, isLocal: true, isDefinition: true, scopeLine: 862, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i32, i32)* @on_completion_display_matches_hook, variables: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !574, !576, !578, !582, !586, !589, !591}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "matches", arg: 1, scope: !563, file: !12, line: 860, type: !364)
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_matches", arg: 2, scope: !563, file: !12, line: 861, type: !55)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_length", arg: 3, scope: !563, file: !12, line: 861, type: !55)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !563, file: !12, line: 863, type: !55)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !563, file: !12, line: 864, type: !16)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !563, file: !12, line: 864, type: !16)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !563, file: !12, line: 864, type: !16)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gilstate", scope: !563, file: !12, line: 866, type: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGILState_STATE", file: !4, line: 191, baseType: !3)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !12, line: 881, type: !16)
!575 = distinct !DILexicalBlock(scope: !563, file: !12, line: 881, column: 8)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !577, file: !12, line: 887, type: !16)
!577 = distinct !DILexicalBlock(scope: !563, file: !12, line: 887, column: 8)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !12, line: 887, type: !16)
!579 = distinct !DILexicalBlock(scope: !580, file: !12, line: 887, column: 97)
!580 = distinct !DILexicalBlock(scope: !581, file: !12, line: 887, column: 74)
!581 = distinct !DILexicalBlock(scope: !577, file: !12, line: 887, column: 51)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !583, file: !12, line: 892, type: !16)
!583 = distinct !DILexicalBlock(scope: !584, file: !12, line: 892, column: 12)
!584 = distinct !DILexicalBlock(scope: !585, file: !12, line: 889, column: 12)
!585 = distinct !DILexicalBlock(scope: !563, file: !12, line: 889, column: 9)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !587, file: !12, line: 892, type: !16)
!587 = distinct !DILexicalBlock(scope: !588, file: !12, line: 892, column: 97)
!588 = distinct !DILexicalBlock(scope: !583, file: !12, line: 892, column: 63)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !590, file: !12, line: 893, type: !16)
!590 = distinct !DILexicalBlock(scope: !584, file: !12, line: 893, column: 12)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !12, line: 893, type: !16)
!592 = distinct !DILexicalBlock(scope: !593, file: !12, line: 893, column: 97)
!593 = distinct !DILexicalBlock(scope: !590, file: !12, line: 893, column: 63)
!594 = !DISubprogram(name: "set_startup_hook", scope: !12, file: !12, line: 337, type: !137, isLocal: true, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_startup_hook, variables: !595)
!595 = !{!596, !597}
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !594, file: !12, line: 337, type: !16)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !594, file: !12, line: 337, type: !16)
!598 = !DISubprogram(name: "set_pre_input_hook", scope: !12, file: !12, line: 354, type: !137, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_pre_input_hook, variables: !599)
!599 = !{!600, !601}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !598, file: !12, line: 354, type: !16)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !598, file: !12, line: 354, type: !16)
!602 = !DISubprogram(name: "py_clear_history", scope: !12, file: !12, line: 693, type: !137, isLocal: true, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_clear_history, variables: !603)
!603 = !{!604, !605}
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !602, file: !12, line: 693, type: !16)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !602, file: !12, line: 693, type: !16)
!606 = !DISubprogram(name: "readline_traverse", scope: !12, file: !12, line: 106, type: !272, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @readline_traverse, variables: !607)
!607 = !{!608, !609, !610, !611, !612, !616, !620, !624, !628, !632}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !606, file: !12, line: 106, type: !16)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !606, file: !12, line: 106, type: !274)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !606, file: !12, line: 106, type: !9)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !606, file: !12, line: 108, type: !10)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !613, file: !12, line: 109, type: !55)
!613 = distinct !DILexicalBlock(scope: !614, file: !12, line: 109, column: 54)
!614 = distinct !DILexicalBlock(scope: !615, file: !12, line: 109, column: 14)
!615 = distinct !DILexicalBlock(scope: !606, file: !12, line: 109, column: 8)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !617, file: !12, line: 110, type: !55)
!617 = distinct !DILexicalBlock(scope: !618, file: !12, line: 110, column: 35)
!618 = distinct !DILexicalBlock(scope: !619, file: !12, line: 110, column: 14)
!619 = distinct !DILexicalBlock(scope: !606, file: !12, line: 110, column: 8)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !621, file: !12, line: 111, type: !55)
!621 = distinct !DILexicalBlock(scope: !622, file: !12, line: 111, column: 37)
!622 = distinct !DILexicalBlock(scope: !623, file: !12, line: 111, column: 14)
!623 = distinct !DILexicalBlock(scope: !606, file: !12, line: 111, column: 8)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !625, file: !12, line: 112, type: !55)
!625 = distinct !DILexicalBlock(scope: !626, file: !12, line: 112, column: 32)
!626 = distinct !DILexicalBlock(scope: !627, file: !12, line: 112, column: 14)
!627 = distinct !DILexicalBlock(scope: !606, file: !12, line: 112, column: 8)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !629, file: !12, line: 113, type: !55)
!629 = distinct !DILexicalBlock(scope: !630, file: !12, line: 113, column: 29)
!630 = distinct !DILexicalBlock(scope: !631, file: !12, line: 113, column: 14)
!631 = distinct !DILexicalBlock(scope: !606, file: !12, line: 113, column: 8)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !633, file: !12, line: 114, type: !55)
!633 = distinct !DILexicalBlock(scope: !634, file: !12, line: 114, column: 29)
!634 = distinct !DILexicalBlock(scope: !635, file: !12, line: 114, column: 14)
!635 = distinct !DILexicalBlock(scope: !606, file: !12, line: 114, column: 8)
!636 = !DISubprogram(name: "readline_clear", scope: !12, file: !12, line: 93, type: !155, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @readline_clear, variables: !637)
!637 = !{!638, !639, !640, !642, !646, !648, !652, !654, !658, !660, !664, !666, !670, !672}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !636, file: !12, line: 93, type: !16)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !636, file: !12, line: 95, type: !10)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !641, file: !12, line: 96, type: !16)
!641 = distinct !DILexicalBlock(scope: !636, file: !12, line: 96, column: 7)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !643, file: !12, line: 96, type: !16)
!643 = distinct !DILexicalBlock(scope: !644, file: !12, line: 96, column: 170)
!644 = distinct !DILexicalBlock(scope: !645, file: !12, line: 96, column: 110)
!645 = distinct !DILexicalBlock(scope: !641, file: !12, line: 96, column: 87)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !647, file: !12, line: 97, type: !16)
!647 = distinct !DILexicalBlock(scope: !636, file: !12, line: 97, column: 7)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !649, file: !12, line: 97, type: !16)
!649 = distinct !DILexicalBlock(scope: !650, file: !12, line: 97, column: 132)
!650 = distinct !DILexicalBlock(scope: !651, file: !12, line: 97, column: 91)
!651 = distinct !DILexicalBlock(scope: !647, file: !12, line: 97, column: 68)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !653, file: !12, line: 98, type: !16)
!653 = distinct !DILexicalBlock(scope: !636, file: !12, line: 98, column: 7)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !655, file: !12, line: 98, type: !16)
!655 = distinct !DILexicalBlock(scope: !656, file: !12, line: 98, column: 136)
!656 = distinct !DILexicalBlock(scope: !657, file: !12, line: 98, column: 93)
!657 = distinct !DILexicalBlock(scope: !653, file: !12, line: 98, column: 70)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !659, file: !12, line: 99, type: !16)
!659 = distinct !DILexicalBlock(scope: !636, file: !12, line: 99, column: 7)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !12, line: 99, type: !16)
!661 = distinct !DILexicalBlock(scope: !662, file: !12, line: 99, column: 126)
!662 = distinct !DILexicalBlock(scope: !663, file: !12, line: 99, column: 88)
!663 = distinct !DILexicalBlock(scope: !659, file: !12, line: 99, column: 65)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !665, file: !12, line: 100, type: !16)
!665 = distinct !DILexicalBlock(scope: !636, file: !12, line: 100, column: 7)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !12, line: 100, type: !16)
!667 = distinct !DILexicalBlock(scope: !668, file: !12, line: 100, column: 120)
!668 = distinct !DILexicalBlock(scope: !669, file: !12, line: 100, column: 85)
!669 = distinct !DILexicalBlock(scope: !665, file: !12, line: 100, column: 62)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !671, file: !12, line: 101, type: !16)
!671 = distinct !DILexicalBlock(scope: !636, file: !12, line: 101, column: 7)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !12, line: 101, type: !16)
!673 = distinct !DILexicalBlock(scope: !674, file: !12, line: 101, column: 120)
!674 = distinct !DILexicalBlock(scope: !675, file: !12, line: 101, column: 85)
!675 = distinct !DILexicalBlock(scope: !671, file: !12, line: 101, column: 62)
!676 = !DISubprogram(name: "readline_free", scope: !12, file: !12, line: 119, type: !342, isLocal: true, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @readline_free, variables: !677)
!677 = !{!678}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !676, file: !12, line: 119, type: !9)
!679 = !DISubprogram(name: "call_readline", scope: !12, file: !12, line: 1155, type: !680, isLocal: true, isDefinition: true, scopeLine: 1156, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._IO_FILE*, %struct._IO_FILE*, i8*)* @call_readline, variables: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{!63, !56, !56, !40}
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !694, !695, !698}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sys_stdin", arg: 1, scope: !679, file: !12, line: 1155, type: !56)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sys_stdout", arg: 2, scope: !679, file: !12, line: 1155, type: !56)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prompt", arg: 3, scope: !679, file: !12, line: 1155, type: !40)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !679, file: !12, line: 1157, type: !105)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !679, file: !12, line: 1158, type: !63)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !679, file: !12, line: 1158, type: !63)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signal", scope: !679, file: !12, line: 1159, type: !55)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_locale", scope: !679, file: !12, line: 1162, type: !63)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !692, file: !12, line: 1196, type: !40)
!692 = distinct !DILexicalBlock(scope: !693, file: !12, line: 1195, column: 16)
!693 = distinct !DILexicalBlock(scope: !679, file: !12, line: 1195, column: 9)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !692, file: !12, line: 1197, type: !55)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !696, file: !12, line: 1208, type: !105)
!696 = distinct !DILexicalBlock(scope: !697, file: !12, line: 1208, column: 28)
!697 = distinct !DILexicalBlock(scope: !692, file: !12, line: 1208, column: 13)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !696, file: !12, line: 1208, type: !105)
!699 = !DISubprogram(name: "readline_until_enter_or_signal", scope: !12, file: !12, line: 1053, type: !700, isLocal: true, isDefinition: true, scopeLine: 1054, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32*)* @readline_until_enter_or_signal, variables: !703)
!700 = !DISubroutineType(types: !701)
!701 = !{!63, !40, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!703 = !{!704, !705, !706, !707, !715, !717, !718, !720, !721, !730, !732}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prompt", arg: 1, scope: !699, file: !12, line: 1053, type: !40)
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signal", arg: 2, scope: !699, file: !12, line: 1053, type: !702)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "not_done_reading", scope: !699, file: !12, line: 1055, type: !63)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "selectset", scope: !699, file: !12, line: 1056, type: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !366, line: 75, baseType: !709)
!709 = !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 64, size: 1024, align: 64, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !709, file: !366, line: 69, baseType: !712, size: 1024, align: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 1024, align: 64, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 16)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__d0", scope: !716, file: !12, line: 1064, type: !55)
!716 = distinct !DILexicalBlock(scope: !699, file: !12, line: 1064, column: 8)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__d1", scope: !716, file: !12, line: 1064, type: !55)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_input", scope: !719, file: !12, line: 1069, type: !55)
!719 = distinct !DILexicalBlock(scope: !699, file: !12, line: 1068, column: 56)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !719, file: !12, line: 1069, type: !55)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !722, file: !12, line: 1072, type: !723)
!722 = distinct !DILexicalBlock(scope: !719, file: !12, line: 1072, column: 9)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !724, line: 30, size: 128, align: 64, elements: !725)
!724 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!725 = !{!726, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !723, file: !724, line: 32, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 148, baseType: !28)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !723, file: !724, line: 33, baseType: !729, size: 64, align: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !27, line: 150, baseType: !28)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeoutp", scope: !722, file: !12, line: 1076, type: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !733, file: !12, line: 1091, type: !55)
!733 = distinct !DILexicalBlock(scope: !734, file: !12, line: 1090, column: 28)
!734 = distinct !DILexicalBlock(scope: !735, file: !12, line: 1090, column: 18)
!735 = distinct !DILexicalBlock(scope: !719, file: !12, line: 1087, column: 13)
!736 = !DISubprogram(name: "rlhandler", scope: !12, file: !12, line: 1044, type: !737, isLocal: true, isDefinition: true, scopeLine: 1045, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @rlhandler, variables: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !63}
!739 = !{!740}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !736, file: !12, line: 1044, type: !63)
!741 = !DISubprogram(name: "setup_readline", scope: !12, file: !12, line: 972, type: !742, isLocal: true, isDefinition: true, scopeLine: 973, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.readlinestate*)* @setup_readline, variables: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !10}
!744 = !{!745, !746, !747, !749}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod_state", arg: 1, scope: !741, file: !12, line: 972, type: !10)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_locale", scope: !741, file: !12, line: 975, type: !63)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__len", scope: !748, file: !12, line: 1017, type: !105)
!748 = distinct !DILexicalBlock(scope: !741, file: !12, line: 1017, column: 353)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__retval", scope: !748, file: !12, line: 1017, type: !63)
!750 = !DISubprogram(name: "on_startup_hook", scope: !12, file: !12, line: 819, type: !452, isLocal: true, isDefinition: true, scopeLine: 823, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @on_startup_hook, variables: !751)
!751 = !{!752, !753}
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !750, file: !12, line: 824, type: !55)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gilstate", scope: !750, file: !12, line: 826, type: !573)
!754 = !DISubprogram(name: "on_hook", scope: !12, file: !12, line: 791, type: !155, isLocal: true, isDefinition: true, scopeLine: 792, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @on_hook, variables: !755)
!755 = !{!756, !757, !758, !761, !763, !765}
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !754, file: !12, line: 791, type: !16)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !754, file: !12, line: 793, type: !55)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !759, file: !12, line: 795, type: !16)
!759 = distinct !DILexicalBlock(scope: !760, file: !12, line: 794, column: 29)
!760 = distinct !DILexicalBlock(scope: !754, file: !12, line: 794, column: 9)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !12, line: 806, type: !16)
!762 = distinct !DILexicalBlock(scope: !759, file: !12, line: 806, column: 12)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !764, file: !12, line: 810, type: !16)
!764 = distinct !DILexicalBlock(scope: !759, file: !12, line: 810, column: 12)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !12, line: 810, type: !16)
!766 = distinct !DILexicalBlock(scope: !767, file: !12, line: 810, column: 97)
!767 = distinct !DILexicalBlock(scope: !764, file: !12, line: 810, column: 63)
!768 = !DISubprogram(name: "on_pre_input_hook", scope: !12, file: !12, line: 838, type: !452, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @on_pre_input_hook, variables: !769)
!769 = !{!770, !771}
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !768, file: !12, line: 843, type: !55)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gilstate", scope: !768, file: !12, line: 845, type: !573)
!772 = !DISubprogram(name: "flex_complete", scope: !12, file: !12, line: 945, type: !773, isLocal: true, isDefinition: true, scopeLine: 946, flags: DIFlagPrototyped, isOptimized: true, function: i8** (i8*, i32, i32)* @flex_complete, variables: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!364, !40, !55, !55}
!775 = !{!776, !777, !778, !779, !780, !781, !783, !786, !788}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !772, file: !12, line: 945, type: !40)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !772, file: !12, line: 945, type: !55)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !772, file: !12, line: 945, type: !55)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !772, file: !12, line: 947, type: !364)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gilstate", scope: !772, file: !12, line: 949, type: !573)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !782, file: !12, line: 957, type: !16)
!782 = distinct !DILexicalBlock(scope: !772, file: !12, line: 957, column: 8)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !12, line: 957, type: !16)
!784 = distinct !DILexicalBlock(scope: !785, file: !12, line: 957, column: 173)
!785 = distinct !DILexicalBlock(scope: !782, file: !12, line: 957, column: 139)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !787, file: !12, line: 958, type: !16)
!787 = distinct !DILexicalBlock(scope: !772, file: !12, line: 958, column: 8)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !12, line: 958, type: !16)
!789 = distinct !DILexicalBlock(scope: !790, file: !12, line: 958, column: 173)
!790 = distinct !DILexicalBlock(scope: !787, file: !12, line: 958, column: 139)
!791 = !DISubprogram(name: "on_completion", scope: !12, file: !12, line: 905, type: !371, isLocal: true, isDefinition: true, scopeLine: 906, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @on_completion, variables: !792)
!792 = !{!793, !794, !795, !796, !799, !800, !803, !805, !807}
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !791, file: !12, line: 905, type: !40)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !791, file: !12, line: 905, type: !55)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !791, file: !12, line: 907, type: !63)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !797, file: !12, line: 909, type: !16)
!797 = distinct !DILexicalBlock(scope: !798, file: !12, line: 908, column: 109)
!798 = distinct !DILexicalBlock(scope: !791, file: !12, line: 908, column: 9)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gilstate", scope: !797, file: !12, line: 911, type: !573)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !801, file: !12, line: 921, type: !63)
!801 = distinct !DILexicalBlock(scope: !802, file: !12, line: 920, column: 14)
!802 = distinct !DILexicalBlock(scope: !797, file: !12, line: 917, column: 13)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !804, file: !12, line: 926, type: !16)
!804 = distinct !DILexicalBlock(scope: !797, file: !12, line: 926, column: 12)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !806, file: !12, line: 930, type: !16)
!806 = distinct !DILexicalBlock(scope: !797, file: !12, line: 930, column: 12)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !808, file: !12, line: 930, type: !16)
!808 = distinct !DILexicalBlock(scope: !809, file: !12, line: 930, column: 97)
!809 = distinct !DILexicalBlock(scope: !806, file: !12, line: 930, column: 63)
!810 = !{!811, !834, !838, !842, !846, !850, !854, !858, !862, !866, !867, !871, !875, !879, !883, !884, !888, !892, !896, !900, !904, !905, !909, !913, !917, !921, !925, !929, !933, !937, !941}
!811 = !DIGlobalVariable(name: "readlinemodule", scope: !0, file: !12, line: 1236, type: !812, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @readlinemodule)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !813, line: 47, size: 832, align: 64, elements: !814)
!813 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!814 = !{!815, !824, !825, !826, !827, !830, !831, !832, !833}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !812, file: !813, line: 48, baseType: !816, size: 320, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !813, line: 38, baseType: !817)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !813, line: 33, size: 320, align: 64, elements: !818)
!818 = !{!819, !820, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !817, file: !813, line: 34, baseType: !17, size: 128, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !817, file: !813, line: 35, baseType: !821, size: 64, align: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !817, file: !813, line: 36, baseType: !22, size: 64, align: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !817, file: !813, line: 37, baseType: !16, size: 64, align: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !812, file: !813, line: 49, baseType: !40, size: 64, align: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !812, file: !813, line: 50, baseType: !40, size: 64, align: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !812, file: !813, line: 51, baseType: !22, size: 64, align: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !812, file: !813, line: 52, baseType: !828, size: 64, align: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !292, line: 47, baseType: !291)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !812, file: !813, line: 53, baseType: !153, size: 64, align: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !812, file: !813, line: 54, baseType: !270, size: 64, align: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !812, file: !813, line: 55, baseType: !153, size: 64, align: 64, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !812, file: !813, line: 56, baseType: !340, size: 64, align: 64, offset: 768)
!834 = !DIGlobalVariable(name: "doc_module", scope: !0, file: !12, line: 1228, type: !835, isLocal: true, isDefinition: true, variable: [71 x i8]* @doc_module)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 568, align: 8, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 71)
!838 = !DIGlobalVariable(name: "readline_methods", scope: !0, file: !12, line: 739, type: !839, isLocal: true, isDefinition: true, variable: [26 x %struct.PyMethodDef]* @readline_methods)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 6656, align: 64, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 26)
!842 = !DIGlobalVariable(name: "doc_parse_and_bind", scope: !0, file: !12, line: 148, type: !843, isLocal: true, isDefinition: true, variable: [86 x i8]* @doc_parse_and_bind)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 688, align: 8, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 86)
!846 = !DIGlobalVariable(name: "doc_get_line_buffer", scope: !0, file: !12, line: 683, type: !847, isLocal: true, isDefinition: true, variable: [76 x i8]* @doc_get_line_buffer)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 608, align: 8, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 76)
!850 = !DIGlobalVariable(name: "doc_insert_text", scope: !0, file: !12, line: 717, type: !851, isLocal: true, isDefinition: true, variable: [63 x i8]* @doc_insert_text)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 504, align: 8, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 63)
!854 = !DIGlobalVariable(name: "doc_redisplay", scope: !0, file: !12, line: 731, type: !855, isLocal: true, isDefinition: true, variable: [110 x i8]* @doc_redisplay)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 880, align: 8, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 110)
!858 = !DIGlobalVariable(name: "doc_read_init_file", scope: !0, file: !12, line: 173, type: !859, isLocal: true, isDefinition: true, variable: [121 x i8]* @doc_read_init_file)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 968, align: 8, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 121)
!862 = !DIGlobalVariable(name: "doc_read_history_file", scope: !0, file: !12, line: 200, type: !863, isLocal: true, isDefinition: true, variable: [104 x i8]* @doc_read_history_file)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 832, align: 8, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 104)
!866 = !DIGlobalVariable(name: "_history_length", scope: !0, file: !12, line: 199, type: !55, isLocal: true, isDefinition: true, variable: i32* @_history_length)
!867 = !DIGlobalVariable(name: "doc_write_history_file", scope: !0, file: !12, line: 234, type: !868, isLocal: true, isDefinition: true, variable: [105 x i8]* @doc_write_history_file)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 840, align: 8, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 105)
!871 = !DIGlobalVariable(name: "doc_get_history_item", scope: !0, file: !12, line: 657, type: !872, isLocal: true, isDefinition: true, variable: [83 x i8]* @doc_get_history_item)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 664, align: 8, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 83)
!875 = !DIGlobalVariable(name: "doc_get_current_history_length", scope: !0, file: !12, line: 670, type: !876, isLocal: true, isDefinition: true, variable: [96 x i8]* @doc_get_current_history_length)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 768, align: 8, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 96)
