; ModuleID = 'irs-onlybc/resource.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !30, subprograms: !382, globals: !538)
!1 = !DIFile(filename: "resource.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !4, line: 31, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!7 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!8 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!9 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!10 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!11 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!12 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!13 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!14 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!15 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!16 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!17 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!18 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!19 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!20 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!21 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!22 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!23 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!24 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rusage_who", file: !4, line: 158, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "RUSAGE_SELF", value: 0)
!28 = !DIEnumerator(name: "RUSAGE_CHILDREN", value: -1)
!29 = !DIEnumerator(name: "RUSAGE_THREAD", value: 1)
!30 = !{!31, !32, !44, !370, !371, !379, !381}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !34, line: 109, baseType: !35)
!34 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !34, line: 105, size: 128, align: 64, elements: !36)
!36 = !{!37, !45}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !35, file: !34, line: 107, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !39, line: 177, baseType: !40)
!39 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !41, line: 102, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !43, line: 181, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !35, file: !34, line: 108, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !34, line: 334, size: 3200, align: 64, elements: !48)
!48 = !{!49, !55, !59, !60, !61, !66, !129, !134, !139, !140, !145, !197, !228, !240, !246, !247, !248, !250, !252, !283, !284, !285, !294, !295, !300, !301, !303, !305, !315, !318, !336, !337, !338, !340, !342, !343, !345, !350, !355, !360, !361, !362, !363, !364, !365, !366, !367, !369}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !47, file: !34, line: 335, baseType: !50, size: 192, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !34, line: 114, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 111, size: 192, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !51, file: !34, line: 112, baseType: !33, size: 128, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !51, file: !34, line: 113, baseType: !38, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !47, file: !34, line: 336, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !47, file: !34, line: 337, baseType: !38, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !47, file: !34, line: 337, baseType: !38, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !47, file: !34, line: 341, baseType: !62, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !34, line: 308, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !32}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !47, file: !34, line: 342, baseType: !67, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !34, line: 314, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !32, !72, !71}
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 48, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 246, size: 1728, align: 64, elements: !76)
!75 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!76 = !{!77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !103, !105, !107, !111, !114, !116, !117, !118, !119, !120, !124, !125}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 247, baseType: !71, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 252, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 253, baseType: !79, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 254, baseType: !79, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 255, baseType: !79, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 256, baseType: !79, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 257, baseType: !79, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 258, baseType: !79, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 259, baseType: !79, size: 64, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 261, baseType: !79, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 262, baseType: !79, size: 64, align: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 263, baseType: !79, size: 64, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 265, baseType: !91, size: 64, align: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 161, size: 192, align: 64, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !92, file: !75, line: 162, baseType: !91, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !92, file: !75, line: 163, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !92, file: !75, line: 167, baseType: !71, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 267, baseType: !96, size: 64, align: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 269, baseType: !71, size: 32, align: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 273, baseType: !71, size: 32, align: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 275, baseType: !102, size: 64, align: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 140, baseType: !44)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 279, baseType: !104, size: 16, align: 16, offset: 1024)
!104 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 280, baseType: !106, size: 8, align: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 281, baseType: !108, size: 8, align: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 285, baseType: !112, size: 64, align: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 155, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 294, baseType: !115, size: 64, align: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 141, baseType: !44)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !74, file: !75, line: 303, baseType: !31, size: 64, align: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !74, file: !75, line: 304, baseType: !31, size: 64, align: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !74, file: !75, line: 305, baseType: !31, size: 64, align: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !74, file: !75, line: 306, baseType: !31, size: 64, align: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 307, baseType: !121, size: 64, align: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 62, baseType: !123)
!122 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!123 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 309, baseType: !71, size: 32, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 311, baseType: !126, size: 160, align: 8, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !47, file: !34, line: 343, baseType: !130, size: 64, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !34, line: 316, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!32, !32, !79}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !47, file: !34, line: 344, baseType: !135, size: 64, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !34, line: 318, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!71, !32, !79, !32}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !47, file: !34, line: 345, baseType: !31, size: 64, align: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !47, file: !34, line: 346, baseType: !141, size: 64, align: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !34, line: 320, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!32, !32}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !47, file: !34, line: 350, baseType: !146, size: 64, align: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !34, line: 278, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 236, size: 2176, align: 64, elements: !149)
!149 = !{!150, !155, !156, !157, !158, !159, !164, !166, !167, !168, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !148, file: !34, line: 241, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !34, line: 166, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!32, !32, !32}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !148, file: !34, line: 242, baseType: !151, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !148, file: !34, line: 243, baseType: !151, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !148, file: !34, line: 244, baseType: !151, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !148, file: !34, line: 245, baseType: !151, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !148, file: !34, line: 246, baseType: !160, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !34, line: 167, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!32, !32, !32, !32}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !148, file: !34, line: 247, baseType: !165, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !34, line: 165, baseType: !142)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !148, file: !34, line: 248, baseType: !165, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !148, file: !34, line: 249, baseType: !165, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !148, file: !34, line: 250, baseType: !169, size: 64, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !34, line: 168, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!71, !32}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !148, file: !34, line: 251, baseType: !165, size: 64, align: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !148, file: !34, line: 252, baseType: !151, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !148, file: !34, line: 253, baseType: !151, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !148, file: !34, line: 254, baseType: !151, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !148, file: !34, line: 255, baseType: !151, size: 64, align: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !148, file: !34, line: 256, baseType: !151, size: 64, align: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !148, file: !34, line: 257, baseType: !165, size: 64, align: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !148, file: !34, line: 258, baseType: !31, size: 64, align: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !148, file: !34, line: 259, baseType: !165, size: 64, align: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !148, file: !34, line: 261, baseType: !151, size: 64, align: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !148, file: !34, line: 262, baseType: !151, size: 64, align: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !148, file: !34, line: 263, baseType: !151, size: 64, align: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !148, file: !34, line: 264, baseType: !151, size: 64, align: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !148, file: !34, line: 265, baseType: !160, size: 64, align: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !148, file: !34, line: 266, baseType: !151, size: 64, align: 64, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !148, file: !34, line: 267, baseType: !151, size: 64, align: 64, offset: 1600)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !148, file: !34, line: 268, baseType: !151, size: 64, align: 64, offset: 1664)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !148, file: !34, line: 269, baseType: !151, size: 64, align: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !148, file: !34, line: 270, baseType: !151, size: 64, align: 64, offset: 1792)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !148, file: !34, line: 272, baseType: !151, size: 64, align: 64, offset: 1856)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !148, file: !34, line: 273, baseType: !151, size: 64, align: 64, offset: 1920)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !148, file: !34, line: 274, baseType: !151, size: 64, align: 64, offset: 1984)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !148, file: !34, line: 275, baseType: !151, size: 64, align: 64, offset: 2048)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !148, file: !34, line: 277, baseType: !165, size: 64, align: 64, offset: 2112)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !47, file: !34, line: 351, baseType: !198, size: 64, align: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !34, line: 292, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 280, size: 640, align: 64, elements: !201)
!201 = !{!202, !207, !208, !213, !214, !215, !220, !221, !226, !227}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !200, file: !34, line: 281, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !34, line: 169, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!38, !32}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !200, file: !34, line: 282, baseType: !151, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !200, file: !34, line: 283, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !34, line: 170, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!32, !32, !38}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !200, file: !34, line: 284, baseType: !209, size: 64, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !200, file: !34, line: 285, baseType: !31, size: 64, align: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !200, file: !34, line: 286, baseType: !216, size: 64, align: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !34, line: 172, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!71, !32, !38, !32}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !200, file: !34, line: 287, baseType: !31, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !200, file: !34, line: 288, baseType: !222, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !34, line: 231, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!71, !32, !32}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !200, file: !34, line: 290, baseType: !151, size: 64, align: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !200, file: !34, line: 291, baseType: !209, size: 64, align: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !47, file: !34, line: 352, baseType: !229, size: 64, align: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !34, line: 298, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 294, size: 192, align: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !231, file: !34, line: 295, baseType: !203, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !231, file: !34, line: 296, baseType: !151, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !231, file: !34, line: 297, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !34, line: 174, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!71, !32, !32, !32}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !47, file: !34, line: 356, baseType: !241, size: 64, align: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !34, line: 321, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !32}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !39, line: 186, baseType: !38)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !47, file: !34, line: 357, baseType: !160, size: 64, align: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !47, file: !34, line: 358, baseType: !141, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !47, file: !34, line: 359, baseType: !249, size: 64, align: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !34, line: 317, baseType: !152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !47, file: !34, line: 360, baseType: !251, size: 64, align: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !34, line: 319, baseType: !237)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !47, file: !34, line: 363, baseType: !253, size: 64, align: 64, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !34, line: 304, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 301, size: 128, align: 64, elements: !256)
!256 = !{!257, !278}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !255, file: !34, line: 302, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !34, line: 193, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!71, !32, !262, !71}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !34, line: 191, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !34, line: 178, size: 640, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !275, !276, !277}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !264, file: !34, line: 179, baseType: !31, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !264, file: !34, line: 180, baseType: !32, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !264, file: !34, line: 181, baseType: !38, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !264, file: !34, line: 182, baseType: !38, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !264, file: !34, line: 184, baseType: !71, size: 32, align: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !264, file: !34, line: 185, baseType: !71, size: 32, align: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !264, file: !34, line: 186, baseType: !79, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !264, file: !34, line: 187, baseType: !274, size: 64, align: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !264, file: !34, line: 188, baseType: !274, size: 64, align: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !264, file: !34, line: 189, baseType: !274, size: 64, align: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !264, file: !34, line: 190, baseType: !31, size: 64, align: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !255, file: !34, line: 303, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !34, line: 194, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !32, !262}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !47, file: !34, line: 366, baseType: !123, size: 64, align: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !47, file: !34, line: 368, baseType: !56, size: 64, align: 64, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !47, file: !34, line: 372, baseType: !286, size: 64, align: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !34, line: 233, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!71, !32, !290, !31}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !34, line: 232, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!71, !32, !31}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !47, file: !34, line: 375, baseType: !169, size: 64, align: 64, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !47, file: !34, line: 379, baseType: !296, size: 64, align: 64, offset: 1600)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !34, line: 322, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!32, !32, !32, !71}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !47, file: !34, line: 382, baseType: !38, size: 64, align: 64, offset: 1664)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !47, file: !34, line: 385, baseType: !302, size: 64, align: 64, offset: 1728)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !34, line: 323, baseType: !142)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !47, file: !34, line: 386, baseType: !304, size: 64, align: 64, offset: 1792)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !34, line: 324, baseType: !142)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !47, file: !34, line: 389, baseType: !306, size: 64, align: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !308, line: 40, size: 256, align: 64, elements: !309)
!308 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!309 = !{!310, !311, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !307, file: !308, line: 41, baseType: !56, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !307, file: !308, line: 42, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !308, line: 18, baseType: !152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !307, file: !308, line: 43, baseType: !71, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !307, file: !308, line: 45, baseType: !56, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !47, file: !34, line: 390, baseType: !316, size: 64, align: 64, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !34, line: 390, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !47, file: !34, line: 391, baseType: !319, size: 64, align: 64, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !321, line: 11, size: 320, align: 64, elements: !322)
!321 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!322 = !{!323, !324, !329, !334, !335}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !321, line: 12, baseType: !79, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !320, file: !321, line: 13, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !321, line: 8, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!32, !32, !31}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !320, file: !321, line: 14, baseType: !330, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !321, line: 9, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!71, !32, !32, !31}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !320, file: !321, line: 15, baseType: !79, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !320, file: !321, line: 16, baseType: !31, size: 64, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !47, file: !34, line: 392, baseType: !46, size: 64, align: 64, offset: 2048)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !47, file: !34, line: 393, baseType: !32, size: 64, align: 64, offset: 2112)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !47, file: !34, line: 394, baseType: !339, size: 64, align: 64, offset: 2176)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !34, line: 325, baseType: !161)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !47, file: !34, line: 395, baseType: !341, size: 64, align: 64, offset: 2240)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !34, line: 326, baseType: !237)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !47, file: !34, line: 396, baseType: !38, size: 64, align: 64, offset: 2304)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !47, file: !34, line: 397, baseType: !344, size: 64, align: 64, offset: 2368)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !34, line: 327, baseType: !237)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !47, file: !34, line: 398, baseType: !346, size: 64, align: 64, offset: 2432)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !34, line: 329, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!32, !46, !38}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !47, file: !34, line: 399, baseType: !351, size: 64, align: 64, offset: 2496)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !34, line: 328, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!32, !46, !32, !32}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !47, file: !34, line: 400, baseType: !356, size: 64, align: 64, offset: 2560)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !34, line: 307, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !31}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !47, file: !34, line: 401, baseType: !169, size: 64, align: 64, offset: 2624)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !47, file: !34, line: 402, baseType: !32, size: 64, align: 64, offset: 2688)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !47, file: !34, line: 403, baseType: !32, size: 64, align: 64, offset: 2752)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !47, file: !34, line: 404, baseType: !32, size: 64, align: 64, offset: 2816)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !47, file: !34, line: 405, baseType: !32, size: 64, align: 64, offset: 2880)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !47, file: !34, line: 406, baseType: !32, size: 64, align: 64, offset: 2944)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !47, file: !34, line: 407, baseType: !62, size: 64, align: 64, offset: 3008)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !47, file: !34, line: 410, baseType: !368, size: 32, align: 32, offset: 3072)
!368 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !47, file: !34, line: 412, baseType: !62, size: 64, align: 64, offset: 3136)
!370 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !373, line: 33, baseType: !374)
!373 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!374 = !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 25, size: 256, align: 64, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !374, file: !373, line: 26, baseType: !50, size: 192, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !374, file: !373, line: 27, baseType: !378, size: 64, align: 64, offset: 192)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, align: 64, elements: !109)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !4, line: 133, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim64_t", file: !43, line: 146, baseType: !123)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!382 = !{!383, !390, !483, !493, !498, !512, !520, !533}
!383 = !DISubprogram(name: "PyInit_resource", scope: !384, file: !384, line: 314, type: !385, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_resource, variables: !387)
!384 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/resource.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!385 = !DISubroutineType(types: !386)
!386 = !{!32}
!387 = !{!388, !389}
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !383, file: !384, line: 316, type: !32)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !383, file: !384, line: 316, type: !32)
!390 = !DISubprogram(name: "resource_getrusage", scope: !384, file: !384, line: 59, type: !153, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @resource_getrusage, variables: !391)
!391 = !{!392, !393, !394, !395, !478, !479}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !390, file: !384, line: 59, type: !32)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !390, file: !384, line: 59, type: !32)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "who", scope: !390, file: !384, line: 61, type: !71)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ru", scope: !390, file: !384, line: 62, type: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !4, line: 187, size: 1152, align: 64, elements: !397)
!397 = !{!398, !406, !407, !413, !418, !423, !428, !433, !438, !443, !448, !453, !458, !463, !468, !473}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !396, file: !4, line: 190, baseType: !399, size: 128, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !400, line: 30, size: 128, align: 64, elements: !401)
!400 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!401 = !{!402, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !399, file: !400, line: 32, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !43, line: 148, baseType: !44)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !399, file: !400, line: 33, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !43, line: 150, baseType: !44)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !396, file: !4, line: 192, baseType: !399, size: 128, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 194, baseType: !408, size: 64, align: 64, offset: 256)
!408 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 194, size: 64, align: 64, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !408, file: !4, line: 196, baseType: !44, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_maxrss_word", scope: !408, file: !4, line: 197, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !43, line: 184, baseType: !44)
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 202, baseType: !414, size: 64, align: 64, offset: 320)
!414 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 202, size: 64, align: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !414, file: !4, line: 204, baseType: !44, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_ixrss_word", scope: !414, file: !4, line: 205, baseType: !412, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 208, baseType: !419, size: 64, align: 64, offset: 384)
!419 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 208, size: 64, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !419, file: !4, line: 210, baseType: !44, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_idrss_word", scope: !419, file: !4, line: 211, baseType: !412, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 214, baseType: !424, size: 64, align: 64, offset: 448)
!424 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 214, size: 64, align: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !424, file: !4, line: 216, baseType: !44, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_isrss_word", scope: !424, file: !4, line: 217, baseType: !412, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 221, baseType: !429, size: 64, align: 64, offset: 512)
!429 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 221, size: 64, align: 64, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !429, file: !4, line: 223, baseType: !44, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_minflt_word", scope: !429, file: !4, line: 224, baseType: !412, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 227, baseType: !434, size: 64, align: 64, offset: 576)
!434 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 227, size: 64, align: 64, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !434, file: !4, line: 229, baseType: !44, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_majflt_word", scope: !434, file: !4, line: 230, baseType: !412, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 233, baseType: !439, size: 64, align: 64, offset: 640)
!439 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 233, size: 64, align: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !439, file: !4, line: 235, baseType: !44, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nswap_word", scope: !439, file: !4, line: 236, baseType: !412, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 240, baseType: !444, size: 64, align: 64, offset: 704)
!444 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 240, size: 64, align: 64, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !444, file: !4, line: 242, baseType: !44, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_inblock_word", scope: !444, file: !4, line: 243, baseType: !412, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 246, baseType: !449, size: 64, align: 64, offset: 768)
!449 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 246, size: 64, align: 64, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !449, file: !4, line: 248, baseType: !44, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_oublock_word", scope: !449, file: !4, line: 249, baseType: !412, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 252, baseType: !454, size: 64, align: 64, offset: 832)
!454 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 252, size: 64, align: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !454, file: !4, line: 254, baseType: !44, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgsnd_word", scope: !454, file: !4, line: 255, baseType: !412, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 258, baseType: !459, size: 64, align: 64, offset: 896)
!459 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 258, size: 64, align: 64, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !459, file: !4, line: 260, baseType: !44, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgrcv_word", scope: !459, file: !4, line: 261, baseType: !412, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 264, baseType: !464, size: 64, align: 64, offset: 960)
!464 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 264, size: 64, align: 64, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !464, file: !4, line: 266, baseType: !44, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nsignals_word", scope: !464, file: !4, line: 267, baseType: !412, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 272, baseType: !469, size: 64, align: 64, offset: 1024)
!469 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 272, size: 64, align: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !469, file: !4, line: 274, baseType: !44, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nvcsw_word", scope: !469, file: !4, line: 275, baseType: !412, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !4, line: 279, baseType: !474, size: 64, align: 64, offset: 1088)
!474 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 279, size: 64, align: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !474, file: !4, line: 281, baseType: !44, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nivcsw_word", scope: !474, file: !4, line: 282, baseType: !412, size: 64, align: 64)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !390, file: !384, line: 63, type: !32)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !384, line: 102, type: !32)
!480 = distinct !DILexicalBlock(scope: !481, file: !384, line: 102, column: 12)
!481 = distinct !DILexicalBlock(scope: !482, file: !384, line: 101, column: 27)
!482 = distinct !DILexicalBlock(scope: !390, file: !384, line: 101, column: 9)
!483 = !DISubprogram(name: "resource_getrlimit", scope: !384, file: !384, line: 149, type: !153, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @resource_getrlimit, variables: !484)
!484 = !{!485, !486, !487, !492}
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !483, file: !384, line: 149, type: !32)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !483, file: !384, line: 149, type: !32)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rl", scope: !483, file: !384, line: 151, type: !488)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !4, line: 139, size: 128, align: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !488, file: !4, line: 142, baseType: !379, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !488, file: !4, line: 144, baseType: !379, size: 64, align: 64, offset: 64)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resource", scope: !483, file: !384, line: 152, type: !71)
!493 = !DISubprogram(name: "rlimit2py", scope: !384, file: !384, line: 136, type: !494, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64, i64)* @rlimit2py, variables: !496)
!494 = !DISubroutineType(types: !495)
!495 = !{!32, !488}
!496 = !{!497}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rl", arg: 1, scope: !493, file: !384, line: 136, type: !488)
!498 = !DISubprogram(name: "resource_prlimit", scope: !384, file: !384, line: 225, type: !153, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @resource_prlimit, variables: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !510, !511}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !498, file: !384, line: 225, type: !32)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !498, file: !384, line: 225, type: !32)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_limit", scope: !498, file: !384, line: 227, type: !488)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_limit", scope: !498, file: !384, line: 227, type: !488)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resource", scope: !498, file: !384, line: 228, type: !71)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !498, file: !384, line: 228, type: !71)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pid", scope: !498, file: !384, line: 229, type: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !508, line: 98, baseType: !509)
!508 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !43, line: 142, baseType: !71)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curobj", scope: !498, file: !384, line: 230, type: !32)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxobj", scope: !498, file: !384, line: 230, type: !32)
!512 = !DISubprogram(name: "py2rlimit", scope: !384, file: !384, line: 110, type: !513, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct.rlimit*)* @py2rlimit, variables: !516)
!513 = !DISubroutineType(types: !514)
!514 = !{!71, !32, !32, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!516 = !{!517, !518, !519}
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "curobj", arg: 1, scope: !512, file: !384, line: 110, type: !32)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxobj", arg: 2, scope: !512, file: !384, line: 110, type: !32)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rl_out", arg: 3, scope: !512, file: !384, line: 110, type: !515)
!520 = !DISubprogram(name: "resource_setrlimit", scope: !384, file: !384, line: 171, type: !153, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @resource_setrlimit, variables: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !531}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !520, file: !384, line: 171, type: !32)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !520, file: !384, line: 171, type: !32)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rl", scope: !520, file: !384, line: 173, type: !488)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resource", scope: !520, file: !384, line: 174, type: !71)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limits", scope: !520, file: !384, line: 175, type: !32)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curobj", scope: !520, file: !384, line: 175, type: !32)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxobj", scope: !520, file: !384, line: 175, type: !32)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !530, file: !384, line: 214, type: !32)
!530 = distinct !DILexicalBlock(scope: !520, file: !384, line: 214, column: 8)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !532, file: !384, line: 219, type: !32)
!532 = distinct !DILexicalBlock(scope: !520, file: !384, line: 219, column: 8)
!533 = !DISubprogram(name: "resource_getpagesize", scope: !384, file: !384, line: 266, type: !153, isLocal: true, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @resource_getpagesize, variables: !534)
!534 = !{!535, !536, !537}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !533, file: !384, line: 266, type: !32)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !533, file: !384, line: 266, type: !32)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pagesize", scope: !533, file: !384, line: 268, type: !44)
!538 = !{!539, !540, !542, !565, !569, !583, !587}
!539 = !DIGlobalVariable(name: "initialized", scope: !0, file: !384, line: 55, type: !71, isLocal: true, isDefinition: true, variable: i32* @initialized)
!540 = !DIGlobalVariable(name: "StructRUsageType", scope: !0, file: !384, line: 56, type: !541, isLocal: true, isDefinition: true, variable: %struct._typeobject* @StructRUsageType)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !34, line: 422, baseType: !47)
!542 = !DIGlobalVariable(name: "resourcemodule", scope: !0, file: !384, line: 301, type: !543, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @resourcemodule)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !544, line: 47, size: 832, align: 64, elements: !545)
!544 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!545 = !{!546, !555, !556, !557, !558, !561, !562, !563, !564}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !543, file: !544, line: 48, baseType: !547, size: 320, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !544, line: 38, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !544, line: 33, size: 320, align: 64, elements: !549)
!549 = !{!550, !551, !553, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !548, file: !544, line: 34, baseType: !33, size: 128, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !548, file: !544, line: 35, baseType: !552, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !548, file: !544, line: 36, baseType: !38, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !548, file: !544, line: 37, baseType: !32, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !543, file: !544, line: 49, baseType: !56, size: 64, align: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !543, file: !544, line: 50, baseType: !56, size: 64, align: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !543, file: !544, line: 51, baseType: !38, size: 64, align: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !543, file: !544, line: 52, baseType: !559, size: 64, align: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !308, line: 47, baseType: !307)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !543, file: !544, line: 53, baseType: !169, size: 64, align: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !543, file: !544, line: 54, baseType: !286, size: 64, align: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !543, file: !544, line: 55, baseType: !169, size: 64, align: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !543, file: !544, line: 56, baseType: !356, size: 64, align: 64, offset: 768)
!565 = !DIGlobalVariable(name: "resource_methods", scope: !0, file: !384, line: 286, type: !566, isLocal: true, isDefinition: true, variable: [6 x %struct.PyMethodDef]* @resource_methods)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 1536, align: 64, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 6)
!569 = !DIGlobalVariable(name: "struct_rusage_desc", scope: !0, file: !384, line: 48, type: !570, isLocal: true, isDefinition: true, variable: %struct.PyStructSequence_Desc* @struct_rusage_desc)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Desc", file: !571, line: 20, baseType: !572)
!571 = !DIFile(filename: "./Include/structseq.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Desc", file: !571, line: 15, size: 256, align: 64, elements: !573)
!573 = !{!574, !575, !576, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !571, line: 16, baseType: !79, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !572, file: !571, line: 17, baseType: !79, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !572, file: !571, line: 18, baseType: !577, size: 64, align: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Field", file: !571, line: 10, size: 128, align: 64, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !571, line: 11, baseType: !79, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !578, file: !571, line: 12, baseType: !79, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "n_in_sequence", scope: !572, file: !571, line: 19, baseType: !71, size: 32, align: 32, offset: 192)
!583 = !DIGlobalVariable(name: "struct_rusage__doc__", scope: !0, file: !384, line: 21, type: !584, isLocal: true, isDefinition: true, variable: [272 x i8]* @struct_rusage__doc__)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2176, align: 8, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 272)
!587 = !DIGlobalVariable(name: "struct_rusage_fields", scope: !0, file: !384, line: 28, type: !588, isLocal: true, isDefinition: true, variable: [17 x %struct.PyStructSequence_Field]* @struct_rusage_fields)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 2176, align: 64, elements: !590)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Field", file: !571, line: 13, baseType: !578)
!590 = !{!591}
!591 = !DISubrange(count: 17)
!592 = !{i32 2, !"Dwarf Version", i32 4}
!593 = !{i32 2, !"Debug Info Version", i32 3}
!594 = !{i32 1, !"PIC Level", i32 2}
!595 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!596 = !DILocation(line: 316, column: 5, scope: !383)
!597 = !DIExpression()
!598 = !DILocation(line: 316, column: 15, scope: !383)
!599 = !DILocation(line: 316, column: 19, scope: !383)
!600 = !DILocation(line: 319, column: 9, scope: !383)
!601 = !DILocation(line: 319, column: 7, scope: !383)
!602 = !{!603, !603, i64 0}
!603 = !{!"any pointer", !604, i64 0}
!604 = !{!"omnipotent char", !605, i64 0}
!605 = !{!"Simple C/C++ TBAA"}
!606 = !DILocation(line: 320, column: 9, scope: !607)
!607 = distinct !DILexicalBlock(scope: !383, file: !384, line: 320, column: 9)
!608 = !DILocation(line: 320, column: 11, scope: !607)
!609 = !DILocation(line: 320, column: 9, scope: !383)
!610 = !DILocation(line: 321, column: 9, scope: !607)
!611 = !DILocation(line: 324, column: 21, scope: !383)
!612 = !DILocation(line: 324, column: 38, scope: !383)
!613 = !DILocation(line: 324, column: 47, scope: !383)
!614 = !{!615, !616, i64 0}
!615 = !{!"_object", !616, i64 0, !603, i64 8}
!616 = !{!"long", !604, i64 0}
!617 = !DILocation(line: 325, column: 24, scope: !383)
!618 = !DILocation(line: 325, column: 36, scope: !383)
!619 = !DILocation(line: 325, column: 5, scope: !383)
!620 = !DILocation(line: 326, column: 10, scope: !621)
!621 = distinct !DILexicalBlock(scope: !383, file: !384, line: 326, column: 9)
!622 = !{!623, !623, i64 0}
!623 = !{!"int", !604, i64 0}
!624 = !DILocation(line: 326, column: 9, scope: !383)
!625 = !DILocation(line: 327, column: 13, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !384, line: 327, column: 13)
!627 = distinct !DILexicalBlock(scope: !621, file: !384, line: 326, column: 23)
!628 = !DILocation(line: 328, column: 61, scope: !626)
!629 = !DILocation(line: 327, column: 13, scope: !627)
!630 = !DILocation(line: 329, column: 13, scope: !626)
!631 = !DILocation(line: 330, column: 5, scope: !627)
!632 = !DILocation(line: 332, column: 51, scope: !383)
!633 = !DILocation(line: 333, column: 24, scope: !383)
!634 = !DILocation(line: 333, column: 5, scope: !383)
!635 = !DILocation(line: 338, column: 29, scope: !383)
!636 = !DILocation(line: 338, column: 5, scope: !383)
!637 = !DILocation(line: 342, column: 29, scope: !383)
!638 = !DILocation(line: 342, column: 5, scope: !383)
!639 = !DILocation(line: 346, column: 29, scope: !383)
!640 = !DILocation(line: 346, column: 5, scope: !383)
!641 = !DILocation(line: 350, column: 29, scope: !383)
!642 = !DILocation(line: 350, column: 5, scope: !383)
!643 = !DILocation(line: 354, column: 29, scope: !383)
!644 = !DILocation(line: 354, column: 5, scope: !383)
!645 = !DILocation(line: 358, column: 29, scope: !383)
!646 = !DILocation(line: 358, column: 5, scope: !383)
!647 = !DILocation(line: 362, column: 29, scope: !383)
