; ModuleID = 'irs-onlybc/selectmodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !30, subprograms: !448, globals: !900)
!1 = !DIFile(filename: "selectmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !20, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EPOLL_EVENTS", file: !4, line: 40, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/sys/epoll.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!6 = !DIEnumerator(name: "EPOLLIN", value: 1)
!7 = !DIEnumerator(name: "EPOLLPRI", value: 2)
!8 = !DIEnumerator(name: "EPOLLOUT", value: 4)
!9 = !DIEnumerator(name: "EPOLLRDNORM", value: 64)
!10 = !DIEnumerator(name: "EPOLLRDBAND", value: 128)
!11 = !DIEnumerator(name: "EPOLLWRNORM", value: 256)
!12 = !DIEnumerator(name: "EPOLLWRBAND", value: 512)
!13 = !DIEnumerator(name: "EPOLLMSG", value: 1024)
!14 = !DIEnumerator(name: "EPOLLERR", value: 8)
!15 = !DIEnumerator(name: "EPOLLHUP", value: 16)
!16 = !DIEnumerator(name: "EPOLLRDHUP", value: 8192)
!17 = !DIEnumerator(name: "EPOLLWAKEUP", value: 536870912)
!18 = !DIEnumerator(name: "EPOLLONESHOT", value: 1073741824)
!19 = !DIEnumerator(name: "EPOLLET", value: -2147483648)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 23, size: 32, align: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/epoll.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "EPOLL_CLOEXEC", value: 524288)
!24 = !DIEnumerator(name: "EPOLL_NONBLOCK", value: 2048)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !{!28, !29}
!28 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!29 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!30 = !{!31, !32, !377, !385, !386, !395, !403, !71, !405, !123, !104, !424, !121, !38, !415, !421, !425, !427, !433}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !34, line: 109, baseType: !35)
!34 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !34, line: 105, size: 128, align: 64, elements: !36)
!36 = !{!37, !45}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !35, file: !34, line: 107, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !39, line: 177, baseType: !40)
!39 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !41, line: 102, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !43, line: 181, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !35, file: !34, line: 108, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !34, line: 334, size: 3200, align: 64, elements: !48)
!48 = !{!49, !55, !59, !60, !61, !66, !129, !134, !139, !140, !145, !197, !228, !240, !246, !247, !248, !250, !252, !283, !284, !285, !294, !295, !300, !301, !303, !305, !315, !325, !343, !344, !345, !347, !349, !350, !352, !357, !362, !367, !368, !369, !370, !371, !372, !373, !374, !376}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !47, file: !34, line: 335, baseType: !50, size: 192, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !34, line: 114, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 111, size: 192, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !51, file: !34, line: 112, baseType: !33, size: 128, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !51, file: !34, line: 113, baseType: !38, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !47, file: !34, line: 336, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !47, file: !34, line: 337, baseType: !38, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !47, file: !34, line: 337, baseType: !38, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !47, file: !34, line: 341, baseType: !62, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !34, line: 308, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !32}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !47, file: !34, line: 342, baseType: !67, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !34, line: 314, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !32, !72, !71}
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 48, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 246, size: 1728, align: 64, elements: !76)
!75 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!76 = !{!77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !103, !105, !107, !111, !114, !116, !117, !118, !119, !120, !124, !125}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 247, baseType: !71, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 252, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 253, baseType: !79, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 254, baseType: !79, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 255, baseType: !79, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 256, baseType: !79, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 257, baseType: !79, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 258, baseType: !79, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 259, baseType: !79, size: 64, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 261, baseType: !79, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 262, baseType: !79, size: 64, align: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 263, baseType: !79, size: 64, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 265, baseType: !91, size: 64, align: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 161, size: 192, align: 64, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !92, file: !75, line: 162, baseType: !91, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !92, file: !75, line: 163, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !92, file: !75, line: 167, baseType: !71, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 267, baseType: !96, size: 64, align: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 269, baseType: !71, size: 32, align: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 273, baseType: !71, size: 32, align: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 275, baseType: !102, size: 64, align: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 140, baseType: !44)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 279, baseType: !104, size: 16, align: 16, offset: 1024)
!104 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 280, baseType: !106, size: 8, align: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 281, baseType: !108, size: 8, align: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 285, baseType: !112, size: 64, align: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 155, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 294, baseType: !115, size: 64, align: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 141, baseType: !44)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !74, file: !75, line: 303, baseType: !31, size: 64, align: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !74, file: !75, line: 304, baseType: !31, size: 64, align: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !74, file: !75, line: 305, baseType: !31, size: 64, align: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !74, file: !75, line: 306, baseType: !31, size: 64, align: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 307, baseType: !121, size: 64, align: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 62, baseType: !123)
!122 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!123 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 309, baseType: !71, size: 32, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 311, baseType: !126, size: 160, align: 8, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !47, file: !34, line: 343, baseType: !130, size: 64, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !34, line: 316, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!32, !32, !79}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !47, file: !34, line: 344, baseType: !135, size: 64, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !34, line: 318, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!71, !32, !79, !32}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !47, file: !34, line: 345, baseType: !31, size: 64, align: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !47, file: !34, line: 346, baseType: !141, size: 64, align: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !34, line: 320, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!32, !32}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !47, file: !34, line: 350, baseType: !146, size: 64, align: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !34, line: 278, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 236, size: 2176, align: 64, elements: !149)
!149 = !{!150, !155, !156, !157, !158, !159, !164, !166, !167, !168, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !148, file: !34, line: 241, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !34, line: 166, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!32, !32, !32}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !148, file: !34, line: 242, baseType: !151, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !148, file: !34, line: 243, baseType: !151, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !148, file: !34, line: 244, baseType: !151, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !148, file: !34, line: 245, baseType: !151, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !148, file: !34, line: 246, baseType: !160, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !34, line: 167, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!32, !32, !32, !32}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !148, file: !34, line: 247, baseType: !165, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !34, line: 165, baseType: !142)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !148, file: !34, line: 248, baseType: !165, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !148, file: !34, line: 249, baseType: !165, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !148, file: !34, line: 250, baseType: !169, size: 64, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !34, line: 168, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!71, !32}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !148, file: !34, line: 251, baseType: !165, size: 64, align: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !148, file: !34, line: 252, baseType: !151, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !148, file: !34, line: 253, baseType: !151, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !148, file: !34, line: 254, baseType: !151, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !148, file: !34, line: 255, baseType: !151, size: 64, align: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !148, file: !34, line: 256, baseType: !151, size: 64, align: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !148, file: !34, line: 257, baseType: !165, size: 64, align: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !148, file: !34, line: 258, baseType: !31, size: 64, align: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !148, file: !34, line: 259, baseType: !165, size: 64, align: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !148, file: !34, line: 261, baseType: !151, size: 64, align: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !148, file: !34, line: 262, baseType: !151, size: 64, align: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !148, file: !34, line: 263, baseType: !151, size: 64, align: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !148, file: !34, line: 264, baseType: !151, size: 64, align: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !148, file: !34, line: 265, baseType: !160, size: 64, align: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !148, file: !34, line: 266, baseType: !151, size: 64, align: 64, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !148, file: !34, line: 267, baseType: !151, size: 64, align: 64, offset: 1600)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !148, file: !34, line: 268, baseType: !151, size: 64, align: 64, offset: 1664)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !148, file: !34, line: 269, baseType: !151, size: 64, align: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !148, file: !34, line: 270, baseType: !151, size: 64, align: 64, offset: 1792)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !148, file: !34, line: 272, baseType: !151, size: 64, align: 64, offset: 1856)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !148, file: !34, line: 273, baseType: !151, size: 64, align: 64, offset: 1920)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !148, file: !34, line: 274, baseType: !151, size: 64, align: 64, offset: 1984)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !148, file: !34, line: 275, baseType: !151, size: 64, align: 64, offset: 2048)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !148, file: !34, line: 277, baseType: !165, size: 64, align: 64, offset: 2112)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !47, file: !34, line: 351, baseType: !198, size: 64, align: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !34, line: 292, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 280, size: 640, align: 64, elements: !201)
!201 = !{!202, !207, !208, !213, !214, !215, !220, !221, !226, !227}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !200, file: !34, line: 281, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !34, line: 169, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!38, !32}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !200, file: !34, line: 282, baseType: !151, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !200, file: !34, line: 283, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !34, line: 170, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!32, !32, !38}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !200, file: !34, line: 284, baseType: !209, size: 64, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !200, file: !34, line: 285, baseType: !31, size: 64, align: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !200, file: !34, line: 286, baseType: !216, size: 64, align: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !34, line: 172, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!71, !32, !38, !32}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !200, file: !34, line: 287, baseType: !31, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !200, file: !34, line: 288, baseType: !222, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !34, line: 231, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!71, !32, !32}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !200, file: !34, line: 290, baseType: !151, size: 64, align: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !200, file: !34, line: 291, baseType: !209, size: 64, align: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !47, file: !34, line: 352, baseType: !229, size: 64, align: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !34, line: 298, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 294, size: 192, align: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !231, file: !34, line: 295, baseType: !203, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !231, file: !34, line: 296, baseType: !151, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !231, file: !34, line: 297, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !34, line: 174, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!71, !32, !32, !32}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !47, file: !34, line: 356, baseType: !241, size: 64, align: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !34, line: 321, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !32}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !39, line: 186, baseType: !38)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !47, file: !34, line: 357, baseType: !160, size: 64, align: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !47, file: !34, line: 358, baseType: !141, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !47, file: !34, line: 359, baseType: !249, size: 64, align: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !34, line: 317, baseType: !152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !47, file: !34, line: 360, baseType: !251, size: 64, align: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !34, line: 319, baseType: !237)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !47, file: !34, line: 363, baseType: !253, size: 64, align: 64, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !34, line: 304, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 301, size: 128, align: 64, elements: !256)
!256 = !{!257, !278}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !255, file: !34, line: 302, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !34, line: 193, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!71, !32, !262, !71}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !34, line: 191, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !34, line: 178, size: 640, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !275, !276, !277}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !264, file: !34, line: 179, baseType: !31, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !264, file: !34, line: 180, baseType: !32, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !264, file: !34, line: 181, baseType: !38, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !264, file: !34, line: 182, baseType: !38, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !264, file: !34, line: 184, baseType: !71, size: 32, align: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !264, file: !34, line: 185, baseType: !71, size: 32, align: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !264, file: !34, line: 186, baseType: !79, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !264, file: !34, line: 187, baseType: !274, size: 64, align: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !264, file: !34, line: 188, baseType: !274, size: 64, align: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !264, file: !34, line: 189, baseType: !274, size: 64, align: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !264, file: !34, line: 190, baseType: !31, size: 64, align: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !255, file: !34, line: 303, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !34, line: 194, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !32, !262}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !47, file: !34, line: 366, baseType: !123, size: 64, align: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !47, file: !34, line: 368, baseType: !56, size: 64, align: 64, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !47, file: !34, line: 372, baseType: !286, size: 64, align: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !34, line: 233, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!71, !32, !290, !31}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !34, line: 232, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!71, !32, !31}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !47, file: !34, line: 375, baseType: !169, size: 64, align: 64, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !47, file: !34, line: 379, baseType: !296, size: 64, align: 64, offset: 1600)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !34, line: 322, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!32, !32, !32, !71}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !47, file: !34, line: 382, baseType: !38, size: 64, align: 64, offset: 1664)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !47, file: !34, line: 385, baseType: !302, size: 64, align: 64, offset: 1728)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !34, line: 323, baseType: !142)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !47, file: !34, line: 386, baseType: !304, size: 64, align: 64, offset: 1792)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !34, line: 324, baseType: !142)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !47, file: !34, line: 389, baseType: !306, size: 64, align: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !308, line: 40, size: 256, align: 64, elements: !309)
!308 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!309 = !{!310, !311, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !307, file: !308, line: 41, baseType: !56, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !307, file: !308, line: 42, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !308, line: 18, baseType: !152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !307, file: !308, line: 43, baseType: !71, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !307, file: !308, line: 45, baseType: !56, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !47, file: !34, line: 390, baseType: !316, size: 64, align: 64, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !318, line: 18, size: 320, align: 64, elements: !319)
!318 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!319 = !{!320, !321, !322, !323, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 19, baseType: !79, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !318, line: 20, baseType: !71, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !317, file: !318, line: 21, baseType: !38, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !318, line: 22, baseType: !71, size: 32, align: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !317, file: !318, line: 23, baseType: !79, size: 64, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !47, file: !34, line: 391, baseType: !326, size: 64, align: 64, offset: 1984)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !328, line: 11, size: 320, align: 64, elements: !329)
!328 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!329 = !{!330, !331, !336, !341, !342}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 12, baseType: !79, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !327, file: !328, line: 13, baseType: !332, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !328, line: 8, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!32, !32, !31}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !327, file: !328, line: 14, baseType: !337, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !328, line: 9, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!71, !32, !32, !31}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !327, file: !328, line: 15, baseType: !79, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !327, file: !328, line: 16, baseType: !31, size: 64, align: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !47, file: !34, line: 392, baseType: !46, size: 64, align: 64, offset: 2048)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !47, file: !34, line: 393, baseType: !32, size: 64, align: 64, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !47, file: !34, line: 394, baseType: !346, size: 64, align: 64, offset: 2176)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !34, line: 325, baseType: !161)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !47, file: !34, line: 395, baseType: !348, size: 64, align: 64, offset: 2240)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !34, line: 326, baseType: !237)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !47, file: !34, line: 396, baseType: !38, size: 64, align: 64, offset: 2304)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !47, file: !34, line: 397, baseType: !351, size: 64, align: 64, offset: 2368)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !34, line: 327, baseType: !237)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !47, file: !34, line: 398, baseType: !353, size: 64, align: 64, offset: 2432)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !34, line: 329, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!32, !46, !38}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !47, file: !34, line: 399, baseType: !358, size: 64, align: 64, offset: 2496)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !34, line: 328, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!32, !46, !32, !32}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !47, file: !34, line: 400, baseType: !363, size: 64, align: 64, offset: 2560)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !34, line: 307, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !31}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !47, file: !34, line: 401, baseType: !169, size: 64, align: 64, offset: 2624)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !47, file: !34, line: 402, baseType: !32, size: 64, align: 64, offset: 2688)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !47, file: !34, line: 403, baseType: !32, size: 64, align: 64, offset: 2752)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !47, file: !34, line: 404, baseType: !32, size: 64, align: 64, offset: 2816)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !47, file: !34, line: 405, baseType: !32, size: 64, align: 64, offset: 2880)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !47, file: !34, line: 406, baseType: !32, size: 64, align: 64, offset: 2944)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !47, file: !34, line: 407, baseType: !62, size: 64, align: 64, offset: 3008)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !47, file: !34, line: 410, baseType: !375, size: 32, align: 32, offset: 3072)
!375 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !47, file: !34, line: 412, baseType: !62, size: 64, align: 64, offset: 3136)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !379, line: 30, size: 128, align: 64, elements: !380)
!379 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !378, file: !379, line: 32, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !43, line: 148, baseType: !44)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !378, file: !379, line: 33, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !43, line: 150, baseType: !44)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !388, line: 40, baseType: !389)
!388 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 23, size: 320, align: 64, elements: !390)
!390 = !{!391, !392, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 24, baseType: !50, size: 192, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !389, file: !388, line: 26, baseType: !393, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !389, file: !388, line: 39, baseType: !38, size: 64, align: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !397, line: 33, baseType: !398)
!397 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 25, size: 256, align: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !398, file: !397, line: 26, baseType: !50, size: 192, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !398, file: !397, line: 27, baseType: !402, size: 64, align: 64, offset: 192)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, align: 64, elements: !109)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !404, line: 54, baseType: !44)
!404 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "pollObject", file: !407, line: 332, baseType: !408)
!407 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/selectmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!408 = !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 325, size: 384, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !423}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !408, file: !407, line: 326, baseType: !33, size: 128, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !408, file: !407, line: 327, baseType: !32, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ufd_uptodate", scope: !408, file: !407, line: 328, baseType: !71, size: 32, align: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ufd_len", scope: !408, file: !407, line: 329, baseType: !71, size: 32, align: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !408, file: !407, line: 330, baseType: !415, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !417, line: 39, size: 64, align: 32, elements: !418)
!417 = !DIFile(filename: "/usr/include/sys/poll.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!418 = !{!419, !420, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !416, file: !417, line: 41, baseType: !71, size: 32, align: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !416, file: !417, line: 42, baseType: !421, size: 16, align: 16, offset: 32)
!421 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !416, file: !417, line: 43, baseType: !421, size: 16, align: 16, offset: 48)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "poll_running", scope: !408, file: !407, line: 331, baseType: !71, size: 32, align: 32, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !34, line: 422, baseType: !47)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "pyEpoll_Object", file: !407, line: 1175, baseType: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 1172, size: 192, align: 64, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !429, file: !407, line: 1173, baseType: !33, size: 128, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "epfd", scope: !429, file: !407, line: 1174, baseType: !71, size: 32, align: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 87, size: 96, align: 8, elements: !435)
!435 = !{!436, !439}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !434, file: !4, line: 89, baseType: !437, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !438, line: 51, baseType: !375)
!438 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!439 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !434, file: !4, line: 90, baseType: !440, size: 64, align: 64, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "epoll_data_t", file: !4, line: 85, baseType: !441)
!441 = !DICompositeType(tag: DW_TAG_union_type, name: "epoll_data", file: !4, line: 79, size: 64, align: 64, elements: !442)
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !441, file: !4, line: 81, baseType: !31, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !441, file: !4, line: 82, baseType: !71, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !441, file: !4, line: 83, baseType: !437, size: 32, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !441, file: !4, line: 84, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !438, line: 55, baseType: !123)
!448 = !{!449, !454, !576, !606, !620, !635, !639, !648, !658, !678, !683, !705, !717, !755, !765, !770, !781, !786, !803, !808, !811, !813, !822, !838, !845, !851, !878, !884, !888, !891}
!449 = !DISubprogram(name: "PyInit_select", scope: !407, file: !407, line: 2296, type: !450, isLocal: false, isDefinition: true, scopeLine: 2297, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_select, variables: !452)
!450 = !DISubroutineType(types: !451)
!451 = !{!32}
!452 = !{!453}
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !449, file: !407, line: 2298, type: !32)
!454 = !DISubprogram(name: "select_select", scope: !407, file: !407, line: 179, type: !153, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @select_select, variables: !455)
!455 = !{!456, !457, !458, !468, !469, !470, !471, !472, !473, !474, !475, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !498, !499, !559, !563, !566, !568, !571, !573}
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !454, file: !407, line: 179, type: !32)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !454, file: !407, line: 179, type: !32)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rfd2obj", scope: !454, file: !407, line: 190, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 131200, align: 64, elements: !466)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "pylist", file: !407, line: 62, baseType: !461)
!461 = !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 58, size: 128, align: 64, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !461, file: !407, line: 59, baseType: !32, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !461, file: !407, line: 60, baseType: !71, size: 32, align: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !461, file: !407, line: 61, baseType: !71, size: 32, align: 32, offset: 96)
!466 = !{!467}
!467 = !DISubrange(count: 1025)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wfd2obj", scope: !454, file: !407, line: 191, type: !459)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "efd2obj", scope: !454, file: !407, line: 192, type: !459)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ifdlist", scope: !454, file: !407, line: 194, type: !32)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ofdlist", scope: !454, file: !407, line: 194, type: !32)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "efdlist", scope: !454, file: !407, line: 194, type: !32)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !454, file: !407, line: 195, type: !32)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tout", scope: !454, file: !407, line: 196, type: !32)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ifdset", scope: !454, file: !407, line: 197, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !404, line: 75, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 64, size: 1024, align: 64, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !477, file: !404, line: 69, baseType: !480, size: 1024, align: 64)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 1024, align: 64, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 16)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ofdset", scope: !454, file: !407, line: 197, type: !476)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "efdset", scope: !454, file: !407, line: 197, type: !476)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tv", scope: !454, file: !407, line: 198, type: !378)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tvp", scope: !454, file: !407, line: 198, type: !377)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "imax", scope: !454, file: !407, line: 199, type: !71)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "omax", scope: !454, file: !407, line: 199, type: !71)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "emax", scope: !454, file: !407, line: 199, type: !71)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !454, file: !407, line: 199, type: !71)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !454, file: !407, line: 200, type: !71)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sec", scope: !493, file: !407, line: 217, type: !496)
!493 = distinct !DILexicalBlock(scope: !494, file: !407, line: 214, column: 10)
!494 = distinct !DILexicalBlock(scope: !495, file: !407, line: 209, column: 14)
!495 = distinct !DILexicalBlock(scope: !454, file: !407, line: 207, column: 9)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !497, line: 75, baseType: !382)
!497 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usec", scope: !493, file: !407, line: 220, type: !44)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !500, file: !407, line: 277, type: !501)
!500 = distinct !DILexicalBlock(scope: !454, file: !407, line: 277, column: 5)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !503, line: 139, baseType: !504)
!503 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !503, line: 69, size: 1536, align: 64, elements: !505)
!505 = !{!506, !508, !509, !529, !532, !533, !534, !535, !536, !537, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !503, line: 72, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !503, line: 73, baseType: !507, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !504, file: !503, line: 74, baseType: !510, size: 64, align: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !503, line: 44, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !503, line: 19, size: 832, align: 64, elements: !513)
!513 = !{!514, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !503, line: 21, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !512, file: !503, line: 22, baseType: !507, size: 64, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !512, file: !503, line: 24, baseType: !32, size: 64, align: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !512, file: !503, line: 25, baseType: !32, size: 64, align: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !512, file: !503, line: 26, baseType: !32, size: 64, align: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !512, file: !503, line: 27, baseType: !32, size: 64, align: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !512, file: !503, line: 28, baseType: !32, size: 64, align: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !512, file: !503, line: 30, baseType: !32, size: 64, align: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !512, file: !503, line: 31, baseType: !32, size: 64, align: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !512, file: !503, line: 32, baseType: !32, size: 64, align: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !512, file: !503, line: 33, baseType: !71, size: 32, align: 32, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !512, file: !503, line: 34, baseType: !71, size: 32, align: 32, offset: 672)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !512, file: !503, line: 37, baseType: !71, size: 32, align: 32, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !512, file: !503, line: 43, baseType: !32, size: 64, align: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !504, file: !503, line: 76, baseType: !530, size: 64, align: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !503, line: 50, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !504, file: !503, line: 77, baseType: !71, size: 32, align: 32, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !504, file: !503, line: 78, baseType: !58, size: 8, align: 8, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !504, file: !503, line: 80, baseType: !58, size: 8, align: 8, offset: 296)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !504, file: !503, line: 85, baseType: !71, size: 32, align: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !504, file: !503, line: 86, baseType: !71, size: 32, align: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !504, file: !503, line: 88, baseType: !538, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !503, line: 54, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!71, !32, !530, !71, !32}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !504, file: !503, line: 89, baseType: !538, size: 64, align: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !504, file: !503, line: 90, baseType: !32, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !504, file: !503, line: 91, baseType: !32, size: 64, align: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !504, file: !503, line: 93, baseType: !32, size: 64, align: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !504, file: !503, line: 94, baseType: !32, size: 64, align: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !504, file: !503, line: 95, baseType: !32, size: 64, align: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !504, file: !503, line: 97, baseType: !32, size: 64, align: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !504, file: !503, line: 98, baseType: !32, size: 64, align: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !504, file: !503, line: 99, baseType: !32, size: 64, align: 64, offset: 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !504, file: !503, line: 101, baseType: !32, size: 64, align: 64, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !504, file: !503, line: 103, baseType: !71, size: 32, align: 32, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !504, file: !503, line: 105, baseType: !32, size: 64, align: 64, offset: 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !504, file: !503, line: 106, baseType: !44, size: 64, align: 64, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !504, file: !503, line: 108, baseType: !71, size: 32, align: 32, offset: 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !504, file: !503, line: 109, baseType: !32, size: 64, align: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !504, file: !503, line: 134, baseType: !364, size: 64, align: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !504, file: !503, line: 135, baseType: !31, size: 64, align: 64, offset: 1472)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !560, file: !407, line: 303, type: !32)
!560 = distinct !DILexicalBlock(scope: !561, file: !407, line: 303, column: 12)
!561 = distinct !DILexicalBlock(scope: !562, file: !407, line: 290, column: 10)
!562 = distinct !DILexicalBlock(scope: !454, file: !407, line: 286, column: 9)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !407, line: 303, type: !32)
!564 = distinct !DILexicalBlock(scope: !565, file: !407, line: 303, column: 103)
!565 = distinct !DILexicalBlock(scope: !560, file: !407, line: 303, column: 69)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !567, file: !407, line: 304, type: !32)
!567 = distinct !DILexicalBlock(scope: !561, file: !407, line: 304, column: 12)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !407, line: 304, type: !32)
!569 = distinct !DILexicalBlock(scope: !570, file: !407, line: 304, column: 103)
!570 = distinct !DILexicalBlock(scope: !567, file: !407, line: 304, column: 69)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !572, file: !407, line: 305, type: !32)
!572 = distinct !DILexicalBlock(scope: !561, file: !407, line: 305, column: 12)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !407, line: 305, type: !32)
!574 = distinct !DILexicalBlock(scope: !575, file: !407, line: 305, column: 103)
!575 = distinct !DILexicalBlock(scope: !572, file: !407, line: 305, column: 69)
!576 = !DISubprogram(name: "seq2set", scope: !407, file: !407, line: 79, type: !577, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.fd_set*, %struct.pylist*)* @seq2set, variables: !581)
!577 = !DISubroutineType(types: !578)
!578 = !{!71, !32, !579, !580}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !592, !593, !597, !599, !601, !604}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seq", arg: 1, scope: !576, file: !407, line: 79, type: !32)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 2, scope: !576, file: !407, line: 79, type: !579)
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd2obj", arg: 3, scope: !576, file: !407, line: 79, type: !580)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !576, file: !407, line: 81, type: !71)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !576, file: !407, line: 82, type: !71)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !576, file: !407, line: 83, type: !38)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fast_seq", scope: !576, file: !407, line: 84, type: !32)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !576, file: !407, line: 85, type: !32)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__d0", scope: !591, file: !407, line: 88, type: !71)
!591 = distinct !DILexicalBlock(scope: !576, file: !407, line: 88, column: 8)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__d1", scope: !591, file: !407, line: 88, type: !71)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !594, file: !407, line: 95, type: !71)
!594 = distinct !DILexicalBlock(scope: !595, file: !407, line: 94, column: 181)
!595 = distinct !DILexicalBlock(scope: !596, file: !407, line: 94, column: 5)
!596 = distinct !DILexicalBlock(scope: !576, file: !407, line: 94, column: 5)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !407, line: 129, type: !32)
!598 = distinct !DILexicalBlock(scope: !576, file: !407, line: 129, column: 8)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !600, file: !407, line: 133, type: !32)
!600 = distinct !DILexicalBlock(scope: !576, file: !407, line: 133, column: 8)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !602, file: !407, line: 133, type: !32)
!602 = distinct !DILexicalBlock(scope: !603, file: !407, line: 133, column: 93)
!603 = distinct !DILexicalBlock(scope: !600, file: !407, line: 133, column: 59)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !407, line: 134, type: !32)
!605 = distinct !DILexicalBlock(scope: !576, file: !407, line: 134, column: 8)
!606 = !DISubprogram(name: "set2list", scope: !407, file: !407, line: 140, type: !607, isLocal: true, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fd_set*, %struct.pylist*)* @set2list, variables: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{!32, !579, !580}
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618}
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 1, scope: !606, file: !407, line: 140, type: !579)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd2obj", arg: 2, scope: !606, file: !407, line: 140, type: !580)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !606, file: !407, line: 142, type: !71)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !606, file: !407, line: 142, type: !71)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !606, file: !407, line: 142, type: !71)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !606, file: !407, line: 143, type: !32)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !606, file: !407, line: 143, type: !32)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !606, file: !407, line: 144, type: !71)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !619, file: !407, line: 169, type: !32)
!619 = distinct !DILexicalBlock(scope: !606, file: !407, line: 169, column: 8)
!620 = !DISubprogram(name: "reap_obj", scope: !407, file: !407, line: 65, type: !621, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pylist*)* @reap_obj, variables: !623)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !580}
!623 = !{!624, !625, !626, !631}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd2obj", arg: 1, scope: !620, file: !407, line: 65, type: !580)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !620, file: !407, line: 67, type: !71)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !627, file: !407, line: 69, type: !32)
!627 = distinct !DILexicalBlock(scope: !628, file: !407, line: 69, column: 12)
!628 = distinct !DILexicalBlock(scope: !629, file: !407, line: 68, column: 63)
!629 = distinct !DILexicalBlock(scope: !630, file: !407, line: 68, column: 5)
!630 = distinct !DILexicalBlock(scope: !620, file: !407, line: 68, column: 5)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !407, line: 69, type: !32)
!632 = distinct !DILexicalBlock(scope: !633, file: !407, line: 69, column: 125)
!633 = distinct !DILexicalBlock(scope: !634, file: !407, line: 69, column: 90)
!634 = distinct !DILexicalBlock(scope: !627, file: !407, line: 69, column: 67)
!635 = !DISubprogram(name: "select_poll", scope: !407, file: !407, line: 1110, type: !153, isLocal: true, isDefinition: true, scopeLine: 1111, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @select_poll, variables: !636)
!636 = !{!637, !638}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !635, file: !407, line: 1110, type: !32)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !635, file: !407, line: 1110, type: !32)
!639 = !DISubprogram(name: "newPollObject", scope: !407, file: !407, line: 632, type: !640, isLocal: true, isDefinition: true, scopeLine: 633, flags: DIFlagPrototyped, isOptimized: true, function: %struct.pollObject* ()* @newPollObject, variables: !642)
!640 = !DISubroutineType(types: !641)
!641 = !{!405}
!642 = !{!643, !644}
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !639, file: !407, line: 634, type: !405)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !645, file: !407, line: 645, type: !32)
!645 = distinct !DILexicalBlock(scope: !646, file: !407, line: 645, column: 12)
!646 = distinct !DILexicalBlock(scope: !647, file: !407, line: 644, column: 35)
!647 = distinct !DILexicalBlock(scope: !639, file: !407, line: 644, column: 9)
!648 = !DISubprogram(name: "poll_dealloc", scope: !407, file: !407, line: 652, type: !649, isLocal: true, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pollObject*)* @poll_dealloc, variables: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !405}
!651 = !{!652, !653, !655}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !648, file: !407, line: 652, type: !405)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !654, file: !407, line: 656, type: !32)
!654 = distinct !DILexicalBlock(scope: !648, file: !407, line: 656, column: 8)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !407, line: 656, type: !32)
!656 = distinct !DILexicalBlock(scope: !657, file: !407, line: 656, column: 102)
!657 = distinct !DILexicalBlock(scope: !654, file: !407, line: 656, column: 68)
!658 = !DISubprogram(name: "poll_register", scope: !407, file: !407, line: 394, type: !659, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pollObject*, %struct._object*)* @poll_register, variables: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{!32, !405, !32}
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !674, !676}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !658, file: !407, line: 394, type: !405)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !658, file: !407, line: 394, type: !32)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !658, file: !407, line: 396, type: !32)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !658, file: !407, line: 396, type: !32)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !658, file: !407, line: 396, type: !32)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !658, file: !407, line: 397, type: !71)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "events", scope: !658, file: !407, line: 398, type: !104)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !658, file: !407, line: 399, type: !71)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !407, line: 414, type: !32)
!671 = distinct !DILexicalBlock(scope: !672, file: !407, line: 414, column: 12)
!672 = distinct !DILexicalBlock(scope: !673, file: !407, line: 413, column: 30)
!673 = distinct !DILexicalBlock(scope: !658, file: !407, line: 413, column: 9)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !675, file: !407, line: 418, type: !32)
!675 = distinct !DILexicalBlock(scope: !658, file: !407, line: 418, column: 8)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !407, line: 419, type: !32)
!677 = distinct !DILexicalBlock(scope: !658, file: !407, line: 419, column: 8)
!678 = !DISubprogram(name: "ushort_converter", scope: !407, file: !407, line: 369, type: !292, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @ushort_converter, variables: !679)
!679 = !{!680, !681, !682}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !678, file: !407, line: 369, type: !32)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 2, scope: !678, file: !407, line: 369, type: !31)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uval", scope: !678, file: !407, line: 371, type: !123)
!683 = !DISubprogram(name: "poll_modify", scope: !407, file: !407, line: 437, type: !659, isLocal: true, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pollObject*, %struct._object*)* @poll_modify, variables: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !697, !701, !703}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !683, file: !407, line: 437, type: !405)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !683, file: !407, line: 437, type: !32)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !683, file: !407, line: 439, type: !32)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !683, file: !407, line: 439, type: !32)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !683, file: !407, line: 439, type: !32)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !683, file: !407, line: 440, type: !71)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "events", scope: !683, file: !407, line: 441, type: !104)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !683, file: !407, line: 442, type: !71)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !407, line: 457, type: !32)
!694 = distinct !DILexicalBlock(scope: !695, file: !407, line: 457, column: 12)
!695 = distinct !DILexicalBlock(scope: !696, file: !407, line: 454, column: 56)
!696 = distinct !DILexicalBlock(scope: !683, file: !407, line: 454, column: 9)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !407, line: 462, type: !32)
!698 = distinct !DILexicalBlock(scope: !699, file: !407, line: 462, column: 12)
!699 = distinct !DILexicalBlock(scope: !700, file: !407, line: 461, column: 30)
!700 = distinct !DILexicalBlock(scope: !683, file: !407, line: 461, column: 9)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !702, file: !407, line: 466, type: !32)
!702 = distinct !DILexicalBlock(scope: !683, file: !407, line: 466, column: 8)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !407, line: 467, type: !32)
!704 = distinct !DILexicalBlock(scope: !683, file: !407, line: 467, column: 8)
!705 = !DISubprogram(name: "poll_unregister", scope: !407, file: !407, line: 483, type: !659, isLocal: true, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pollObject*, %struct._object*)* @poll_unregister, variables: !706)
!706 = !{!707, !708, !709, !710, !711, !715}
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !705, file: !407, line: 483, type: !405)
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 2, scope: !705, file: !407, line: 483, type: !32)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !705, file: !407, line: 485, type: !32)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !705, file: !407, line: 486, type: !71)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !407, line: 498, type: !32)
!712 = distinct !DILexicalBlock(scope: !713, file: !407, line: 498, column: 12)
!713 = distinct !DILexicalBlock(scope: !714, file: !407, line: 497, column: 48)
!714 = distinct !DILexicalBlock(scope: !705, file: !407, line: 497, column: 9)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !407, line: 504, type: !32)
!716 = distinct !DILexicalBlock(scope: !705, file: !407, line: 504, column: 8)
!717 = !DISubprogram(name: "poll_poll", scope: !407, file: !407, line: 517, type: !659, isLocal: true, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pollObject*, %struct._object*)* @poll_poll, variables: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !734, !736, !745, !749, !753}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !717, file: !407, line: 517, type: !405)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !717, file: !407, line: 517, type: !32)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_list", scope: !717, file: !407, line: 519, type: !32)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tout", scope: !717, file: !407, line: 519, type: !32)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !717, file: !407, line: 520, type: !71)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "poll_result", scope: !717, file: !407, line: 520, type: !71)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !717, file: !407, line: 520, type: !71)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !717, file: !407, line: 520, type: !71)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !717, file: !407, line: 521, type: !32)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !717, file: !407, line: 521, type: !32)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !407, line: 540, type: !32)
!730 = distinct !DILexicalBlock(scope: !731, file: !407, line: 540, column: 12)
!731 = distinct !DILexicalBlock(scope: !732, file: !407, line: 535, column: 10)
!732 = distinct !DILexicalBlock(scope: !733, file: !407, line: 530, column: 14)
!733 = distinct !DILexicalBlock(scope: !717, file: !407, line: 528, column: 9)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !735, file: !407, line: 560, type: !501)
!735 = distinct !DILexicalBlock(scope: !717, file: !407, line: 560, column: 5)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !737, file: !407, line: 590, type: !32)
!737 = distinct !DILexicalBlock(scope: !738, file: !407, line: 590, column: 20)
!738 = distinct !DILexicalBlock(scope: !739, file: !407, line: 589, column: 36)
!739 = distinct !DILexicalBlock(scope: !740, file: !407, line: 589, column: 17)
!740 = distinct !DILexicalBlock(scope: !741, file: !407, line: 577, column: 50)
!741 = distinct !DILexicalBlock(scope: !742, file: !407, line: 577, column: 9)
!742 = distinct !DILexicalBlock(scope: !743, file: !407, line: 577, column: 9)
!743 = distinct !DILexicalBlock(scope: !744, file: !407, line: 576, column: 10)
!744 = distinct !DILexicalBlock(scope: !717, file: !407, line: 574, column: 9)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !746, file: !407, line: 601, type: !32)
!746 = distinct !DILexicalBlock(scope: !747, file: !407, line: 601, column: 20)
!747 = distinct !DILexicalBlock(scope: !748, file: !407, line: 600, column: 36)
!748 = distinct !DILexicalBlock(scope: !740, file: !407, line: 600, column: 17)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !750, file: !407, line: 606, type: !32)
!750 = distinct !DILexicalBlock(scope: !751, file: !407, line: 606, column: 20)
!751 = distinct !DILexicalBlock(scope: !752, file: !407, line: 605, column: 64)
!752 = distinct !DILexicalBlock(scope: !740, file: !407, line: 605, column: 17)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !754, file: !407, line: 615, type: !32)
!754 = distinct !DILexicalBlock(scope: !717, file: !407, line: 615, column: 8)
!755 = !DISubprogram(name: "update_ufd_array", scope: !407, file: !407, line: 341, type: !756, isLocal: true, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pollObject*)* @update_ufd_array, variables: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{!71, !405}
!758 = !{!759, !760, !761, !762, !763, !764}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !755, file: !407, line: 341, type: !405)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !755, file: !407, line: 343, type: !38)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !755, file: !407, line: 343, type: !38)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !755, file: !407, line: 344, type: !32)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !755, file: !407, line: 344, type: !32)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_ufds", scope: !755, file: !407, line: 345, type: !415)
!765 = !DISubprogram(name: "pyepoll_dealloc", scope: !407, file: !407, line: 1262, type: !766, isLocal: true, isDefinition: true, scopeLine: 1263, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pyEpoll_Object*)* @pyepoll_dealloc, variables: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !427}
!768 = !{!769}
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !765, file: !407, line: 1262, type: !427)
!770 = !DISubprogram(name: "pyepoll_internal_close", scope: !407, file: !407, line: 1188, type: !771, isLocal: true, isDefinition: true, scopeLine: 1189, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pyEpoll_Object*)* @pyepoll_internal_close, variables: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!71, !427}
!773 = !{!774, !775, !776, !779}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !770, file: !407, line: 1188, type: !427)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !770, file: !407, line: 1190, type: !71)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "epfd", scope: !777, file: !407, line: 1192, type: !71)
!777 = distinct !DILexicalBlock(scope: !778, file: !407, line: 1191, column: 26)
!778 = distinct !DILexicalBlock(scope: !770, file: !407, line: 1191, column: 9)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !780, file: !407, line: 1194, type: !501)
!780 = distinct !DILexicalBlock(scope: !777, file: !407, line: 1194, column: 9)
!781 = !DISubprogram(name: "pyepoll_fromfd", scope: !407, file: !407, line: 1308, type: !153, isLocal: true, isDefinition: true, scopeLine: 1309, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @pyepoll_fromfd, variables: !782)
!782 = !{!783, !784, !785}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !781, file: !407, line: 1308, type: !32)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !781, file: !407, line: 1308, type: !32)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !781, file: !407, line: 1310, type: !71)
!786 = !DISubprogram(name: "newPyEpoll_Object", scope: !407, file: !407, line: 1203, type: !787, isLocal: true, isDefinition: true, scopeLine: 1204, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, i32, i32, i32)* @newPyEpoll_Object, variables: !789)
!787 = !DISubroutineType(types: !788)
!788 = !{!32, !425, !71, !71, !71}
!789 = !{!790, !791, !792, !793, !794, !795, !799}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !786, file: !407, line: 1203, type: !425)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sizehint", arg: 2, scope: !786, file: !407, line: 1203, type: !71)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !786, file: !407, line: 1203, type: !71)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 4, scope: !786, file: !407, line: 1203, type: !71)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !786, file: !407, line: 1205, type: !427)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !796, file: !407, line: 1213, type: !501)
!796 = distinct !DILexicalBlock(scope: !797, file: !407, line: 1213, column: 9)
!797 = distinct !DILexicalBlock(scope: !798, file: !407, line: 1212, column: 19)
!798 = distinct !DILexicalBlock(scope: !786, file: !407, line: 1212, column: 9)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !800, file: !407, line: 1227, type: !32)
!800 = distinct !DILexicalBlock(scope: !801, file: !407, line: 1227, column: 12)
!801 = distinct !DILexicalBlock(scope: !802, file: !407, line: 1226, column: 25)
!802 = distinct !DILexicalBlock(scope: !786, file: !407, line: 1226, column: 9)
!803 = !DISubprogram(name: "pyepoll_close", scope: !407, file: !407, line: 1269, type: !804, isLocal: true, isDefinition: true, scopeLine: 1270, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*)* @pyepoll_close, variables: !806)
!804 = !DISubroutineType(types: !805)
!805 = !{!32, !427}
!806 = !{!807}
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !803, file: !407, line: 1269, type: !427)
!808 = !DISubprogram(name: "pyepoll_fileno", scope: !407, file: !407, line: 1295, type: !804, isLocal: true, isDefinition: true, scopeLine: 1296, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*)* @pyepoll_fileno, variables: !809)
!809 = !{!810}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !808, file: !407, line: 1295, type: !427)
!811 = !DISubprogram(name: "pyepoll_err_closed", scope: !407, file: !407, line: 1181, type: !450, isLocal: true, isDefinition: true, scopeLine: 1182, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @pyepoll_err_closed, variables: !812)
!812 = !{}
!813 = !DISubprogram(name: "pyepoll_modify", scope: !407, file: !407, line: 1398, type: !814, isLocal: true, isDefinition: true, scopeLine: 1399, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*, %struct._object*, %struct._object*)* @pyepoll_modify, variables: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{!32, !427, !32, !32}
!816 = !{!817, !818, !819, !820, !821}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !813, file: !407, line: 1398, type: !427)
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !813, file: !407, line: 1398, type: !32)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !813, file: !407, line: 1398, type: !32)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pfd", scope: !813, file: !407, line: 1400, type: !32)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "events", scope: !813, file: !407, line: 1401, type: !375)
!822 = !DISubprogram(name: "pyepoll_internal_ctl", scope: !407, file: !407, line: 1324, type: !823, isLocal: true, isDefinition: true, scopeLine: 1325, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, i32, %struct._object*, i32)* @pyepoll_internal_ctl, variables: !825)
!823 = !DISubroutineType(types: !824)
!824 = !{!32, !71, !71, !32, !375}
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !836}
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "epfd", arg: 1, scope: !822, file: !407, line: 1324, type: !71)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 2, scope: !822, file: !407, line: 1324, type: !71)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pfd", arg: 3, scope: !822, file: !407, line: 1324, type: !32)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "events", arg: 4, scope: !822, file: !407, line: 1324, type: !375)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ev", scope: !822, file: !407, line: 1326, type: !434)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !822, file: !407, line: 1327, type: !71)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !822, file: !407, line: 1328, type: !71)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !834, file: !407, line: 1343, type: !501)
!834 = distinct !DILexicalBlock(scope: !835, file: !407, line: 1343, column: 9)
!835 = distinct !DILexicalBlock(scope: !822, file: !407, line: 1338, column: 17)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !837, file: !407, line: 1351, type: !501)
!837 = distinct !DILexicalBlock(scope: !835, file: !407, line: 1351, column: 9)
!838 = !DISubprogram(name: "pyepoll_register", scope: !407, file: !407, line: 1373, type: !814, isLocal: true, isDefinition: true, scopeLine: 1374, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*, %struct._object*, %struct._object*)* @pyepoll_register, variables: !839)
!839 = !{!840, !841, !842, !843, !844}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !838, file: !407, line: 1373, type: !427)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !838, file: !407, line: 1373, type: !32)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !838, file: !407, line: 1373, type: !32)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pfd", scope: !838, file: !407, line: 1375, type: !32)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "events", scope: !838, file: !407, line: 1376, type: !375)
!845 = !DISubprogram(name: "pyepoll_unregister", scope: !407, file: !407, line: 1419, type: !814, isLocal: true, isDefinition: true, scopeLine: 1420, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*, %struct._object*, %struct._object*)* @pyepoll_unregister, variables: !846)
!846 = !{!847, !848, !849, !850}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !845, file: !407, line: 1419, type: !427)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !845, file: !407, line: 1419, type: !32)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !845, file: !407, line: 1419, type: !32)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pfd", scope: !845, file: !407, line: 1421, type: !32)
!851 = !DISubprogram(name: "pyepoll_poll", scope: !407, file: !407, line: 1438, type: !814, isLocal: true, isDefinition: true, scopeLine: 1439, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*, %struct._object*, %struct._object*)* @pyepoll_poll, variables: !852)
!852 = !{!853, !854, !855, !856, !858, !859, !860, !861, !862, !863, !864, !865, !867, !874}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !851, file: !407, line: 1438, type: !427)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !851, file: !407, line: 1438, type: !32)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !851, file: !407, line: 1438, type: !32)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dtimeout", scope: !851, file: !407, line: 1440, type: !857)
!857 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !851, file: !407, line: 1441, type: !71)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxevents", scope: !851, file: !407, line: 1442, type: !71)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfds", scope: !851, file: !407, line: 1443, type: !71)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !851, file: !407, line: 1443, type: !71)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elist", scope: !851, file: !407, line: 1444, type: !32)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "etuple", scope: !851, file: !407, line: 1444, type: !32)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "evs", scope: !851, file: !407, line: 1445, type: !433)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !866, file: !407, line: 1486, type: !501)
!866 = distinct !DILexicalBlock(scope: !851, file: !407, line: 1486, column: 5)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !868, file: !407, line: 1502, type: !32)
!868 = distinct !DILexicalBlock(scope: !869, file: !407, line: 1502, column: 16)
!869 = distinct !DILexicalBlock(scope: !870, file: !407, line: 1501, column: 35)
!870 = distinct !DILexicalBlock(scope: !871, file: !407, line: 1501, column: 13)
!871 = distinct !DILexicalBlock(scope: !872, file: !407, line: 1499, column: 32)
!872 = distinct !DILexicalBlock(scope: !873, file: !407, line: 1499, column: 5)
!873 = distinct !DILexicalBlock(scope: !851, file: !407, line: 1499, column: 5)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !407, line: 1502, type: !32)
!875 = distinct !DILexicalBlock(scope: !876, file: !407, line: 1502, column: 113)
!876 = distinct !DILexicalBlock(scope: !877, file: !407, line: 1502, column: 86)
!877 = distinct !DILexicalBlock(scope: !868, file: !407, line: 1502, column: 63)
!878 = !DISubprogram(name: "pyepoll_enter", scope: !407, file: !407, line: 1521, type: !879, isLocal: true, isDefinition: true, scopeLine: 1522, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*, %struct._object*)* @pyepoll_enter, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!32, !427, !32}
!881 = !{!882, !883}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !878, file: !407, line: 1521, type: !427)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !878, file: !407, line: 1521, type: !32)
!884 = !DISubprogram(name: "pyepoll_exit", scope: !407, file: !407, line: 1531, type: !153, isLocal: true, isDefinition: true, scopeLine: 1532, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @pyepoll_exit, variables: !885)
!885 = !{!886, !887}
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !884, file: !407, line: 1531, type: !32)
!887 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !884, file: !407, line: 1531, type: !32)
!888 = !DISubprogram(name: "pyepoll_get_closed", scope: !407, file: !407, line: 1286, type: !804, isLocal: true, isDefinition: true, scopeLine: 1287, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pyEpoll_Object*)* @pyepoll_get_closed, variables: !889)
!889 = !{!890}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !888, file: !407, line: 1286, type: !427)
!891 = !DISubprogram(name: "pyepoll_new", scope: !407, file: !407, line: 1244, type: !892, isLocal: true, isDefinition: true, scopeLine: 1245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @pyepoll_new, variables: !894)
!892 = !DISubroutineType(types: !893)
!893 = !{!32, !425, !32, !32}
!894 = !{!895, !896, !897, !898, !899}
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !891, file: !407, line: 1244, type: !425)
!896 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !891, file: !407, line: 1244, type: !32)
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !891, file: !407, line: 1244, type: !32)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !891, file: !407, line: 1246, type: !71)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sizehint", scope: !891, file: !407, line: 1246, type: !71)
!900 = !{!901, !924, !928, !932, !936, !940, !941, !945, !949, !953, !957, !961, !962, !966, !970, !974, !978, !982, !984, !988, !989, !993, !997, !1001, !1002, !1006, !1014, !1017}
!901 = !DIGlobalVariable(name: "selectmodule", scope: !0, file: !407, line: 2280, type: !902, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @selectmodule)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !903, line: 47, size: 832, align: 64, elements: !904)
!903 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!904 = !{!905, !914, !915, !916, !917, !920, !921, !922, !923}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !902, file: !903, line: 48, baseType: !906, size: 320, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !903, line: 38, baseType: !907)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !903, line: 33, size: 320, align: 64, elements: !908)
!908 = !{!909, !910, !912, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !907, file: !903, line: 34, baseType: !33, size: 128, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !907, file: !903, line: 35, baseType: !911, size: 64, align: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !907, file: !903, line: 36, baseType: !38, size: 64, align: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !907, file: !903, line: 37, baseType: !32, size: 64, align: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !902, file: !903, line: 49, baseType: !56, size: 64, align: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !902, file: !903, line: 50, baseType: !56, size: 64, align: 64, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !902, file: !903, line: 51, baseType: !38, size: 64, align: 64, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !902, file: !903, line: 52, baseType: !918, size: 64, align: 64, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
