; ModuleID = 'programs_new/Python-new/sha1module.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !412, globals: !519)
!1 = !DIFile(filename: "sha1module.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !343, !28, !363, !96, !366, !369, !387, !395, !411, !10, !94, !357}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !6, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !51, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!4, !4, !89}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!43, !4, !4, !89}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!4, !18, !10}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!4, !18, !4, !4}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !89}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA1object", file: !345, line: 49, baseType: !346)
!345 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/sha1module.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 45, size: 896, align: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 46, baseType: !5, size: 128, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "hash_state", scope: !346, file: !345, line: 48, baseType: !350, size: 768, align: 64, offset: 128)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "sha1_state", file: !345, line: 39, size: 768, align: 64, elements: !351)
!351 = !{!352, !355, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !350, file: !345, line: 40, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA1_INT64", file: !345, line: 27, baseType: !354)
!354 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !350, file: !345, line: 41, baseType: !356, size: 160, align: 32, offset: 64)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 160, align: 32, elements: !358)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA1_INT32", file: !345, line: 26, baseType: !341)
!358 = !{!359}
!359 = !DISubrange(count: 5)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "curlen", scope: !350, file: !345, line: 41, baseType: !357, size: 32, align: 32, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !350, file: !345, line: 42, baseType: !362, size: 512, align: 8, offset: 256)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 512, align: 8, elements: !364)
!363 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!364 = !{!365}
!365 = !DISubrange(count: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !368, line: 134, baseType: !363)
!368 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !368, line: 351, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 217, size: 384, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376, !384}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !371, file: !368, line: 291, baseType: !5, size: 128, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !371, file: !368, line: 292, baseType: !10, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !371, file: !368, line: 293, baseType: !218, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !371, file: !368, line: 349, baseType: !377, size: 32, align: 32, offset: 256)
!377 = !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !368, line: 294, size: 32, align: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !377, file: !368, line: 303, baseType: !341, size: 2, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !377, file: !368, line: 331, baseType: !341, size: 3, align: 32, offset: 2)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !377, file: !368, line: 336, baseType: !341, size: 1, align: 32, offset: 5)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !377, file: !368, line: 340, baseType: !341, size: 1, align: 32, offset: 6)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !377, file: !368, line: 345, baseType: !341, size: 1, align: 32, offset: 7)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !371, file: !368, line: 350, baseType: !385, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !95, line: 90, baseType: !43)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !368, line: 363, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 356, size: 576, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !389, file: !368, line: 357, baseType: !370, size: 384, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !389, file: !368, line: 358, baseType: !10, size: 64, align: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !389, file: !368, line: 360, baseType: !51, size: 64, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !389, file: !368, line: 361, baseType: !10, size: 64, align: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !368, line: 376, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 368, size: 640, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !397, file: !368, line: 369, baseType: !388, size: 576, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !397, file: !368, line: 375, baseType: !401, size: 64, align: 64, offset: 576)
!401 = !DICompositeType(tag: DW_TAG_union_type, scope: !397, file: !368, line: 370, size: 64, align: 64, elements: !402)
!402 = !{!403, !404, !405, !408}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !401, file: !368, line: 371, baseType: !89, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !401, file: !368, line: 372, baseType: !366, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !401, file: !368, line: 373, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !368, line: 129, baseType: !76)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !401, file: !368, line: 374, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !368, line: 121, baseType: !341)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!412 = !{!413, !418, !421, !428, !431, !438, !446, !460, !474, !480, !490, !494, !498, !502, !514}
!413 = !DISubprogram(name: "PyInit__sha1", scope: !345, file: !345, line: 545, type: !414, isLocal: false, isDefinition: true, scopeLine: 546, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__sha1, variables: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{!4}
!416 = !{!417}
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !413, file: !345, line: 547, type: !4)
!418 = !DISubprogram(name: "SHA1_dealloc", scope: !345, file: !345, line: 304, type: !36, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @SHA1_dealloc, variables: !419)
!419 = !{!420}
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !418, file: !345, line: 304, type: !4)
!421 = !DISubprogram(name: "SHA1_copy", scope: !345, file: !345, line: 315, type: !422, isLocal: true, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHA1object*, %struct._object*)* @SHA1_copy, variables: !424)
!422 = !DISubroutineType(types: !423)
!423 = !{!4, !343, !4}
!424 = !{!425, !426, !427}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !421, file: !345, line: 315, type: !343)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !421, file: !345, line: 315, type: !4)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newobj", scope: !421, file: !345, line: 317, type: !343)
!428 = !DISubprogram(name: "newSHA1object", scope: !345, file: !345, line: 295, type: !429, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: true, function: %struct.SHA1object* ()* @newSHA1object, variables: !2)
!429 = !DISubroutineType(types: !430)
!430 = !{!343}
!431 = !DISubprogram(name: "SHA1_digest", scope: !345, file: !345, line: 330, type: !422, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHA1object*, %struct._object*)* @SHA1_digest, variables: !432)
!432 = !{!433, !434, !435, !437}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !431, file: !345, line: 330, type: !343)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !431, file: !345, line: 330, type: !4)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digest", scope: !431, file: !345, line: 332, type: !436)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 160, align: 8, elements: !100)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !431, file: !345, line: 333, type: !350)
!438 = !DISubprogram(name: "sha1_done", scope: !345, file: !345, line: 239, type: !439, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sha1_state*, i8*)* @sha1_done, variables: !442)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441, !411}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!442 = !{!443, !444, !445}
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha1", arg: 1, scope: !438, file: !345, line: 239, type: !441)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 2, scope: !438, file: !345, line: 239, type: !411)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !438, file: !345, line: 241, type: !43)
!446 = !DISubprogram(name: "sha1_compress", scope: !345, file: !345, line: 103, type: !439, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sha1_state*, i8*)* @sha1_compress, variables: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !459}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha1", arg: 1, scope: !446, file: !345, line: 103, type: !441)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !446, file: !345, line: 103, type: !411)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !446, file: !345, line: 105, type: !357)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !446, file: !345, line: 105, type: !357)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !446, file: !345, line: 105, type: !357)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !446, file: !345, line: 105, type: !357)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !446, file: !345, line: 105, type: !357)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "W", scope: !446, file: !345, line: 105, type: !456)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 2560, align: 32, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 80)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !446, file: !345, line: 105, type: !357)
!460 = !DISubprogram(name: "SHA1_hexdigest", scope: !345, file: !345, line: 344, type: !422, isLocal: true, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHA1object*, %struct._object*)* @SHA1_hexdigest, variables: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470}
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !460, file: !345, line: 344, type: !343)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !460, file: !345, line: 344, type: !4)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digest", scope: !460, file: !345, line: 346, type: !436)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !460, file: !345, line: 347, type: !350)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !460, file: !345, line: 348, type: !4)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hex_digest", scope: !460, file: !345, line: 349, type: !366)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !460, file: !345, line: 350, type: !43)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !460, file: !345, line: 350, type: !43)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !471, file: !345, line: 364, type: !363)
!471 = distinct !DILexicalBlock(scope: !472, file: !345, line: 363, column: 27)
!472 = distinct !DILexicalBlock(scope: !473, file: !345, line: 363, column: 5)
!473 = distinct !DILexicalBlock(scope: !460, file: !345, line: 363, column: 5)
!474 = !DISubprogram(name: "SHA1_update", scope: !345, file: !345, line: 380, type: !422, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHA1object*, %struct._object*)* @SHA1_update, variables: !475)
!475 = !{!476, !477, !478, !479}
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !474, file: !345, line: 380, type: !343)
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !474, file: !345, line: 380, type: !4)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !474, file: !345, line: 382, type: !4)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !474, file: !345, line: 383, type: !236)
!480 = !DISubprogram(name: "sha1_process", scope: !345, file: !345, line: 203, type: !481, isLocal: true, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sha1_state*, i8*, i64)* @sha1_process, variables: !485)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !441, !483, !10}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!485 = !{!486, !487, !488, !489}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha1", arg: 1, scope: !480, file: !345, line: 203, type: !441)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 2, scope: !480, file: !345, line: 204, type: !483)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 3, scope: !480, file: !345, line: 204, type: !10)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !480, file: !345, line: 206, type: !10)
!490 = !DISubprogram(name: "SHA1_get_block_size", scope: !345, file: !345, line: 406, type: !300, isLocal: true, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @SHA1_get_block_size, variables: !491)
!491 = !{!492, !493}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !490, file: !345, line: 406, type: !4)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !490, file: !345, line: 406, type: !89)
!494 = !DISubprogram(name: "SHA1_get_name", scope: !345, file: !345, line: 412, type: !300, isLocal: true, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @SHA1_get_name, variables: !495)
!495 = !{!496, !497}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !494, file: !345, line: 412, type: !4)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !494, file: !345, line: 412, type: !89)
!498 = !DISubprogram(name: "sha1_get_digest_size", scope: !345, file: !345, line: 418, type: !300, isLocal: true, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @sha1_get_digest_size, variables: !499)
!499 = !{!500, !501}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !498, file: !345, line: 418, type: !4)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !498, file: !345, line: 418, type: !89)
!502 = !DISubprogram(name: "SHA1_new", scope: !345, file: !345, line: 481, type: !135, isLocal: true, isDefinition: true, scopeLine: 482, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @SHA1_new, variables: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510}
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !502, file: !345, line: 481, type: !4)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !502, file: !345, line: 481, type: !4)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !502, file: !345, line: 481, type: !4)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !502, file: !345, line: 484, type: !343)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_obj", scope: !502, file: !345, line: 485, type: !4)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !502, file: !345, line: 486, type: !236)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !511, file: !345, line: 505, type: !4)
!511 = distinct !DILexicalBlock(scope: !512, file: !345, line: 505, column: 12)
!512 = distinct !DILexicalBlock(scope: !513, file: !345, line: 504, column: 27)
!513 = distinct !DILexicalBlock(scope: !502, file: !345, line: 504, column: 9)
!514 = !DISubprogram(name: "sha1_init", scope: !345, file: !345, line: 184, type: !515, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sha1_state*)* @sha1_init, variables: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !441}
!517 = !{!518}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha1", arg: 1, scope: !514, file: !345, line: 184, type: !441)
!519 = !{!520, !522, !525, !529, !533, !537, !541, !546, !568, !572, !574}
!520 = !DIGlobalVariable(name: "SHA1type", scope: !0, file: !345, line: 440, type: !521, isLocal: true, isDefinition: true, variable: %struct._typeobject* @SHA1type)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !6, line: 422, baseType: !19)
!522 = !DIGlobalVariable(name: "SHA1_methods", scope: !0, file: !345, line: 397, type: !523, isLocal: true, isDefinition: true, variable: [5 x %struct.PyMethodDef]* @SHA1_methods)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 1280, align: 64, elements: !358)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!525 = !DIGlobalVariable(name: "SHA1_copy__doc__", scope: !0, file: !345, line: 312, type: !526, isLocal: true, isDefinition: true, variable: [34 x i8]* @SHA1_copy__doc__)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 272, align: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 34)
!529 = !DIGlobalVariable(name: "SHA1_digest__doc__", scope: !0, file: !345, line: 326, type: !530, isLocal: true, isDefinition: true, variable: [52 x i8]* @SHA1_digest__doc__)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 416, align: 8, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 52)
!533 = !DIGlobalVariable(name: "SHA1_hexdigest__doc__", scope: !0, file: !345, line: 340, type: !534, isLocal: true, isDefinition: true, variable: [59 x i8]* @SHA1_hexdigest__doc__)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 472, align: 8, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 59)
!537 = !DIGlobalVariable(name: "SHA1_update__doc__", scope: !0, file: !345, line: 376, type: !538, isLocal: true, isDefinition: true, variable: [58 x i8]* @SHA1_update__doc__)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 464, align: 8, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 58)
!541 = !DIGlobalVariable(name: "SHA1_getseters", scope: !0, file: !345, line: 424, type: !542, isLocal: true, isDefinition: true, variable: [4 x %struct.PyGetSetDef]* @SHA1_getseters)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1280, align: 64, elements: !544)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !294, line: 17, baseType: !293)
!544 = !{!545}
!545 = !DISubrange(count: 4)
!546 = !DIGlobalVariable(name: "_sha1module", scope: !0, file: !345, line: 532, type: !547, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_sha1module)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !548, line: 47, size: 832, align: 64, elements: !549)
!548 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!549 = !{!550, !559, !560, !561, !562, !564, !565, !566, !567}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !547, file: !548, line: 48, baseType: !551, size: 320, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !548, line: 38, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !548, line: 33, size: 320, align: 64, elements: !553)
!553 = !{!554, !555, !557, !558}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !552, file: !548, line: 34, baseType: !5, size: 128, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !552, file: !548, line: 35, baseType: !556, size: 64, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !552, file: !548, line: 36, baseType: !10, size: 64, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !552, file: !548, line: 37, baseType: !4, size: 64, align: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !547, file: !548, line: 49, baseType: !28, size: 64, align: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !547, file: !548, line: 50, baseType: !28, size: 64, align: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !547, file: !548, line: 51, baseType: !10, size: 64, align: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !547, file: !548, line: 52, baseType: !563, size: 64, align: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !547, file: !548, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !547, file: !548, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !547, file: !548, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !547, file: !548, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!568 = !DIGlobalVariable(name: "SHA1_functions", scope: !0, file: !345, line: 521, type: !569, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @SHA1_functions)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 512, align: 64, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 2)
!572 = !DIGlobalVariable(name: "kwlist", scope: !502, file: !345, line: 483, type: !573, isLocal: true, isDefinition: true, variable: [2 x i8*]* @SHA1_new.kwlist)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, align: 64, elements: !570)
!574 = !DIGlobalVariable(name: "SHA1_new__doc__", scope: !0, file: !345, line: 477, type: !575, isLocal: true, isDefinition: true, variable: [69 x i8]* @SHA1_new__doc__)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 552, align: 8, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 69)
!578 = !{i32 2, !"Dwarf Version", i32 4}
!579 = !{i32 2, !"Debug Info Version", i32 3}
!580 = !{i32 1, !"PIC Level", i32 2}
!581 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!582 = !DILocation(line: 547, column: 5, scope: !413)
!583 = !DIExpression()
!584 = !DILocation(line: 547, column: 15, scope: !413)
!585 = !DILocation(line: 549, column: 41, scope: !413)
!586 = !{!587, !591, i64 8}
!587 = !{!"_object", !588, i64 0, !591, i64 8}
!588 = !{!"long", !589, i64 0}
!589 = !{!"omnipotent char", !590, i64 0}
!590 = !{!"Simple C/C++ TBAA"}
!591 = !{!"any pointer", !589, i64 0}
!592 = !DILocation(line: 550, column: 9, scope: !593)
!593 = distinct !DILexicalBlock(scope: !413, file: !345, line: 550, column: 9)
!594 = !DILocation(line: 550, column: 33, scope: !593)
!595 = !DILocation(line: 550, column: 9, scope: !413)
!596 = !DILocation(line: 551, column: 9, scope: !593)
!597 = !DILocation(line: 553, column: 9, scope: !413)
!598 = !DILocation(line: 553, column: 7, scope: !413)
!599 = !{!591, !591, i64 0}
!600 = !DILocation(line: 554, column: 9, scope: !601)
!601 = distinct !DILexicalBlock(scope: !413, file: !345, line: 554, column: 9)
!602 = !DILocation(line: 554, column: 11, scope: !601)
!603 = !DILocation(line: 554, column: 9, scope: !413)
!604 = !DILocation(line: 555, column: 9, scope: !601)
!605 = !DILocation(line: 557, column: 55, scope: !413)
!606 = !{!587, !588, i64 0}
!607 = !DILocation(line: 558, column: 24, scope: !413)
!608 = !DILocation(line: 558, column: 5, scope: !413)
!609 = !DILocation(line: 559, column: 12, scope: !413)
!610 = !DILocation(line: 559, column: 5, scope: !413)
!611 = !DILocation(line: 560, column: 1, scope: !413)
!612 = !DILocation(line: 304, column: 24, scope: !418)
!613 = !DILocation(line: 306, column: 19, scope: !418)
!614 = !DILocation(line: 306, column: 5, scope: !418)
!615 = !DILocation(line: 307, column: 1, scope: !418)
!616 = !DILocation(line: 315, column: 23, scope: !421)
!617 = !DILocation(line: 315, column: 39, scope: !421)
!618 = !DILocation(line: 317, column: 5, scope: !421)
!619 = !DILocation(line: 317, column: 17, scope: !421)
!620 = !DILocation(line: 319, column: 19, scope: !621)
!621 = distinct !DILexicalBlock(scope: !421, file: !345, line: 319, column: 9)
!622 = !DILocation(line: 319, column: 17, scope: !621)
!623 = !DILocation(line: 319, column: 36, scope: !621)
!624 = !DILocation(line: 319, column: 9, scope: !421)
!625 = !DILocation(line: 320, column: 9, scope: !621)
!626 = !DILocation(line: 322, column: 5, scope: !421)
!627 = !DILocation(line: 322, column: 13, scope: !421)
!628 = !DILocation(line: 322, column: 26, scope: !421)
!629 = !DILocation(line: 322, column: 32, scope: !421)
!630 = !{i64 0, i64 8, !631, i64 8, i64 20, !633, i64 28, i64 4, !634, i64 32, i64 64, !633}
!631 = !{!632, !632, i64 0}
!632 = !{!"long long", !589, i64 0}
