; ModuleID = 'irs-onlybc/sha512module.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !420, globals: !552)
!1 = !DIFile(filename: "sha512module.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !350, !28, !43, !373, !368, !359, !374, !375, !378, !396, !404, !363}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !51, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !43, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !10, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !43, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !51, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !51, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!4, !4, !89}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!43, !4, !4, !89}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!4, !18, !10}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!4, !18, !4, !4}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !89}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHAobject", file: !352, line: 50, baseType: !353)
!352 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/sha512module.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 43, size: 1792, align: 64, elements: !354)
!354 = !{!355, !356, !362, !364, !365, !371, !372}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 44, baseType: !5, size: 128, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !353, file: !352, line: 45, baseType: !357, size: 512, align: 64, offset: 128)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 512, align: 64, elements: !360)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA_INT64", file: !352, line: 31, baseType: !359)
!359 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !353, file: !352, line: 46, baseType: !363, size: 32, align: 32, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA_INT32", file: !352, line: 30, baseType: !348)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !353, file: !352, line: 46, baseType: !363, size: 32, align: 32, offset: 672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !352, line: 47, baseType: !366, size: 1024, align: 8, offset: 704)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 1024, align: 8, elements: !369)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA_BYTE", file: !352, line: 27, baseType: !368)
!368 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!369 = !{!370}
!370 = !DISubrange(count: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !353, file: !352, line: 48, baseType: !43, size: 32, align: 32, offset: 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "digestsize", scope: !353, file: !352, line: 49, baseType: !43, size: 32, align: 32, offset: 1760)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !377, line: 134, baseType: !368)
!377 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !377, line: 351, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 217, size: 384, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !393}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !380, file: !377, line: 291, baseType: !5, size: 128, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !380, file: !377, line: 292, baseType: !10, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !380, file: !377, line: 293, baseType: !218, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !377, line: 349, baseType: !386, size: 32, align: 32, offset: 256)
!386 = !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !377, line: 294, size: 32, align: 32, elements: !387)
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !386, file: !377, line: 303, baseType: !348, size: 2, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !386, file: !377, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !386, file: !377, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !386, file: !377, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !386, file: !377, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !380, file: !377, line: 350, baseType: !394, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !95, line: 90, baseType: !43)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !377, line: 363, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 356, size: 576, align: 64, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !398, file: !377, line: 357, baseType: !379, size: 384, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !398, file: !377, line: 358, baseType: !10, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !398, file: !377, line: 360, baseType: !51, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !398, file: !377, line: 361, baseType: !10, size: 64, align: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !377, line: 376, baseType: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 368, size: 640, align: 64, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !406, file: !377, line: 369, baseType: !397, size: 576, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !406, file: !377, line: 375, baseType: !410, size: 64, align: 64, offset: 576)
!410 = !DICompositeType(tag: DW_TAG_union_type, scope: !406, file: !377, line: 370, size: 64, align: 64, elements: !411)
!411 = !{!412, !413, !414, !417}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !410, file: !377, line: 371, baseType: !89, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !410, file: !377, line: 372, baseType: !375, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !410, file: !377, line: 373, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !377, line: 129, baseType: !76)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !410, file: !377, line: 374, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !377, line: 121, baseType: !348)
!420 = !{!421, !426, !429, !436, !439, !440, !446, !455, !464, !477, !485, !499, !505, !514, !518, !522, !534, !537, !549}
!421 = !DISubprogram(name: "PyInit__sha512", scope: !352, file: !352, line: 773, type: !422, isLocal: false, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__sha512, variables: !424)
!422 = !DISubroutineType(types: !423)
!423 = !{!4}
!424 = !{!425}
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !421, file: !352, line: 775, type: !4)
!426 = !DISubprogram(name: "SHA512_dealloc", scope: !352, file: !352, line: 454, type: !36, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @SHA512_dealloc, variables: !427)
!427 = !{!428}
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !426, file: !352, line: 454, type: !4)
!429 = !DISubprogram(name: "SHA512_copy", scope: !352, file: !352, line: 465, type: !430, isLocal: true, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHAobject*, %struct._object*)* @SHA512_copy, variables: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{!4, !350, !4}
!432 = !{!433, !434, !435}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !429, file: !352, line: 465, type: !350)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !429, file: !352, line: 465, type: !4)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newobj", scope: !429, file: !352, line: 467, type: !350)
!436 = !DISubprogram(name: "newSHA512object", scope: !352, file: !352, line: 446, type: !437, isLocal: true, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: true, function: %struct.SHAobject* ()* @newSHA512object, variables: !2)
!437 = !DISubroutineType(types: !438)
!438 = !{!350}
!439 = !DISubprogram(name: "newSHA384object", scope: !352, file: !352, line: 440, type: !437, isLocal: true, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: %struct.SHAobject* ()* @newSHA384object, variables: !2)
!440 = !DISubprogram(name: "SHAcopy", scope: !352, file: !352, line: 78, type: !441, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.SHAobject*, %struct.SHAobject*)* @SHAcopy, variables: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !350, !350}
!443 = !{!444, !445}
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !440, file: !352, line: 78, type: !350)
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 2, scope: !440, file: !352, line: 78, type: !350)
!446 = !DISubprogram(name: "SHA512_digest", scope: !352, file: !352, line: 485, type: !430, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHAobject*, %struct._object*)* @SHA512_digest, variables: !447)
!447 = !{!448, !449, !450, !454}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !446, file: !352, line: 485, type: !350)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !446, file: !352, line: 485, type: !4)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digest", scope: !446, file: !352, line: 487, type: !451)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 512, align: 8, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 64)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !446, file: !352, line: 488, type: !351)
!455 = !DISubprogram(name: "sha512_final", scope: !352, file: !352, line: 324, type: !456, isLocal: true, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct.SHAobject*)* @sha512_final, variables: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !374, !350}
!458 = !{!459, !460, !461, !462, !463}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "digest", arg: 1, scope: !455, file: !352, line: 324, type: !374)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha_info", arg: 2, scope: !455, file: !352, line: 324, type: !350)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !455, file: !352, line: 326, type: !43)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo_bit_count", scope: !455, file: !352, line: 327, type: !363)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hi_bit_count", scope: !455, file: !352, line: 327, type: !363)
!464 = !DISubprogram(name: "sha512_transform", scope: !352, file: !352, line: 128, type: !465, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.SHAobject*)* @sha512_transform, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !350}
!467 = !{!468, !469, !470, !471, !475, !476}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha_info", arg: 1, scope: !464, file: !352, line: 128, type: !350)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !464, file: !352, line: 130, type: !43)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "S", scope: !464, file: !352, line: 131, type: !357)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "W", scope: !464, file: !352, line: 131, type: !472)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 5120, align: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 80)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t0", scope: !464, file: !352, line: 131, type: !358)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !464, file: !352, line: 131, type: !358)
!477 = !DISubprogram(name: "longReverse", scope: !352, file: !352, line: 56, type: !478, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (i64*, i32)* @longReverse, variables: !481)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !480, !43}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!481 = !{!482, !483, !484}
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 1, scope: !477, file: !352, line: 56, type: !480)
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "byteCount", arg: 2, scope: !477, file: !352, line: 56, type: !43)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !477, file: !352, line: 58, type: !358)
!485 = !DISubprogram(name: "SHA512_hexdigest", scope: !352, file: !352, line: 499, type: !430, isLocal: true, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHAobject*, %struct._object*)* @SHA512_hexdigest, variables: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !485, file: !352, line: 499, type: !350)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !485, file: !352, line: 499, type: !4)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digest", scope: !485, file: !352, line: 501, type: !451)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !485, file: !352, line: 502, type: !351)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !485, file: !352, line: 503, type: !4)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hex_digest", scope: !485, file: !352, line: 504, type: !375)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !485, file: !352, line: 505, type: !43)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !485, file: !352, line: 505, type: !43)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !496, file: !352, line: 519, type: !368)
!496 = distinct !DILexicalBlock(scope: !497, file: !352, line: 518, column: 42)
!497 = distinct !DILexicalBlock(scope: !498, file: !352, line: 518, column: 5)
!498 = distinct !DILexicalBlock(scope: !485, file: !352, line: 518, column: 5)
!499 = !DISubprogram(name: "SHA512_update", scope: !352, file: !352, line: 535, type: !430, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.SHAobject*, %struct._object*)* @SHA512_update, variables: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !499, file: !352, line: 535, type: !350)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !499, file: !352, line: 535, type: !4)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !499, file: !352, line: 537, type: !4)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !499, file: !352, line: 538, type: !236)
!505 = !DISubprogram(name: "sha512_update", scope: !352, file: !352, line: 284, type: !506, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.SHAobject*, i8*, i64)* @sha512_update, variables: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !350, !373, !10}
!508 = !{!509, !510, !511, !512, !513}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha_info", arg: 1, scope: !505, file: !352, line: 284, type: !350)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 2, scope: !505, file: !352, line: 284, type: !373)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "count", arg: 3, scope: !505, file: !352, line: 284, type: !10)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !505, file: !352, line: 286, type: !10)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clo", scope: !505, file: !352, line: 287, type: !363)
!514 = !DISubprogram(name: "SHA512_get_block_size", scope: !352, file: !352, line: 561, type: !307, isLocal: true, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @SHA512_get_block_size, variables: !515)
!515 = !{!516, !517}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !514, file: !352, line: 561, type: !4)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !514, file: !352, line: 561, type: !89)
!518 = !DISubprogram(name: "SHA512_get_name", scope: !352, file: !352, line: 567, type: !307, isLocal: true, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @SHA512_get_name, variables: !519)
!519 = !{!520, !521}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !518, file: !352, line: 567, type: !4)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !518, file: !352, line: 567, type: !89)
!522 = !DISubprogram(name: "SHA512_new", scope: !352, file: !352, line: 667, type: !135, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @SHA512_new, variables: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530}
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !522, file: !352, line: 667, type: !4)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !522, file: !352, line: 667, type: !4)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !522, file: !352, line: 667, type: !4)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !522, file: !352, line: 670, type: !350)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_obj", scope: !522, file: !352, line: 671, type: !4)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !522, file: !352, line: 672, type: !236)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !531, file: !352, line: 691, type: !4)
!531 = distinct !DILexicalBlock(scope: !532, file: !352, line: 691, column: 12)
!532 = distinct !DILexicalBlock(scope: !533, file: !352, line: 690, column: 27)
!533 = distinct !DILexicalBlock(scope: !522, file: !352, line: 690, column: 9)
!534 = !DISubprogram(name: "sha512_init", scope: !352, file: !352, line: 247, type: !465, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.SHAobject*)* @sha512_init, variables: !535)
!535 = !{!536}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha_info", arg: 1, scope: !534, file: !352, line: 247, type: !350)
!537 = !DISubprogram(name: "SHA384_new", scope: !352, file: !352, line: 708, type: !135, isLocal: true, isDefinition: true, scopeLine: 709, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @SHA384_new, variables: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !537, file: !352, line: 708, type: !4)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !537, file: !352, line: 708, type: !4)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdict", arg: 3, scope: !537, file: !352, line: 708, type: !4)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !537, file: !352, line: 711, type: !350)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_obj", scope: !537, file: !352, line: 712, type: !4)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !537, file: !352, line: 713, type: !236)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !546, file: !352, line: 732, type: !4)
!546 = distinct !DILexicalBlock(scope: !547, file: !352, line: 732, column: 12)
!547 = distinct !DILexicalBlock(scope: !548, file: !352, line: 731, column: 27)
!548 = distinct !DILexicalBlock(scope: !537, file: !352, line: 731, column: 9)
!549 = !DISubprogram(name: "sha384_init", scope: !352, file: !352, line: 264, type: !465, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.SHAobject*)* @sha384_init, variables: !550)
!550 = !{!551}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sha_info", arg: 1, scope: !549, file: !352, line: 264, type: !350)
!552 = !{!553, !555, !560, !564, !568, !572, !576, !581, !586, !587, !609, !611, !613, !617, !618}
!553 = !DIGlobalVariable(name: "SHA384type", scope: !0, file: !352, line: 592, type: !554, isLocal: true, isDefinition: true, variable: %struct._typeobject* @SHA384type)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !6, line: 422, baseType: !19)
!555 = !DIGlobalVariable(name: "SHA_methods", scope: !0, file: !352, line: 552, type: !556, isLocal: true, isDefinition: true, variable: [5 x %struct.PyMethodDef]* @SHA_methods)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 1280, align: 64, elements: !558)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!558 = !{!559}
!559 = !DISubrange(count: 5)
!560 = !DIGlobalVariable(name: "SHA512_copy__doc__", scope: !0, file: !352, line: 462, type: !561, isLocal: true, isDefinition: true, variable: [34 x i8]* @SHA512_copy__doc__)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 272, align: 8, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 34)
!564 = !DIGlobalVariable(name: "SHA512_digest__doc__", scope: !0, file: !352, line: 481, type: !565, isLocal: true, isDefinition: true, variable: [52 x i8]* @SHA512_digest__doc__)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 416, align: 8, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 52)
!568 = !DIGlobalVariable(name: "SHA512_hexdigest__doc__", scope: !0, file: !352, line: 495, type: !569, isLocal: true, isDefinition: true, variable: [59 x i8]* @SHA512_hexdigest__doc__)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 472, align: 8, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 59)
!572 = !DIGlobalVariable(name: "SHA512_update__doc__", scope: !0, file: !352, line: 531, type: !573, isLocal: true, isDefinition: true, variable: [58 x i8]* @SHA512_update__doc__)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 464, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 58)
!576 = !DIGlobalVariable(name: "SHA_members", scope: !0, file: !352, line: 587, type: !577, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @SHA_members)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 640, align: 64, elements: !579)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !291, line: 24, baseType: !290)
!579 = !{!580}
!580 = !DISubrange(count: 2)
!581 = !DIGlobalVariable(name: "SHA_getseters", scope: !0, file: !352, line: 575, type: !582, isLocal: true, isDefinition: true, variable: [3 x %struct.PyGetSetDef]* @SHA_getseters)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 960, align: 64, elements: !584)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !301, line: 17, baseType: !300)
!584 = !{!585}
!585 = !DISubrange(count: 3)
!586 = !DIGlobalVariable(name: "SHA512type", scope: !0, file: !352, line: 626, type: !554, isLocal: true, isDefinition: true, variable: %struct._typeobject* @SHA512type)
!587 = !DIGlobalVariable(name: "_sha512module", scope: !0, file: !352, line: 760, type: !588, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_sha512module)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !589, line: 47, size: 832, align: 64, elements: !590)
!589 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!590 = !{!591, !600, !601, !602, !603, !605, !606, !607, !608}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !588, file: !589, line: 48, baseType: !592, size: 320, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !589, line: 38, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !589, line: 33, size: 320, align: 64, elements: !594)
!594 = !{!595, !596, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !593, file: !589, line: 34, baseType: !5, size: 128, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !593, file: !589, line: 35, baseType: !597, size: 64, align: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !593, file: !589, line: 36, baseType: !10, size: 64, align: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !593, file: !589, line: 37, baseType: !4, size: 64, align: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !588, file: !589, line: 49, baseType: !28, size: 64, align: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !588, file: !589, line: 50, baseType: !28, size: 64, align: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !588, file: !589, line: 51, baseType: !10, size: 64, align: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !588, file: !589, line: 52, baseType: !604, size: 64, align: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !588, file: !589, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !588, file: !589, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !588, file: !589, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !588, file: !589, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!609 = !DIGlobalVariable(name: "SHA_functions", scope: !0, file: !352, line: 748, type: !610, isLocal: true, isDefinition: true, variable: [3 x %struct.PyMethodDef]* @SHA_functions)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 768, align: 64, elements: !584)
!611 = !DIGlobalVariable(name: "kwlist", scope: !522, file: !352, line: 669, type: !612, isLocal: true, isDefinition: true, variable: [2 x i8*]* @SHA512_new.kwlist)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, align: 64, elements: !579)
!613 = !DIGlobalVariable(name: "SHA512_new__doc__", scope: !0, file: !352, line: 663, type: !614, isLocal: true, isDefinition: true, variable: [72 x i8]* @SHA512_new__doc__)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 576, align: 8, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 72)
!617 = !DIGlobalVariable(name: "kwlist", scope: !537, file: !352, line: 710, type: !612, isLocal: true, isDefinition: true, variable: [2 x i8*]* @SHA384_new.kwlist)
!618 = !DIGlobalVariable(name: "SHA384_new__doc__", scope: !0, file: !352, line: 704, type: !614, isLocal: true, isDefinition: true, variable: [72 x i8]* @SHA384_new__doc__)
!619 = !{i32 2, !"Dwarf Version", i32 4}
!620 = !{i32 2, !"Debug Info Version", i32 3}
!621 = !{i32 1, !"PIC Level", i32 2}
!622 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!623 = !DILocation(line: 775, column: 5, scope: !421)
!624 = !DIExpression()
!625 = !DILocation(line: 775, column: 15, scope: !421)
!626 = !DILocation(line: 777, column: 43, scope: !421)
!627 = !{!628, !632, i64 8}
!628 = !{!"_object", !629, i64 0, !632, i64 8}
!629 = !{!"long", !630, i64 0}
!630 = !{!"omnipotent char", !631, i64 0}
!631 = !{!"Simple C/C++ TBAA"}
!632 = !{!"any pointer", !630, i64 0}
!633 = !DILocation(line: 778, column: 9, scope: !634)
!634 = distinct !DILexicalBlock(scope: !421, file: !352, line: 778, column: 9)
!635 = !DILocation(line: 778, column: 35, scope: !634)
!636 = !DILocation(line: 778, column: 9, scope: !421)
!637 = !DILocation(line: 779, column: 9, scope: !634)
!638 = !DILocation(line: 780, column: 43, scope: !421)
!639 = !DILocation(line: 781, column: 9, scope: !640)
!640 = distinct !DILexicalBlock(scope: !421, file: !352, line: 781, column: 9)
!641 = !DILocation(line: 781, column: 35, scope: !640)
!642 = !DILocation(line: 781, column: 9, scope: !421)
!643 = !DILocation(line: 782, column: 9, scope: !640)
!644 = !DILocation(line: 784, column: 9, scope: !421)
!645 = !DILocation(line: 784, column: 7, scope: !421)
!646 = !{!632, !632, i64 0}
!647 = !DILocation(line: 785, column: 9, scope: !648)
!648 = distinct !DILexicalBlock(scope: !421, file: !352, line: 785, column: 9)
!649 = !DILocation(line: 785, column: 11, scope: !648)
!650 = !DILocation(line: 785, column: 9, scope: !421)
!651 = !DILocation(line: 786, column: 9, scope: !648)
!652 = !DILocation(line: 788, column: 57, scope: !421)
!653 = !{!628, !629, i64 0}
!654 = !DILocation(line: 789, column: 24, scope: !421)
!655 = !DILocation(line: 789, column: 5, scope: !421)
!656 = !DILocation(line: 790, column: 57, scope: !421)
!657 = !DILocation(line: 791, column: 24, scope: !421)
!658 = !DILocation(line: 791, column: 5, scope: !421)
!659 = !DILocation(line: 792, column: 12, scope: !421)
!660 = !DILocation(line: 792, column: 5, scope: !421)
!661 = !DILocation(line: 793, column: 1, scope: !421)
!662 = !DILocation(line: 454, column: 26, scope: !426)
!663 = !DILocation(line: 456, column: 19, scope: !426)
!664 = !DILocation(line: 456, column: 5, scope: !426)
!665 = !DILocation(line: 457, column: 1, scope: !426)
!666 = !DILocation(line: 465, column: 24, scope: !429)
!667 = !DILocation(line: 465, column: 40, scope: !429)
