; ModuleID = 'irs-onlybc/signalmodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !14, subprograms: !375, globals: !1068)
!1 = !DIFile(filename: "signalmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__itimer_which", file: !4, line: 92, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "ITIMER_REAL", value: 0)
!7 = !DIEnumerator(name: "ITIMER_VIRTUAL", value: 1)
!8 = !DIEnumerator(name: "ITIMER_PROF", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 57, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!13 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!14 = !{!15, !16, !354, !28, !359, !367, !368, !55, !370, !371}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !50, !113, !118, !123, !124, !129, !181, !212, !224, !230, !231, !232, !234, !236, !267, !268, !269, !278, !279, !284, !285, !287, !289, !299, !302, !320, !321, !322, !324, !326, !327, !329, !334, !339, !344, !345, !346, !347, !348, !349, !350, !351, !353}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !16}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !16, !56, !55}
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 246, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!60 = !{!61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !87, !89, !91, !95, !98, !100, !101, !102, !103, !104, !108, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 247, baseType: !55, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 252, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 253, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 254, baseType: !63, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 255, baseType: !63, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 256, baseType: !63, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 257, baseType: !63, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 258, baseType: !63, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 259, baseType: !63, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 261, baseType: !63, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 262, baseType: !63, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 263, baseType: !63, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 265, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 161, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !59, line: 162, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !59, line: 163, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !59, line: 167, baseType: !55, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 267, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 269, baseType: !55, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 273, baseType: !55, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 275, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 279, baseType: !88, size: 16, align: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 280, baseType: !90, size: 8, align: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 281, baseType: !92, size: 8, align: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 285, baseType: !96, size: 64, align: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 155, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 294, baseType: !99, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 303, baseType: !15, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 304, baseType: !15, size: 64, align: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 305, baseType: !15, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 306, baseType: !15, size: 64, align: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 307, baseType: !105, size: 64, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 309, baseType: !55, size: 32, align: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 311, baseType: !110, size: 160, align: 8, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !114, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!16, !16, !63}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !119, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!55, !16, !63, !16}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !15, size: 64, align: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !125, size: 64, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!16, !16}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !130, size: 64, align: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !133)
!133 = !{!134, !139, !140, !141, !142, !143, !148, !150, !151, !152, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !132, file: !18, line: 241, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!16, !16, !16}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !132, file: !18, line: 242, baseType: !135, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !132, file: !18, line: 243, baseType: !135, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !132, file: !18, line: 244, baseType: !135, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !132, file: !18, line: 245, baseType: !135, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !132, file: !18, line: 246, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!16, !16, !16, !16}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !132, file: !18, line: 247, baseType: !149, size: 64, align: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !126)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !132, file: !18, line: 248, baseType: !149, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !132, file: !18, line: 249, baseType: !149, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !132, file: !18, line: 250, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!55, !16}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !132, file: !18, line: 251, baseType: !149, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !132, file: !18, line: 252, baseType: !135, size: 64, align: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !132, file: !18, line: 253, baseType: !135, size: 64, align: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !132, file: !18, line: 254, baseType: !135, size: 64, align: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !132, file: !18, line: 255, baseType: !135, size: 64, align: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !132, file: !18, line: 256, baseType: !135, size: 64, align: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !132, file: !18, line: 257, baseType: !149, size: 64, align: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !132, file: !18, line: 258, baseType: !15, size: 64, align: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !132, file: !18, line: 259, baseType: !149, size: 64, align: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !132, file: !18, line: 261, baseType: !135, size: 64, align: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !132, file: !18, line: 262, baseType: !135, size: 64, align: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !132, file: !18, line: 263, baseType: !135, size: 64, align: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !132, file: !18, line: 264, baseType: !135, size: 64, align: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !132, file: !18, line: 265, baseType: !144, size: 64, align: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !132, file: !18, line: 266, baseType: !135, size: 64, align: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !132, file: !18, line: 267, baseType: !135, size: 64, align: 64, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !132, file: !18, line: 268, baseType: !135, size: 64, align: 64, offset: 1664)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !132, file: !18, line: 269, baseType: !135, size: 64, align: 64, offset: 1728)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !132, file: !18, line: 270, baseType: !135, size: 64, align: 64, offset: 1792)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !132, file: !18, line: 272, baseType: !135, size: 64, align: 64, offset: 1856)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !132, file: !18, line: 273, baseType: !135, size: 64, align: 64, offset: 1920)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !132, file: !18, line: 274, baseType: !135, size: 64, align: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !132, file: !18, line: 275, baseType: !135, size: 64, align: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !132, file: !18, line: 277, baseType: !149, size: 64, align: 64, offset: 2112)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !182, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !18, line: 281, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!22, !16}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !18, line: 282, baseType: !135, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !18, line: 283, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!16, !16, !22}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !18, line: 284, baseType: !193, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !18, line: 285, baseType: !15, size: 64, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !18, line: 286, baseType: !200, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!55, !16, !22, !16}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !18, line: 287, baseType: !15, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !18, line: 288, baseType: !206, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!55, !16, !16}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !18, line: 290, baseType: !135, size: 64, align: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !18, line: 291, baseType: !193, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !213, size: 64, align: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !215)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !18, line: 295, baseType: !187, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !18, line: 296, baseType: !135, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !18, line: 297, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!55, !16, !16, !16}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !225, size: 64, align: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !16}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !144, size: 64, align: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !125, size: 64, align: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !233, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !136)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !235, size: 64, align: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !237, size: 64, align: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !240)
!240 = !{!241, !262}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !18, line: 302, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!55, !16, !246, !55}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !259, !260, !261}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !248, file: !18, line: 179, baseType: !15, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !248, file: !18, line: 180, baseType: !16, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !248, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !248, file: !18, line: 184, baseType: !55, size: 32, align: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !248, file: !18, line: 185, baseType: !55, size: 32, align: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !248, file: !18, line: 186, baseType: !63, size: 64, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !248, file: !18, line: 187, baseType: !258, size: 64, align: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !248, file: !18, line: 188, baseType: !258, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !248, file: !18, line: 189, baseType: !258, size: 64, align: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !248, file: !18, line: 190, baseType: !15, size: 64, align: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !18, line: 303, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !16, !246}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !107, size: 64, align: 64, offset: 1344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !270, size: 64, align: 64, offset: 1472)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!55, !16, !274, !15}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!55, !16, !15}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !153, size: 64, align: 64, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !280, size: 64, align: 64, offset: 1600)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!16, !16, !16, !55}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !286, size: 64, align: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !126)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !288, size: 64, align: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !126)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !290, size: 64, align: 64, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !292, line: 40, size: 256, align: 64, elements: !293)
!292 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!293 = !{!294, !295, !297, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !291, file: !292, line: 41, baseType: !40, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !291, file: !292, line: 42, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !292, line: 18, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !291, file: !292, line: 43, baseType: !55, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !291, file: !292, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !300, size: 64, align: 64, offset: 1920)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !18, line: 390, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !303, size: 64, align: 64, offset: 1984)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, align: 64, elements: !306)
!305 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!306 = !{!307, !308, !313, !318, !319}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 12, baseType: !63, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !304, file: !305, line: 13, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!16, !16, !15}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !304, file: !305, line: 14, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!55, !16, !16, !15}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 15, baseType: !63, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !304, file: !305, line: 16, baseType: !15, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !16, size: 64, align: 64, offset: 2112)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !323, size: 64, align: 64, offset: 2176)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !145)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !325, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !221)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !328, size: 64, align: 64, offset: 2368)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !221)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !330, size: 64, align: 64, offset: 2432)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!16, !30, !22}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !335, size: 64, align: 64, offset: 2496)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!16, !30, !16, !16}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !340, size: 64, align: 64, offset: 2560)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !15}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !153, size: 64, align: 64, offset: 2624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !16, size: 64, align: 64, offset: 2688)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !16, size: 64, align: 64, offset: 2752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !16, size: 64, align: 64, offset: 2816)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !16, size: 64, align: 64, offset: 2880)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !16, size: 64, align: 64, offset: 2944)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !352, size: 32, align: 32, offset: 3072)
!352 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !355, line: 85, baseType: !356)
!355 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !55}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !361, line: 33, baseType: !362)
!361 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 25, size: 256, align: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !362, file: !361, line: 26, baseType: !34, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !362, file: !361, line: 27, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 64, elements: !93)
!367 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !369, line: 60, baseType: !107)
!369 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!370 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_intptr_t", file: !23, line: 154, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !373, line: 267, baseType: !374)
!373 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 195, baseType: !28)
!375 = !{!376, !383, !586, !605, !609, !616, !617, !618, !619, !620, !625, !645, !652, !668, !673, !679, !687, !693, !735, !762, !768, !831, !835, !842, !861, !881, !904, !909, !919, !991, !1002, !1017, !1021, !1026, !1032, !1035, !1065}
!376 = !DISubprogram(name: "PySignal_SetWakeupFd", scope: !377, file: !377, line: 460, type: !378, isLocal: false, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @PySignal_SetWakeupFd, variables: !380)
!377 = !DIFile(filename: "./Modules/signalmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!378 = !DISubroutineType(types: !379)
!379 = !{!55, !55}
!380 = !{!381, !382}
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !376, file: !377, line: 460, type: !55)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_fd", scope: !376, file: !377, line: 462, type: !55)
!383 = !DISubprogram(name: "PyInit_signal", scope: !377, file: !377, line: 970, type: !384, isLocal: false, isDefinition: true, scopeLine: 971, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_signal, variables: !386)
!384 = !DISubroutineType(types: !385)
!385 = !{!16}
!386 = !{!387, !388, !389, !390, !391, !393, !397, !401, !403, !406, !408, !411, !413, !416, !418, !421, !423, !426, !428, !431, !433, !436, !438, !441, !443, !446, !448, !451, !453, !456, !458, !461, !463, !466, !468, !471, !473, !476, !478, !481, !483, !486, !488, !491, !493, !496, !498, !501, !503, !506, !508, !511, !513, !516, !518, !521, !523, !526, !528, !531, !533, !536, !538, !541, !543, !546, !548, !551, !553, !556, !558, !561, !563, !566, !568, !571, !573, !576, !578, !580, !582}
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !383, file: !377, line: 972, type: !16)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !383, file: !377, line: 972, type: !16)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !383, file: !377, line: 972, type: !16)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !383, file: !377, line: 973, type: !55)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !392, file: !377, line: 1009, type: !16)
!392 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1009, column: 8)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !394, file: !377, line: 1031, type: !356)
!394 = distinct !DILexicalBlock(scope: !395, file: !377, line: 1030, column: 30)
!395 = distinct !DILexicalBlock(scope: !396, file: !377, line: 1030, column: 5)
!396 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1030, column: 5)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !398, file: !377, line: 1045, type: !16)
!398 = distinct !DILexicalBlock(scope: !399, file: !377, line: 1045, column: 12)
!399 = distinct !DILexicalBlock(scope: !400, file: !377, line: 1042, column: 45)
!400 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1042, column: 9)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !402, file: !377, line: 1053, type: !16)
!402 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1053, column: 8)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !404, file: !377, line: 1053, type: !16)
!404 = distinct !DILexicalBlock(scope: !405, file: !377, line: 1053, column: 93)
!405 = distinct !DILexicalBlock(scope: !402, file: !377, line: 1053, column: 59)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !407, file: !377, line: 1058, type: !16)
!407 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1058, column: 8)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !409, file: !377, line: 1058, type: !16)
!409 = distinct !DILexicalBlock(scope: !410, file: !377, line: 1058, column: 93)
!410 = distinct !DILexicalBlock(scope: !407, file: !377, line: 1058, column: 59)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !412, file: !377, line: 1068, type: !16)
!412 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1068, column: 8)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !414, file: !377, line: 1068, type: !16)
!414 = distinct !DILexicalBlock(scope: !415, file: !377, line: 1068, column: 93)
!415 = distinct !DILexicalBlock(scope: !412, file: !377, line: 1068, column: 59)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !417, file: !377, line: 1073, type: !16)
!417 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1073, column: 8)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !419, file: !377, line: 1073, type: !16)
!419 = distinct !DILexicalBlock(scope: !420, file: !377, line: 1073, column: 93)
!420 = distinct !DILexicalBlock(scope: !417, file: !377, line: 1073, column: 59)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !422, file: !377, line: 1078, type: !16)
!422 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1078, column: 8)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !424, file: !377, line: 1078, type: !16)
!424 = distinct !DILexicalBlock(scope: !425, file: !377, line: 1078, column: 93)
!425 = distinct !DILexicalBlock(scope: !422, file: !377, line: 1078, column: 59)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !427, file: !377, line: 1083, type: !16)
!427 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1083, column: 8)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !429, file: !377, line: 1083, type: !16)
!429 = distinct !DILexicalBlock(scope: !430, file: !377, line: 1083, column: 93)
!430 = distinct !DILexicalBlock(scope: !427, file: !377, line: 1083, column: 59)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !432, file: !377, line: 1088, type: !16)
!432 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1088, column: 8)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !434, file: !377, line: 1088, type: !16)
!434 = distinct !DILexicalBlock(scope: !435, file: !377, line: 1088, column: 93)
!435 = distinct !DILexicalBlock(scope: !432, file: !377, line: 1088, column: 59)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !437, file: !377, line: 1098, type: !16)
!437 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1098, column: 8)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !439, file: !377, line: 1098, type: !16)
!439 = distinct !DILexicalBlock(scope: !440, file: !377, line: 1098, column: 93)
!440 = distinct !DILexicalBlock(scope: !437, file: !377, line: 1098, column: 59)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !442, file: !377, line: 1103, type: !16)
!442 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1103, column: 8)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !377, line: 1103, type: !16)
!444 = distinct !DILexicalBlock(scope: !445, file: !377, line: 1103, column: 93)
!445 = distinct !DILexicalBlock(scope: !442, file: !377, line: 1103, column: 59)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !447, file: !377, line: 1108, type: !16)
!447 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1108, column: 8)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !449, file: !377, line: 1108, type: !16)
!449 = distinct !DILexicalBlock(scope: !450, file: !377, line: 1108, column: 93)
!450 = distinct !DILexicalBlock(scope: !447, file: !377, line: 1108, column: 59)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !452, file: !377, line: 1113, type: !16)
!452 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1113, column: 8)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !454, file: !377, line: 1113, type: !16)
!454 = distinct !DILexicalBlock(scope: !455, file: !377, line: 1113, column: 93)
!455 = distinct !DILexicalBlock(scope: !452, file: !377, line: 1113, column: 59)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !457, file: !377, line: 1118, type: !16)
!457 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1118, column: 8)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !459, file: !377, line: 1118, type: !16)
!459 = distinct !DILexicalBlock(scope: !460, file: !377, line: 1118, column: 93)
!460 = distinct !DILexicalBlock(scope: !457, file: !377, line: 1118, column: 59)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !462, file: !377, line: 1123, type: !16)
!462 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1123, column: 8)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !377, line: 1123, type: !16)
!464 = distinct !DILexicalBlock(scope: !465, file: !377, line: 1123, column: 93)
!465 = distinct !DILexicalBlock(scope: !462, file: !377, line: 1123, column: 59)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !467, file: !377, line: 1128, type: !16)
!467 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1128, column: 8)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !469, file: !377, line: 1128, type: !16)
!469 = distinct !DILexicalBlock(scope: !470, file: !377, line: 1128, column: 93)
!470 = distinct !DILexicalBlock(scope: !467, file: !377, line: 1128, column: 59)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !472, file: !377, line: 1133, type: !16)
!472 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1133, column: 8)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !377, line: 1133, type: !16)
!474 = distinct !DILexicalBlock(scope: !475, file: !377, line: 1133, column: 93)
!475 = distinct !DILexicalBlock(scope: !472, file: !377, line: 1133, column: 59)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !477, file: !377, line: 1138, type: !16)
!477 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1138, column: 8)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !479, file: !377, line: 1138, type: !16)
!479 = distinct !DILexicalBlock(scope: !480, file: !377, line: 1138, column: 93)
!480 = distinct !DILexicalBlock(scope: !477, file: !377, line: 1138, column: 59)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !482, file: !377, line: 1143, type: !16)
!482 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1143, column: 8)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !377, line: 1143, type: !16)
!484 = distinct !DILexicalBlock(scope: !485, file: !377, line: 1143, column: 93)
!485 = distinct !DILexicalBlock(scope: !482, file: !377, line: 1143, column: 59)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !487, file: !377, line: 1148, type: !16)
!487 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1148, column: 8)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !377, line: 1148, type: !16)
!489 = distinct !DILexicalBlock(scope: !490, file: !377, line: 1148, column: 93)
!490 = distinct !DILexicalBlock(scope: !487, file: !377, line: 1148, column: 59)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !492, file: !377, line: 1153, type: !16)
!492 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1153, column: 8)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !494, file: !377, line: 1153, type: !16)
!494 = distinct !DILexicalBlock(scope: !495, file: !377, line: 1153, column: 93)
!495 = distinct !DILexicalBlock(scope: !492, file: !377, line: 1153, column: 59)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !497, file: !377, line: 1158, type: !16)
!497 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1158, column: 8)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !499, file: !377, line: 1158, type: !16)
!499 = distinct !DILexicalBlock(scope: !500, file: !377, line: 1158, column: 93)
!500 = distinct !DILexicalBlock(scope: !497, file: !377, line: 1158, column: 59)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !502, file: !377, line: 1163, type: !16)
!502 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1163, column: 8)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !377, line: 1163, type: !16)
!504 = distinct !DILexicalBlock(scope: !505, file: !377, line: 1163, column: 93)
!505 = distinct !DILexicalBlock(scope: !502, file: !377, line: 1163, column: 59)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !507, file: !377, line: 1168, type: !16)
!507 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1168, column: 8)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !509, file: !377, line: 1168, type: !16)
!509 = distinct !DILexicalBlock(scope: !510, file: !377, line: 1168, column: 93)
!510 = distinct !DILexicalBlock(scope: !507, file: !377, line: 1168, column: 59)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !512, file: !377, line: 1173, type: !16)
!512 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1173, column: 8)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !514, file: !377, line: 1173, type: !16)
!514 = distinct !DILexicalBlock(scope: !515, file: !377, line: 1173, column: 93)
!515 = distinct !DILexicalBlock(scope: !512, file: !377, line: 1173, column: 59)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !517, file: !377, line: 1178, type: !16)
!517 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1178, column: 8)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !519, file: !377, line: 1178, type: !16)
!519 = distinct !DILexicalBlock(scope: !520, file: !377, line: 1178, column: 93)
!520 = distinct !DILexicalBlock(scope: !517, file: !377, line: 1178, column: 59)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !522, file: !377, line: 1183, type: !16)
!522 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1183, column: 8)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !377, line: 1183, type: !16)
!524 = distinct !DILexicalBlock(scope: !525, file: !377, line: 1183, column: 93)
!525 = distinct !DILexicalBlock(scope: !522, file: !377, line: 1183, column: 59)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !527, file: !377, line: 1188, type: !16)
!527 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1188, column: 8)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !529, file: !377, line: 1188, type: !16)
!529 = distinct !DILexicalBlock(scope: !530, file: !377, line: 1188, column: 93)
!530 = distinct !DILexicalBlock(scope: !527, file: !377, line: 1188, column: 59)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !532, file: !377, line: 1193, type: !16)
!532 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1193, column: 8)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !534, file: !377, line: 1193, type: !16)
!534 = distinct !DILexicalBlock(scope: !535, file: !377, line: 1193, column: 93)
!535 = distinct !DILexicalBlock(scope: !532, file: !377, line: 1193, column: 59)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !537, file: !377, line: 1198, type: !16)
!537 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1198, column: 8)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !539, file: !377, line: 1198, type: !16)
!539 = distinct !DILexicalBlock(scope: !540, file: !377, line: 1198, column: 93)
!540 = distinct !DILexicalBlock(scope: !537, file: !377, line: 1198, column: 59)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !542, file: !377, line: 1203, type: !16)
!542 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1203, column: 8)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !544, file: !377, line: 1203, type: !16)
!544 = distinct !DILexicalBlock(scope: !545, file: !377, line: 1203, column: 93)
!545 = distinct !DILexicalBlock(scope: !542, file: !377, line: 1203, column: 59)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !547, file: !377, line: 1208, type: !16)
!547 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1208, column: 8)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !377, line: 1208, type: !16)
!549 = distinct !DILexicalBlock(scope: !550, file: !377, line: 1208, column: 93)
!550 = distinct !DILexicalBlock(scope: !547, file: !377, line: 1208, column: 59)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !552, file: !377, line: 1213, type: !16)
!552 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1213, column: 8)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !554, file: !377, line: 1213, type: !16)
!554 = distinct !DILexicalBlock(scope: !555, file: !377, line: 1213, column: 93)
!555 = distinct !DILexicalBlock(scope: !552, file: !377, line: 1213, column: 59)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !557, file: !377, line: 1218, type: !16)
!557 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1218, column: 8)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !559, file: !377, line: 1218, type: !16)
!559 = distinct !DILexicalBlock(scope: !560, file: !377, line: 1218, column: 93)
!560 = distinct !DILexicalBlock(scope: !557, file: !377, line: 1218, column: 59)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !562, file: !377, line: 1223, type: !16)
!562 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1223, column: 8)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !377, line: 1223, type: !16)
!564 = distinct !DILexicalBlock(scope: !565, file: !377, line: 1223, column: 93)
!565 = distinct !DILexicalBlock(scope: !562, file: !377, line: 1223, column: 59)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !567, file: !377, line: 1228, type: !16)
!567 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1228, column: 8)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !377, line: 1228, type: !16)
!569 = distinct !DILexicalBlock(scope: !570, file: !377, line: 1228, column: 93)
!570 = distinct !DILexicalBlock(scope: !567, file: !377, line: 1228, column: 59)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !572, file: !377, line: 1233, type: !16)
!572 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1233, column: 8)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !377, line: 1233, type: !16)
!574 = distinct !DILexicalBlock(scope: !575, file: !377, line: 1233, column: 93)
!575 = distinct !DILexicalBlock(scope: !572, file: !377, line: 1233, column: 59)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !577, file: !377, line: 1244, type: !16)
!577 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1244, column: 8)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !377, line: 1249, type: !16)
!579 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1249, column: 8)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !581, file: !377, line: 1254, type: !16)
!581 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1254, column: 8)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !377, line: 1282, type: !16)
!583 = distinct !DILexicalBlock(scope: !584, file: !377, line: 1282, column: 12)
!584 = distinct !DILexicalBlock(scope: !585, file: !377, line: 1281, column: 27)
!585 = distinct !DILexicalBlock(scope: !383, file: !377, line: 1281, column: 9)
!586 = !DISubprogram(name: "PyErr_CheckSignals", scope: !377, file: !377, line: 1317, type: !587, isLocal: false, isDefinition: true, scopeLine: 1318, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyErr_CheckSignals, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!55}
!589 = !{!590, !591, !592, !598, !599, !603}
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !586, file: !377, line: 1319, type: !55)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !586, file: !377, line: 1320, type: !16)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !593, file: !377, line: 1351, type: !16)
!593 = distinct !DILexicalBlock(scope: !594, file: !377, line: 1350, column: 34)
!594 = distinct !DILexicalBlock(scope: !595, file: !377, line: 1350, column: 13)
!595 = distinct !DILexicalBlock(scope: !596, file: !377, line: 1349, column: 30)
!596 = distinct !DILexicalBlock(scope: !597, file: !377, line: 1349, column: 5)
!597 = distinct !DILexicalBlock(scope: !586, file: !377, line: 1349, column: 5)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arglist", scope: !593, file: !377, line: 1352, type: !16)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !600, file: !377, line: 1358, type: !16)
!600 = distinct !DILexicalBlock(scope: !601, file: !377, line: 1358, column: 20)
!601 = distinct !DILexicalBlock(scope: !602, file: !377, line: 1355, column: 26)
!602 = distinct !DILexicalBlock(scope: !593, file: !377, line: 1355, column: 17)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !604, file: !377, line: 1363, type: !16)
!604 = distinct !DILexicalBlock(scope: !593, file: !377, line: 1363, column: 16)
!605 = !DISubprogram(name: "PyErr_SetInterrupt", scope: !377, file: !377, line: 1375, type: !606, isLocal: false, isDefinition: true, scopeLine: 1376, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyErr_SetInterrupt, variables: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{null}
!608 = !{}
!609 = !DISubprogram(name: "PyOS_InitInterrupts", scope: !377, file: !377, line: 1381, type: !606, isLocal: false, isDefinition: true, scopeLine: 1382, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyOS_InitInterrupts, variables: !610)
!610 = !{!611, !612}
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !609, file: !377, line: 1383, type: !16)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !613, file: !377, line: 1385, type: !16)
!613 = distinct !DILexicalBlock(scope: !614, file: !377, line: 1385, column: 12)
!614 = distinct !DILexicalBlock(scope: !615, file: !377, line: 1384, column: 12)
!615 = distinct !DILexicalBlock(scope: !609, file: !377, line: 1384, column: 9)
!616 = !DISubprogram(name: "PyOS_FiniInterrupts", scope: !377, file: !377, line: 1390, type: !606, isLocal: false, isDefinition: true, scopeLine: 1391, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyOS_FiniInterrupts, variables: !608)
!617 = !DISubprogram(name: "PyOS_InterruptOccurred", scope: !377, file: !377, line: 1396, type: !587, isLocal: false, isDefinition: true, scopeLine: 1397, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyOS_InterruptOccurred, variables: !608)
!618 = !DISubprogram(name: "PyOS_AfterFork", scope: !377, file: !377, line: 1422, type: !606, isLocal: false, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyOS_AfterFork, variables: !608)
!619 = !DISubprogram(name: "_PyOS_IsMainThread", scope: !377, file: !377, line: 1441, type: !587, isLocal: false, isDefinition: true, scopeLine: 1442, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyOS_IsMainThread, variables: !608)
!620 = !DISubprogram(name: "signal_alarm", scope: !377, file: !377, line: 248, type: !137, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_alarm, variables: !621)
!621 = !{!622, !623, !624}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !620, file: !377, line: 248, type: !16)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !620, file: !377, line: 248, type: !16)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !620, file: !377, line: 250, type: !55)
!625 = !DISubprogram(name: "signal_setitimer", scope: !377, file: !377, line: 472, type: !137, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_setitimer, variables: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !644}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !625, file: !377, line: 472, type: !16)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !625, file: !377, line: 472, type: !16)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !625, file: !377, line: 474, type: !367)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interval", scope: !625, file: !377, line: 475, type: !367)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "which", scope: !625, file: !377, line: 476, type: !55)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !625, file: !377, line: 477, type: !633)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", file: !4, line: 108, size: 256, align: 64, elements: !634)
!634 = !{!635, !643}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !633, file: !4, line: 111, baseType: !636, size: 128, align: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !637, line: 30, size: 128, align: 64, elements: !638)
!637 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!638 = !{!639, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !636, file: !637, line: 32, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 148, baseType: !28)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !636, file: !637, line: 33, baseType: !642, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !27, line: 150, baseType: !28)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !633, file: !4, line: 113, baseType: !636, size: 128, align: 64, offset: 128)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !625, file: !377, line: 477, type: !633)
!645 = !DISubprogram(name: "timeval_from_double", scope: !377, file: !377, line: 115, type: !646, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: void (double, %struct.timeval*)* @timeval_from_double, variables: !649)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !367, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!649 = !{!650, !651}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !645, file: !377, line: 115, type: !367)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tv", arg: 2, scope: !645, file: !377, line: 115, type: !648)
!652 = !DISubprogram(name: "itimer_retval", scope: !377, file: !377, line: 128, type: !653, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.itimerval*)* @itimer_retval, variables: !656)
!653 = !DISubroutineType(types: !654)
!654 = !{!16, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!656 = !{!657, !658, !659, !660, !664}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !652, file: !377, line: 128, type: !655)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !652, file: !377, line: 130, type: !16)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !652, file: !377, line: 130, type: !16)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !377, line: 137, type: !16)
!661 = distinct !DILexicalBlock(scope: !662, file: !377, line: 137, column: 8)
!662 = distinct !DILexicalBlock(scope: !663, file: !377, line: 136, column: 71)
!663 = distinct !DILexicalBlock(scope: !652, file: !377, line: 136, column: 8)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !665, file: !377, line: 144, type: !16)
!665 = distinct !DILexicalBlock(scope: !666, file: !377, line: 144, column: 8)
!666 = distinct !DILexicalBlock(scope: !667, file: !377, line: 143, column: 74)
!667 = distinct !DILexicalBlock(scope: !652, file: !377, line: 143, column: 8)
!668 = !DISubprogram(name: "double_from_timeval", scope: !377, file: !377, line: 122, type: !669, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct.timeval*)* @double_from_timeval, variables: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!367, !648}
!671 = !{!672}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tv", arg: 1, scope: !668, file: !377, line: 122, type: !648)
!673 = !DISubprogram(name: "signal_getitimer", scope: !377, file: !377, line: 507, type: !137, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_getitimer, variables: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !673, file: !377, line: 507, type: !16)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !673, file: !377, line: 507, type: !16)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "which", scope: !673, file: !377, line: 509, type: !55)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !673, file: !377, line: 510, type: !633)
!679 = !DISubprogram(name: "signal_signal", scope: !377, file: !377, line: 288, type: !137, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_signal, variables: !680)
!680 = !{!681, !682, !683, !684, !685, !686}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !679, file: !377, line: 288, type: !16)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !679, file: !377, line: 288, type: !16)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !679, file: !377, line: 290, type: !16)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig_num", scope: !679, file: !377, line: 291, type: !55)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_handler", scope: !679, file: !377, line: 292, type: !16)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !679, file: !377, line: 293, type: !356)
!687 = !DISubprogram(name: "signal_getsignal", scope: !377, file: !377, line: 365, type: !137, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_getsignal, variables: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !687, file: !377, line: 365, type: !16)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !687, file: !377, line: 365, type: !16)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig_num", scope: !687, file: !377, line: 367, type: !55)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_handler", scope: !687, file: !377, line: 368, type: !16)
!693 = !DISubprogram(name: "signal_set_wakeup_fd", scope: !377, file: !377, line: 427, type: !137, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_set_wakeup_fd, variables: !694)
!694 = !{!695, !696, !697, !733, !734}
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !693, file: !377, line: 427, type: !16)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !693, file: !377, line: 427, type: !16)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !693, file: !377, line: 429, type: !698)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !699, line: 46, size: 1152, align: 64, elements: !700)
!699 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!700 = !{!701, !703, !705, !707, !709, !711, !713, !714, !715, !716, !718, !720, !727, !728, !729}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !698, file: !699, line: 48, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !27, line: 133, baseType: !107)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !698, file: !699, line: 53, baseType: !704, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !27, line: 136, baseType: !107)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !698, file: !699, line: 61, baseType: !706, size: 64, align: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !27, line: 139, baseType: !107)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !698, file: !699, line: 62, baseType: !708, size: 32, align: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !27, line: 138, baseType: !352)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !698, file: !699, line: 64, baseType: !710, size: 32, align: 32, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !27, line: 134, baseType: !352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !698, file: !699, line: 65, baseType: !712, size: 32, align: 32, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !27, line: 135, baseType: !352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !698, file: !699, line: 67, baseType: !55, size: 32, align: 32, offset: 288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !698, file: !699, line: 69, baseType: !702, size: 64, align: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !698, file: !699, line: 74, baseType: !86, size: 64, align: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !698, file: !699, line: 78, baseType: !717, size: 64, align: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !27, line: 162, baseType: !28)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !698, file: !699, line: 80, baseType: !719, size: 64, align: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !27, line: 167, baseType: !28)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !698, file: !699, line: 91, baseType: !721, size: 128, align: 64, offset: 576)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !722, line: 120, size: 128, align: 64, elements: !723)
!722 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !721, file: !722, line: 122, baseType: !640, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !721, file: !722, line: 123, baseType: !726, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !27, line: 184, baseType: !28)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !698, file: !699, line: 92, baseType: !721, size: 128, align: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !698, file: !699, line: 93, baseType: !721, size: 128, align: 64, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !698, file: !699, line: 106, baseType: !730, size: 192, align: 64, offset: 960)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 192, align: 64, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 3)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !693, file: !377, line: 430, type: !55)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_fd", scope: !693, file: !377, line: 430, type: !55)
!735 = !DISubprogram(name: "fstat64", scope: !736, file: !736, line: 517, type: !737, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.stat64*)* @fstat64, variables: !759)
!736 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!737 = !DISubroutineType(types: !738)
!738 = !{!55, !55, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64, align: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !699, line: 119, size: 1152, align: 64, elements: !741)
!741 = !{!742, !743, !745, !746, !747, !748, !749, !750, !751, !752, !753, !755, !756, !757, !758}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !740, file: !699, line: 121, baseType: !702, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !740, file: !699, line: 123, baseType: !744, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !27, line: 137, baseType: !107)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !740, file: !699, line: 124, baseType: !706, size: 64, align: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !740, file: !699, line: 125, baseType: !708, size: 32, align: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !740, file: !699, line: 132, baseType: !710, size: 32, align: 32, offset: 224)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !740, file: !699, line: 133, baseType: !712, size: 32, align: 32, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !740, file: !699, line: 135, baseType: !55, size: 32, align: 32, offset: 288)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !740, file: !699, line: 136, baseType: !702, size: 64, align: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !740, file: !699, line: 137, baseType: !86, size: 64, align: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !740, file: !699, line: 143, baseType: !717, size: 64, align: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !740, file: !699, line: 144, baseType: !754, size: 64, align: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !27, line: 168, baseType: !28)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !740, file: !699, line: 152, baseType: !721, size: 128, align: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !740, file: !699, line: 153, baseType: !721, size: 128, align: 64, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !740, file: !699, line: 154, baseType: !721, size: 128, align: 64, offset: 832)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !740, file: !699, line: 164, baseType: !730, size: 192, align: 64, offset: 960)
!759 = !{!760, !761}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !735, file: !736, line: 517, type: !55)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !735, file: !736, line: 517, type: !739)
!762 = !DISubprogram(name: "signal_siginterrupt", scope: !377, file: !377, line: 403, type: !137, isLocal: true, isDefinition: true, scopeLine: 404, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_siginterrupt, variables: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !762, file: !377, line: 403, type: !16)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !762, file: !377, line: 403, type: !16)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig_num", scope: !762, file: !377, line: 405, type: !55)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !762, file: !377, line: 406, type: !55)
!768 = !DISubprogram(name: "signal_pause", scope: !377, file: !377, line: 265, type: !127, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @signal_pause, variables: !769)
!769 = !{!770, !771}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !768, file: !377, line: 265, type: !16)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !772, file: !377, line: 267, type: !773)
!772 = distinct !DILexicalBlock(scope: !768, file: !377, line: 267, column: 5)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !775, line: 139, baseType: !776)
!775 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !775, line: 69, size: 1536, align: 64, elements: !777)
!777 = !{!778, !780, !781, !801, !804, !805, !806, !807, !808, !809, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !775, line: 72, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !775, line: 73, baseType: !779, size: 64, align: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !776, file: !775, line: 74, baseType: !782, size: 64, align: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !775, line: 44, baseType: !784)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !775, line: 19, size: 832, align: 64, elements: !785)
!785 = !{!786, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !775, line: 21, baseType: !787, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !784, file: !775, line: 22, baseType: !779, size: 64, align: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !784, file: !775, line: 24, baseType: !16, size: 64, align: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !784, file: !775, line: 25, baseType: !16, size: 64, align: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !784, file: !775, line: 26, baseType: !16, size: 64, align: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !784, file: !775, line: 27, baseType: !16, size: 64, align: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !784, file: !775, line: 28, baseType: !16, size: 64, align: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !784, file: !775, line: 30, baseType: !16, size: 64, align: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !784, file: !775, line: 31, baseType: !16, size: 64, align: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !784, file: !775, line: 32, baseType: !16, size: 64, align: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !784, file: !775, line: 33, baseType: !55, size: 32, align: 32, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !784, file: !775, line: 34, baseType: !55, size: 32, align: 32, offset: 672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !784, file: !775, line: 37, baseType: !55, size: 32, align: 32, offset: 704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !784, file: !775, line: 43, baseType: !16, size: 64, align: 64, offset: 768)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !776, file: !775, line: 76, baseType: !802, size: 64, align: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !775, line: 50, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !776, file: !775, line: 77, baseType: !55, size: 32, align: 32, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !776, file: !775, line: 78, baseType: !42, size: 8, align: 8, offset: 288)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !776, file: !775, line: 80, baseType: !42, size: 8, align: 8, offset: 296)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !776, file: !775, line: 85, baseType: !55, size: 32, align: 32, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !776, file: !775, line: 86, baseType: !55, size: 32, align: 32, offset: 352)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !776, file: !775, line: 88, baseType: !810, size: 64, align: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !775, line: 54, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!55, !16, !802, !55, !16}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !776, file: !775, line: 89, baseType: !810, size: 64, align: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !776, file: !775, line: 90, baseType: !16, size: 64, align: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !776, file: !775, line: 91, baseType: !16, size: 64, align: 64, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !776, file: !775, line: 93, baseType: !16, size: 64, align: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !776, file: !775, line: 94, baseType: !16, size: 64, align: 64, offset: 704)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !776, file: !775, line: 95, baseType: !16, size: 64, align: 64, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !776, file: !775, line: 97, baseType: !16, size: 64, align: 64, offset: 832)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !776, file: !775, line: 98, baseType: !16, size: 64, align: 64, offset: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !776, file: !775, line: 99, baseType: !16, size: 64, align: 64, offset: 960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !776, file: !775, line: 101, baseType: !16, size: 64, align: 64, offset: 1024)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !776, file: !775, line: 103, baseType: !55, size: 32, align: 32, offset: 1088)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !776, file: !775, line: 105, baseType: !16, size: 64, align: 64, offset: 1152)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !776, file: !775, line: 106, baseType: !28, size: 64, align: 64, offset: 1216)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !776, file: !775, line: 108, baseType: !55, size: 32, align: 32, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !776, file: !775, line: 109, baseType: !16, size: 64, align: 64, offset: 1344)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !776, file: !775, line: 134, baseType: !341, size: 64, align: 64, offset: 1408)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !776, file: !775, line: 135, baseType: !15, size: 64, align: 64, offset: 1472)
!831 = !DISubprogram(name: "signal_default_int_handler", scope: !377, file: !377, line: 155, type: !137, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_default_int_handler, variables: !832)
!832 = !{!833, !834}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !831, file: !377, line: 155, type: !16)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !831, file: !377, line: 155, type: !16)
!835 = !DISubprogram(name: "signal_pthread_kill", scope: !377, file: !377, line: 839, type: !137, isLocal: true, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_pthread_kill, variables: !836)
!836 = !{!837, !838, !839, !840, !841}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !835, file: !377, line: 839, type: !16)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !835, file: !377, line: 839, type: !16)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tid", scope: !835, file: !377, line: 841, type: !28)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !835, file: !377, line: 842, type: !55)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !835, file: !377, line: 843, type: !55)
!842 = !DISubprogram(name: "signal_pthread_sigmask", scope: !377, file: !377, line: 618, type: !137, isLocal: true, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_pthread_sigmask, variables: !843)
!843 = !{!844, !845, !846, !847, !848, !859, !860}
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !842, file: !377, line: 618, type: !16)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !842, file: !377, line: 618, type: !16)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "how", scope: !842, file: !377, line: 620, type: !55)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signals", scope: !842, file: !377, line: 621, type: !16)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !842, file: !377, line: 622, type: !849)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !850, line: 37, baseType: !851)
!850 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !852, line: 31, baseType: !853)
!852 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!853 = !DICompositeType(tag: DW_TAG_structure_type, file: !852, line: 28, size: 1024, align: 64, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !853, file: !852, line: 30, baseType: !856, size: 1024, align: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1024, align: 64, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 16)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "previous", scope: !842, file: !377, line: 622, type: !849)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !842, file: !377, line: 623, type: !55)
!861 = !DISubprogram(name: "iterable_to_sigset", scope: !377, file: !377, line: 535, type: !862, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.__sigset_t*)* @iterable_to_sigset, variables: !865)
!862 = !DISubroutineType(types: !863)
!863 = !{!55, !16, !864}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !876, !878}
!866 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 1, scope: !861, file: !377, line: 535, type: !16)
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mask", arg: 2, scope: !861, file: !377, line: 535, type: !864)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !861, file: !377, line: 537, type: !55)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterator", scope: !861, file: !377, line: 538, type: !16)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !861, file: !377, line: 538, type: !16)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !861, file: !377, line: 539, type: !28)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !861, file: !377, line: 540, type: !55)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !377, line: 559, type: !16)
!874 = distinct !DILexicalBlock(scope: !875, file: !377, line: 559, column: 12)
!875 = distinct !DILexicalBlock(scope: !861, file: !377, line: 549, column: 5)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !877, file: !377, line: 575, type: !16)
!877 = distinct !DILexicalBlock(scope: !861, file: !377, line: 575, column: 8)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !879, file: !377, line: 575, type: !16)
!879 = distinct !DILexicalBlock(scope: !880, file: !377, line: 575, column: 100)
!880 = distinct !DILexicalBlock(scope: !877, file: !377, line: 575, column: 66)
!881 = !DISubprogram(name: "sigset_to_set", scope: !377, file: !377, line: 582, type: !882, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.__sigset_t*)* @sigset_to_set, variables: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{!16, !849}
!884 = !{!885, !886, !887, !888, !889, !896, !900, !902}
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mask", arg: 1, scope: !881, file: !377, line: 582, type: !849)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !881, file: !377, line: 584, type: !16)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !881, file: !377, line: 584, type: !16)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig", scope: !881, file: !377, line: 585, type: !55)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !890, file: !377, line: 602, type: !16)
!890 = distinct !DILexicalBlock(scope: !891, file: !377, line: 602, column: 16)
!891 = distinct !DILexicalBlock(scope: !892, file: !377, line: 601, column: 35)
!892 = distinct !DILexicalBlock(scope: !893, file: !377, line: 601, column: 13)
!893 = distinct !DILexicalBlock(scope: !894, file: !377, line: 591, column: 36)
!894 = distinct !DILexicalBlock(scope: !895, file: !377, line: 591, column: 5)
!895 = distinct !DILexicalBlock(scope: !881, file: !377, line: 591, column: 5)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !897, file: !377, line: 606, type: !16)
!897 = distinct !DILexicalBlock(scope: !898, file: !377, line: 606, column: 16)
!898 = distinct !DILexicalBlock(scope: !899, file: !377, line: 605, column: 46)
!899 = distinct !DILexicalBlock(scope: !893, file: !377, line: 605, column: 13)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !377, line: 607, type: !16)
!901 = distinct !DILexicalBlock(scope: !898, file: !377, line: 607, column: 16)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !903, file: !377, line: 610, type: !16)
!903 = distinct !DILexicalBlock(scope: !893, file: !377, line: 610, column: 12)
!904 = !DISubprogram(name: "signal_sigpending", scope: !377, file: !377, line: 654, type: !127, isLocal: true, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @signal_sigpending, variables: !905)
!905 = !{!906, !907, !908}
!906 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !904, file: !377, line: 654, type: !16)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !904, file: !377, line: 656, type: !55)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !904, file: !377, line: 657, type: !849)
!909 = !DISubprogram(name: "signal_sigwait", scope: !377, file: !377, line: 673, type: !137, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_sigwait, variables: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
