; ModuleID = 'irs-onlybc/socketmodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!30 = !DIEnumerator(name: "MSG_EOR", value: 128)
!31 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!32 = !DIEnumerator(name: "MSG_FIN", value: 512)
!33 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!34 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!35 = !DIEnumerator(name: "MSG_RST", value: 4096)
!36 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!37 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!38 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!39 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!40 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 22, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "/usr/include/linux/can/raw.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "CAN_RAW_FILTER", value: 1)
!45 = !DIEnumerator(name: "CAN_RAW_ERR_FILTER", value: 2)
!46 = !DIEnumerator(name: "CAN_RAW_LOOPBACK", value: 3)
!47 = !DIEnumerator(name: "CAN_RAW_RECV_OWN_MSGS", value: 4)
!48 = !DIEnumerator(name: "CAN_RAW_FD_FRAMES", value: 5)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 39, size: 32, align: 32, elements: !51)
!50 = !DIFile(filename: "/usr/include/linux/can/bcm.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!52 = !DIEnumerator(name: "TX_SETUP", value: 1)
!53 = !DIEnumerator(name: "TX_DELETE", value: 2)
!54 = !DIEnumerator(name: "TX_READ", value: 3)
!55 = !DIEnumerator(name: "TX_SEND", value: 4)
!56 = !DIEnumerator(name: "RX_SETUP", value: 5)
!57 = !DIEnumerator(name: "RX_DELETE", value: 6)
!58 = !DIEnumerator(name: "RX_READ", value: 7)
!59 = !DIEnumerator(name: "TX_STATUS", value: 8)
!60 = !DIEnumerator(name: "TX_EXPIRED", value: 9)
!61 = !DIEnumerator(name: "RX_STATUS", value: 10)
!62 = !DIEnumerator(name: "RX_TIMEOUT", value: 11)
!63 = !DIEnumerator(name: "RX_CHANGED", value: 12)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 31, size: 32, align: 32, elements: !66)
!65 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!67 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!68 = !DIEnumerator(name: "IPPROTO_HOPOPTS", value: 0)
!69 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!70 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!71 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!72 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!73 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!74 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!75 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!76 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!77 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!78 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!79 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!80 = !DIEnumerator(name: "IPPROTO_ROUTING", value: 43)
!81 = !DIEnumerator(name: "IPPROTO_FRAGMENT", value: 44)
!82 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!83 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!84 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!85 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!86 = !DIEnumerator(name: "IPPROTO_ICMPV6", value: 58)
!87 = !DIEnumerator(name: "IPPROTO_NONE", value: 59)
!88 = !DIEnumerator(name: "IPPROTO_DSTOPTS", value: 60)
!89 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!90 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!91 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!92 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!93 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!94 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!95 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!96 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 53, size: 32, align: 32, elements: !99)
!98 = !DIFile(filename: "/usr/include/sys/socket.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "SHUT_RD", value: 0)
!101 = !DIEnumerator(name: "SHUT_WR", value: 1)
!102 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!103 = !{!104, !189, !450, !116, !453, !456, !143, !458, !176, !476, !485, !497, !521, !532, !562, !577, !585, !586, !587, !194, !595, !597, !128, !151, !599, !600, !110, !610, !611, !612, !335, !618, !627, !635, !641, !448, !196, !691}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !106, line: 109, baseType: !107)
!106 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !106, line: 105, size: 128, align: 64, elements: !108)
!108 = !{!109, !117}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !107, file: !106, line: 107, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !111, line: 177, baseType: !112)
!111 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !113, line: 102, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !115, line: 181, baseType: !116)
!115 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!116 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !107, file: !106, line: 108, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !106, line: 334, size: 3200, align: 64, elements: !120)
!120 = !{!121, !127, !131, !132, !133, !138, !202, !207, !212, !213, !218, !270, !301, !313, !319, !320, !321, !323, !325, !356, !357, !358, !367, !368, !373, !374, !376, !378, !388, !398, !416, !417, !418, !420, !422, !423, !425, !430, !435, !440, !441, !442, !443, !444, !445, !446, !447, !449}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !119, file: !106, line: 335, baseType: !122, size: 192, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !106, line: 114, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 111, size: 192, align: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !123, file: !106, line: 112, baseType: !105, size: 128, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !123, file: !106, line: 113, baseType: !110, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !119, file: !106, line: 336, baseType: !128, size: 64, align: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !119, file: !106, line: 337, baseType: !110, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !119, file: !106, line: 337, baseType: !110, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !119, file: !106, line: 341, baseType: !134, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !106, line: 308, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !104}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !119, file: !106, line: 342, baseType: !139, size: 64, align: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !106, line: 314, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !104, !144, !143}
!143 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !113, line: 48, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !147, line: 246, size: 1728, align: 64, elements: !148)
!147 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!148 = !{!149, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !170, !171, !172, !173, !175, !177, !179, !183, !186, !188, !190, !191, !192, !193, !197, !198}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !146, file: !147, line: 247, baseType: !143, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !146, file: !147, line: 252, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !146, file: !147, line: 253, baseType: !151, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !146, file: !147, line: 254, baseType: !151, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !146, file: !147, line: 255, baseType: !151, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !146, file: !147, line: 256, baseType: !151, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !146, file: !147, line: 257, baseType: !151, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !146, file: !147, line: 258, baseType: !151, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !146, file: !147, line: 259, baseType: !151, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !146, file: !147, line: 261, baseType: !151, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !146, file: !147, line: 262, baseType: !151, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !146, file: !147, line: 263, baseType: !151, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !146, file: !147, line: 265, baseType: !163, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !147, line: 161, size: 192, align: 64, elements: !165)
!165 = !{!166, !167, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !164, file: !147, line: 162, baseType: !163, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !164, file: !147, line: 163, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !164, file: !147, line: 167, baseType: !143, size: 32, align: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !146, file: !147, line: 267, baseType: !168, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !146, file: !147, line: 269, baseType: !143, size: 32, align: 32, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !146, file: !147, line: 273, baseType: !143, size: 32, align: 32, offset: 928)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !146, file: !147, line: 275, baseType: !174, size: 64, align: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !115, line: 140, baseType: !116)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !146, file: !147, line: 279, baseType: !176, size: 16, align: 16, offset: 1024)
!176 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !146, file: !147, line: 280, baseType: !178, size: 8, align: 8, offset: 1040)
!178 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !146, file: !147, line: 281, baseType: !180, size: 8, align: 8, offset: 1048)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8, align: 8, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 1)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !146, file: !147, line: 285, baseType: !184, size: 64, align: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !147, line: 155, baseType: null)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !146, file: !147, line: 294, baseType: !187, size: 64, align: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !115, line: 141, baseType: !116)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !146, file: !147, line: 303, baseType: !189, size: 64, align: 64, offset: 1216)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !146, file: !147, line: 304, baseType: !189, size: 64, align: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !146, file: !147, line: 305, baseType: !189, size: 64, align: 64, offset: 1344)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !146, file: !147, line: 306, baseType: !189, size: 64, align: 64, offset: 1408)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !146, file: !147, line: 307, baseType: !194, size: 64, align: 64, offset: 1472)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 62, baseType: !196)
!195 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!196 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !146, file: !147, line: 309, baseType: !143, size: 32, align: 32, offset: 1536)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !146, file: !147, line: 311, baseType: !199, size: 160, align: 8, offset: 1568)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 160, align: 8, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 20)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !119, file: !106, line: 343, baseType: !203, size: 64, align: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !106, line: 316, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!104, !104, !151}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !119, file: !106, line: 344, baseType: !208, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !106, line: 318, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!143, !104, !151, !104}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !119, file: !106, line: 345, baseType: !189, size: 64, align: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !119, file: !106, line: 346, baseType: !214, size: 64, align: 64, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !106, line: 320, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!104, !104}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !119, file: !106, line: 350, baseType: !219, size: 64, align: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !106, line: 278, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 236, size: 2176, align: 64, elements: !222)
!222 = !{!223, !228, !229, !230, !231, !232, !237, !239, !240, !241, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !221, file: !106, line: 241, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !106, line: 166, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!104, !104, !104}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !221, file: !106, line: 242, baseType: !224, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !221, file: !106, line: 243, baseType: !224, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !221, file: !106, line: 244, baseType: !224, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !221, file: !106, line: 245, baseType: !224, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !221, file: !106, line: 246, baseType: !233, size: 64, align: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !106, line: 167, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!104, !104, !104, !104}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !221, file: !106, line: 247, baseType: !238, size: 64, align: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !106, line: 165, baseType: !215)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !221, file: !106, line: 248, baseType: !238, size: 64, align: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !221, file: !106, line: 249, baseType: !238, size: 64, align: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !221, file: !106, line: 250, baseType: !242, size: 64, align: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !106, line: 168, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!143, !104}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !221, file: !106, line: 251, baseType: !238, size: 64, align: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !221, file: !106, line: 252, baseType: !224, size: 64, align: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !221, file: !106, line: 253, baseType: !224, size: 64, align: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !221, file: !106, line: 254, baseType: !224, size: 64, align: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !221, file: !106, line: 255, baseType: !224, size: 64, align: 64, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !221, file: !106, line: 256, baseType: !224, size: 64, align: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !221, file: !106, line: 257, baseType: !238, size: 64, align: 64, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !221, file: !106, line: 258, baseType: !189, size: 64, align: 64, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !221, file: !106, line: 259, baseType: !238, size: 64, align: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !221, file: !106, line: 261, baseType: !224, size: 64, align: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !221, file: !106, line: 262, baseType: !224, size: 64, align: 64, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !221, file: !106, line: 263, baseType: !224, size: 64, align: 64, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !221, file: !106, line: 264, baseType: !224, size: 64, align: 64, offset: 1408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !221, file: !106, line: 265, baseType: !233, size: 64, align: 64, offset: 1472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !221, file: !106, line: 266, baseType: !224, size: 64, align: 64, offset: 1536)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !221, file: !106, line: 267, baseType: !224, size: 64, align: 64, offset: 1600)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !221, file: !106, line: 268, baseType: !224, size: 64, align: 64, offset: 1664)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !221, file: !106, line: 269, baseType: !224, size: 64, align: 64, offset: 1728)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !221, file: !106, line: 270, baseType: !224, size: 64, align: 64, offset: 1792)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !221, file: !106, line: 272, baseType: !224, size: 64, align: 64, offset: 1856)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !221, file: !106, line: 273, baseType: !224, size: 64, align: 64, offset: 1920)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !221, file: !106, line: 274, baseType: !224, size: 64, align: 64, offset: 1984)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !221, file: !106, line: 275, baseType: !224, size: 64, align: 64, offset: 2048)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !221, file: !106, line: 277, baseType: !238, size: 64, align: 64, offset: 2112)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !119, file: !106, line: 351, baseType: !271, size: 64, align: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !106, line: 292, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 280, size: 640, align: 64, elements: !274)
!274 = !{!275, !280, !281, !286, !287, !288, !293, !294, !299, !300}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !273, file: !106, line: 281, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !106, line: 169, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!110, !104}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !273, file: !106, line: 282, baseType: !224, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !273, file: !106, line: 283, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !106, line: 170, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!104, !104, !110}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !273, file: !106, line: 284, baseType: !282, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !273, file: !106, line: 285, baseType: !189, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !273, file: !106, line: 286, baseType: !289, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !106, line: 172, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!143, !104, !110, !104}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !273, file: !106, line: 287, baseType: !189, size: 64, align: 64, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !273, file: !106, line: 288, baseType: !295, size: 64, align: 64, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !106, line: 231, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!143, !104, !104}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !273, file: !106, line: 290, baseType: !224, size: 64, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !273, file: !106, line: 291, baseType: !282, size: 64, align: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !119, file: !106, line: 352, baseType: !302, size: 64, align: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !106, line: 298, baseType: !304)
!304 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 294, size: 192, align: 64, elements: !305)
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !304, file: !106, line: 295, baseType: !276, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !304, file: !106, line: 296, baseType: !224, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !304, file: !106, line: 297, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !106, line: 174, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!143, !104, !104, !104}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !119, file: !106, line: 356, baseType: !314, size: 64, align: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !106, line: 321, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!318, !104}
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !111, line: 186, baseType: !110)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !119, file: !106, line: 357, baseType: !233, size: 64, align: 64, offset: 1024)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !119, file: !106, line: 358, baseType: !214, size: 64, align: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !119, file: !106, line: 359, baseType: !322, size: 64, align: 64, offset: 1152)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !106, line: 317, baseType: !225)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !119, file: !106, line: 360, baseType: !324, size: 64, align: 64, offset: 1216)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !106, line: 319, baseType: !310)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !119, file: !106, line: 363, baseType: !326, size: 64, align: 64, offset: 1280)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !106, line: 304, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 301, size: 128, align: 64, elements: !329)
!329 = !{!330, !351}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !328, file: !106, line: 302, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !106, line: 193, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!143, !104, !335, !143}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !106, line: 191, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !106, line: 178, size: 640, align: 64, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !348, !349, !350}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !337, file: !106, line: 179, baseType: !189, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !337, file: !106, line: 180, baseType: !104, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !337, file: !106, line: 181, baseType: !110, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !337, file: !106, line: 182, baseType: !110, size: 64, align: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !337, file: !106, line: 184, baseType: !143, size: 32, align: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !337, file: !106, line: 185, baseType: !143, size: 32, align: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !337, file: !106, line: 186, baseType: !151, size: 64, align: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !337, file: !106, line: 187, baseType: !347, size: 64, align: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !337, file: !106, line: 188, baseType: !347, size: 64, align: 64, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !337, file: !106, line: 189, baseType: !347, size: 64, align: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !337, file: !106, line: 190, baseType: !189, size: 64, align: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !328, file: !106, line: 303, baseType: !352, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !106, line: 194, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !104, !335}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !119, file: !106, line: 366, baseType: !196, size: 64, align: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !119, file: !106, line: 368, baseType: !128, size: 64, align: 64, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !119, file: !106, line: 372, baseType: !359, size: 64, align: 64, offset: 1472)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !106, line: 233, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!143, !104, !363, !189}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !106, line: 232, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!143, !104, !189}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !119, file: !106, line: 375, baseType: !242, size: 64, align: 64, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !119, file: !106, line: 379, baseType: !369, size: 64, align: 64, offset: 1600)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !106, line: 322, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!104, !104, !104, !143}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !119, file: !106, line: 382, baseType: !110, size: 64, align: 64, offset: 1664)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !119, file: !106, line: 385, baseType: !375, size: 64, align: 64, offset: 1728)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !106, line: 323, baseType: !215)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !119, file: !106, line: 386, baseType: !377, size: 64, align: 64, offset: 1792)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !106, line: 324, baseType: !215)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !119, file: !106, line: 389, baseType: !379, size: 64, align: 64, offset: 1856)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !381, line: 40, size: 256, align: 64, elements: !382)
!381 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!382 = !{!383, !384, !386, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !380, file: !381, line: 41, baseType: !128, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !380, file: !381, line: 42, baseType: !385, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !381, line: 18, baseType: !225)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !380, file: !381, line: 43, baseType: !143, size: 32, align: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !380, file: !381, line: 45, baseType: !128, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !119, file: !106, line: 390, baseType: !389, size: 64, align: 64, offset: 1920)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !391, line: 18, size: 320, align: 64, elements: !392)
!391 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !390, file: !391, line: 19, baseType: !151, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !391, line: 20, baseType: !143, size: 32, align: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !390, file: !391, line: 21, baseType: !110, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !391, line: 22, baseType: !143, size: 32, align: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !390, file: !391, line: 23, baseType: !151, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !119, file: !106, line: 391, baseType: !399, size: 64, align: 64, offset: 1984)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !401, line: 11, size: 320, align: 64, elements: !402)
!401 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!402 = !{!403, !404, !409, !414, !415}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !401, line: 12, baseType: !151, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !400, file: !401, line: 13, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !401, line: 8, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!104, !104, !189}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !400, file: !401, line: 14, baseType: !410, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !401, line: 9, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!143, !104, !104, !189}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !400, file: !401, line: 15, baseType: !151, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !400, file: !401, line: 16, baseType: !189, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !119, file: !106, line: 392, baseType: !118, size: 64, align: 64, offset: 2048)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !119, file: !106, line: 393, baseType: !104, size: 64, align: 64, offset: 2112)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !119, file: !106, line: 394, baseType: !419, size: 64, align: 64, offset: 2176)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !106, line: 325, baseType: !234)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !119, file: !106, line: 395, baseType: !421, size: 64, align: 64, offset: 2240)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !106, line: 326, baseType: !310)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !119, file: !106, line: 396, baseType: !110, size: 64, align: 64, offset: 2304)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !119, file: !106, line: 397, baseType: !424, size: 64, align: 64, offset: 2368)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !106, line: 327, baseType: !310)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !119, file: !106, line: 398, baseType: !426, size: 64, align: 64, offset: 2432)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !106, line: 329, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!104, !118, !110}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !119, file: !106, line: 399, baseType: !431, size: 64, align: 64, offset: 2496)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !106, line: 328, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!104, !118, !104, !104}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !119, file: !106, line: 400, baseType: !436, size: 64, align: 64, offset: 2560)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !106, line: 307, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !189}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !119, file: !106, line: 401, baseType: !242, size: 64, align: 64, offset: 2624)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !119, file: !106, line: 402, baseType: !104, size: 64, align: 64, offset: 2688)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !119, file: !106, line: 403, baseType: !104, size: 64, align: 64, offset: 2752)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !119, file: !106, line: 404, baseType: !104, size: 64, align: 64, offset: 2816)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !119, file: !106, line: 405, baseType: !104, size: 64, align: 64, offset: 2880)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !119, file: !106, line: 406, baseType: !104, size: 64, align: 64, offset: 2944)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !119, file: !106, line: 407, baseType: !134, size: 64, align: 64, offset: 3008)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !119, file: !106, line: 410, baseType: !448, size: 32, align: 32, offset: 3072)
!448 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !119, file: !106, line: 412, baseType: !134, size: 64, align: 64, offset: 3136)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !65, line: 140, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !452, line: 51, baseType: !448)
!452 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !454, line: 75, baseType: !455)
!454 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !115, line: 148, baseType: !116)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_T", file: !457, line: 114, baseType: !143)
!457 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/socketmodule.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !65, line: 224, size: 128, align: 32, elements: !460)
!460 = !{!461, !464, !467, !471}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !459, file: !65, line: 226, baseType: !462, size: 16, align: 16)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !463, line: 28, baseType: !176)
!463 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !459, file: !65, line: 227, baseType: !465, size: 16, align: 16, offset: 16)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !65, line: 96, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !452, line: 49, baseType: !176)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !459, file: !65, line: 228, baseType: !468, size: 32, align: 32, offset: 32)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !65, line: 141, size: 32, align: 32, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !468, file: !65, line: 143, baseType: !450, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !459, file: !65, line: 231, baseType: !472, size: 64, align: 8, offset: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 64, align: 8, elements: !474)
!473 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!474 = !{!475}
!475 = !DISubrange(count: 8)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !478, line: 29, size: 880, align: 16, elements: !479)
!478 = !DIFile(filename: "/usr/include/sys/un.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !477, file: !478, line: 31, baseType: !462, size: 16, align: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !477, file: !478, line: 32, baseType: !482, size: 864, align: 8, offset: 16)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 864, align: 8, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 108)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_nl", file: !487, line: 35, size: 96, align: 32, elements: !488)
!487 = !DIFile(filename: "/usr/include/linux/netlink.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!488 = !{!489, !492, !493, !496}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nl_family", scope: !486, file: !487, line: 36, baseType: !490, size: 16, align: 16)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !491, line: 11, baseType: !176)
!491 = !DIFile(filename: "/usr/include/linux/socket.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nl_pad", scope: !486, file: !487, line: 37, baseType: !176, size: 16, align: 16, offset: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nl_pid", scope: !486, file: !487, line: 38, baseType: !494, size: 32, align: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !495, line: 26, baseType: !448)
!495 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nl_groups", scope: !486, file: !487, line: 39, baseType: !494, size: 32, align: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !65, line: 238, size: 224, align: 32, elements: !499)
!499 = !{!500, !501, !502, !503, !520}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !498, file: !65, line: 240, baseType: !462, size: 16, align: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !498, file: !65, line: 241, baseType: !465, size: 16, align: 16, offset: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !498, file: !65, line: 242, baseType: !451, size: 32, align: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !498, file: !65, line: 243, baseType: !504, size: 128, align: 32, offset: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !65, line: 197, size: 128, align: 32, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !504, file: !65, line: 206, baseType: !507, size: 128, align: 32)
!507 = !DICompositeType(tag: DW_TAG_union_type, scope: !504, file: !65, line: 199, size: 128, align: 32, elements: !508)
!508 = !{!509, !514, !516}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !507, file: !65, line: 201, baseType: !510, size: 128, align: 8)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 128, align: 8, elements: !512)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !452, line: 48, baseType: !473)
!512 = !{!513}
!513 = !DISubrange(count: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !507, file: !65, line: 203, baseType: !515, size: 128, align: 16)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 128, align: 16, elements: !474)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !507, file: !65, line: 204, baseType: !517, size: 128, align: 32)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 128, align: 32, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 4)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !498, file: !65, line: 244, baseType: !451, size: 32, align: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ll", file: !523, line: 22, size: 160, align: 32, elements: !524)
!523 = !DIFile(filename: "/usr/include/netpacket/packet.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!524 = !{!525, !526, !527, !528, !529, !530, !531}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sll_family", scope: !522, file: !523, line: 24, baseType: !176, size: 16, align: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sll_protocol", scope: !522, file: !523, line: 25, baseType: !176, size: 16, align: 16, offset: 16)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sll_ifindex", scope: !522, file: !523, line: 26, baseType: !143, size: 32, align: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sll_hatype", scope: !522, file: !523, line: 27, baseType: !176, size: 16, align: 16, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sll_pkttype", scope: !522, file: !523, line: 28, baseType: !473, size: 8, align: 8, offset: 80)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sll_halen", scope: !522, file: !523, line: 29, baseType: !473, size: 8, align: 8, offset: 88)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sll_addr", scope: !522, file: !523, line: 30, baseType: !472, size: 64, align: 8, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_tipc", file: !534, line: 176, size: 128, align: 32, elements: !535)
!534 = !DIFile(filename: "/usr/include/linux/tipc.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!535 = !{!536, !537, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !533, file: !534, line: 177, baseType: !176, size: 16, align: 16)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "addrtype", scope: !533, file: !534, line: 178, baseType: !473, size: 8, align: 8, offset: 16)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !533, file: !534, line: 179, baseType: !178, size: 8, align: 8, offset: 24)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !533, file: !534, line: 187, baseType: !540, size: 96, align: 32, offset: 32)
!540 = !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !534, line: 180, size: 96, align: 32, elements: !541)
!541 = !{!542, !547, !553}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !540, file: !534, line: 181, baseType: !543, size: 64, align: 32)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "tipc_portid", file: !534, line: 46, size: 64, align: 32, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !543, file: !534, line: 47, baseType: !494, size: 32, align: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !543, file: !534, line: 48, baseType: !494, size: 32, align: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nameseq", scope: !540, file: !534, line: 182, baseType: !548, size: 96, align: 32)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "tipc_name_seq", file: !534, line: 56, size: 96, align: 32, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !548, file: !534, line: 57, baseType: !494, size: 32, align: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !548, file: !534, line: 58, baseType: !494, size: 32, align: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !548, file: !534, line: 59, baseType: !494, size: 32, align: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !534, line: 186, baseType: !554, size: 96, align: 32)
!554 = !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !534, line: 183, size: 96, align: 32, elements: !555)
!555 = !{!556, !561}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !534, line: 184, baseType: !557, size: 64, align: 32)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "tipc_name", file: !534, line: 51, size: 64, align: 32, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !557, file: !534, line: 52, baseType: !494, size: 32, align: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !557, file: !534, line: 53, baseType: !494, size: 32, align: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !554, file: !534, line: 185, baseType: !494, size: 32, align: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_can", file: !564, line: 131, size: 128, align: 32, elements: !565)
!564 = !DIFile(filename: "/usr/include/linux/can.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "can_family", scope: !563, file: !564, line: 132, baseType: !490, size: 16, align: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "can_ifindex", scope: !563, file: !564, line: 133, baseType: !143, size: 32, align: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "can_addr", scope: !563, file: !564, line: 139, baseType: !569, size: 64, align: 32, offset: 64)
!569 = !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !564, line: 134, size: 64, align: 32, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !569, file: !564, line: 136, baseType: !572, size: 64, align: 32)
!572 = !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !564, line: 136, size: 64, align: 32, elements: !573)
!573 = !{!574, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rx_id", scope: !572, file: !564, line: 136, baseType: !575, size: 32, align: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "canid_t", file: !564, line: 39, baseType: !494)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tx_id", scope: !572, file: !564, line: 136, baseType: !575, size: 32, align: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !16, line: 148, size: 128, align: 16, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !578, file: !16, line: 150, baseType: !462, size: 16, align: 16)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !578, file: !16, line: 151, baseType: !582, size: 112, align: 8, offset: 16)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 112, align: 8, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 14)
!585 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !589, line: 41, baseType: !590)
!589 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!590 = !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 31, size: 320, align: 64, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !590, file: !589, line: 32, baseType: !122, size: 192, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !590, file: !589, line: 33, baseType: !318, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !590, file: !589, line: 34, baseType: !180, size: 8, align: 8, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !16, line: 239, size: 128, align: 64, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !601, file: !16, line: 241, baseType: !194, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !601, file: !16, line: 246, baseType: !143, size: 32, align: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !601, file: !16, line: 247, baseType: !143, size: 32, align: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !601, file: !16, line: 249, baseType: !607, offset: 128)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, align: 8, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: -1)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !614, line: 43, size: 128, align: 64, elements: !615)
!614 = !DIFile(filename: "/usr/include/bits/uio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !613, file: !614, line: 45, baseType: !189, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !613, file: !614, line: 46, baseType: !194, size: 64, align: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !620, line: 40, baseType: !621)
!620 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!621 = !DICompositeType(tag: DW_TAG_structure_type, file: !620, line: 23, size: 320, align: 64, elements: !622)
!622 = !{!623, !624, !626}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !621, file: !620, line: 24, baseType: !122, size: 192, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !621, file: !620, line: 26, baseType: !625, size: 64, align: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !621, file: !620, line: 39, baseType: !110, size: 64, align: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !629, line: 33, baseType: !630)
!629 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!630 = !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 25, size: 256, align: 64, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !630, file: !629, line: 26, baseType: !122, size: 192, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !630, file: !629, line: 27, baseType: !634, size: 64, align: 64, offset: 192)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, align: 64, elements: !181)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "cmsginfo", scope: !638, file: !637, line: 3451, size: 704, align: 64, elements: !812)
!637 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/socketmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!638 = !DISubprogram(name: "sock_sendmsg", scope: !637, file: !637, line: 3444, type: !639, isLocal: true, isDefinition: true, scopeLine: 3445, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PySocketSockObject*, %struct._object*)* @sock_sendmsg, variables: !656)
!639 = !DISubroutineType(types: !640)
!640 = !{!104, !641, !104}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySocketSockObject", file: !457, line: 172, baseType: !643)
!643 = !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 161, size: 384, align: 64, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !654}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !643, file: !457, line: 162, baseType: !105, size: 128, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sock_fd", scope: !643, file: !457, line: 163, baseType: !456, size: 32, align: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sock_family", scope: !643, file: !457, line: 164, baseType: !143, size: 32, align: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sock_type", scope: !643, file: !457, line: 165, baseType: !143, size: 32, align: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sock_proto", scope: !643, file: !457, line: 166, baseType: !143, size: 32, align: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "errorhandler", scope: !643, file: !457, line: 167, baseType: !651, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!104}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sock_timeout", scope: !643, file: !457, line: 170, baseType: !655, size: 64, align: 64, offset: 320)
!655 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !686, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !715, !716, !719, !723, !724, !725, !728, !738, !739, !740, !741, !802, !804, !807, !809}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !638, file: !637, line: 3444, type: !641)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !638, file: !637, line: 3444, type: !104)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !638, file: !637, line: 3446, type: !110)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndataparts", scope: !638, file: !637, line: 3446, type: !110)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndatabufs", scope: !638, file: !637, line: 3446, type: !110)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncmsgs", scope: !638, file: !637, line: 3446, type: !110)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncmsgbufs", scope: !638, file: !637, line: 3446, type: !110)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "databufs", scope: !638, file: !637, line: 3447, type: !335)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iovs", scope: !638, file: !637, line: 3448, type: !612)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrbuf", scope: !638, file: !637, line: 3449, type: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_addr_t", file: !457, line: 155, baseType: !668)
!668 = !DICompositeType(tag: DW_TAG_union_type, name: "sock_addr", file: !457, line: 127, size: 1024, align: 64, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !684, !685}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !668, file: !457, line: 128, baseType: !459, size: 128, align: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !668, file: !457, line: 129, baseType: !578, size: 128, align: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !668, file: !457, line: 131, baseType: !477, size: 880, align: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !668, file: !457, line: 134, baseType: !486, size: 96, align: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !668, file: !457, line: 137, baseType: !498, size: 224, align: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !668, file: !457, line: 138, baseType: !676, size: 1024, align: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !16, line: 161, size: 1024, align: 64, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !676, file: !16, line: 163, baseType: !462, size: 16, align: 16)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !676, file: !16, line: 164, baseType: !196, size: 64, align: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !676, file: !16, line: 165, baseType: !681, size: 896, align: 8, offset: 128)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 896, align: 8, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !668, file: !457, line: 147, baseType: !522, size: 160, align: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "can", scope: !668, file: !457, line: 150, baseType: !563, size: 128, align: 32)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !638, file: !637, line: 3450, type: !687)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !16, line: 221, size: 448, align: 64, elements: !688)
!688 = !{!689, !690, !694, !695, !696, !697, !698}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !687, file: !16, line: 223, baseType: !189, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !687, file: !16, line: 224, baseType: !691, size: 32, align: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !692, line: 274, baseType: !693)
!692 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !115, line: 198, baseType: !448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !687, file: !16, line: 226, baseType: !612, size: 64, align: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !687, file: !16, line: 227, baseType: !194, size: 64, align: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !687, file: !16, line: 229, baseType: !189, size: 64, align: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !687, file: !16, line: 230, baseType: !194, size: 64, align: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !687, file: !16, line: 235, baseType: !143, size: 32, align: 32, offset: 384)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmsgs", scope: !638, file: !637, line: 3455, type: !635)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "controlbuf", scope: !638, file: !637, line: 3456, type: !189)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "controllen", scope: !638, file: !637, line: 3457, type: !194)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "controllen_last", scope: !638, file: !637, line: 3457, type: !194)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_sent", scope: !638, file: !637, line: 3458, type: !112)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrlen", scope: !638, file: !637, line: 3459, type: !143)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !638, file: !637, line: 3459, type: !143)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !638, file: !637, line: 3459, type: !143)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_arg", scope: !638, file: !637, line: 3460, type: !104)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmsg_arg", scope: !638, file: !637, line: 3460, type: !104)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr_arg", scope: !638, file: !637, line: 3460, type: !104)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_fast", scope: !638, file: !637, line: 3460, type: !104)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmsg_fast", scope: !638, file: !637, line: 3461, type: !104)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !638, file: !637, line: 3461, type: !104)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufsize", scope: !714, file: !637, line: 3529, type: !194)
!714 = distinct !DILexicalBlock(scope: !638, file: !637, line: 3528, column: 32)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !714, file: !637, line: 3529, type: !194)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmsgh", scope: !717, file: !637, line: 3557, type: !600)
!717 = distinct !DILexicalBlock(scope: !718, file: !637, line: 3556, column: 24)
!718 = distinct !DILexicalBlock(scope: !638, file: !637, line: 3556, column: 9)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg_len", scope: !720, file: !637, line: 3575, type: !194)
!720 = distinct !DILexicalBlock(scope: !721, file: !637, line: 3574, column: 41)
!721 = distinct !DILexicalBlock(scope: !722, file: !637, line: 3574, column: 9)
!722 = distinct !DILexicalBlock(scope: !717, file: !637, line: 3574, column: 9)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_len", scope: !720, file: !637, line: 3575, type: !194)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enough_space", scope: !720, file: !637, line: 3576, type: !143)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !726, file: !637, line: 3591, type: !194)
!726 = distinct !DILexicalBlock(scope: !727, file: !637, line: 3590, column: 55)
!727 = distinct !DILexicalBlock(scope: !720, file: !637, line: 3590, column: 17)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !729, file: !637, line: 3615, type: !730)
!729 = distinct !DILexicalBlock(scope: !638, file: !637, line: 3615, column: 5)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyTime_timeval", file: !731, line: 17, baseType: !732)
!731 = !DIFile(filename: "./Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !733, line: 30, size: 128, align: 64, elements: !734)
!733 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !732, file: !733, line: 32, baseType: !455, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !732, file: !733, line: 33, baseType: !737, size: 64, align: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !115, line: 150, baseType: !116)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deadline", scope: !729, file: !637, line: 3615, type: !730)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interval", scope: !729, file: !637, line: 3615, type: !655)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_timeout", scope: !729, file: !637, line: 3615, type: !143)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !742, file: !637, line: 3616, type: !744)
!742 = distinct !DILexicalBlock(scope: !743, file: !637, line: 3616, column: 5)
!743 = distinct !DILexicalBlock(scope: !729, file: !637, line: 3615, column: 413)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !746, line: 139, baseType: !747)
!746 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !746, line: 69, size: 1536, align: 64, elements: !748)
!748 = !{!749, !751, !752, !772, !775, !776, !777, !778, !779, !780, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !747, file: !746, line: 72, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !747, file: !746, line: 73, baseType: !750, size: 64, align: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !747, file: !746, line: 74, baseType: !753, size: 64, align: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !746, line: 44, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !746, line: 19, size: 832, align: 64, elements: !756)
!756 = !{!757, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !746, line: 21, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !755, file: !746, line: 22, baseType: !750, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !755, file: !746, line: 24, baseType: !104, size: 64, align: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !755, file: !746, line: 25, baseType: !104, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !755, file: !746, line: 26, baseType: !104, size: 64, align: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !755, file: !746, line: 27, baseType: !104, size: 64, align: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !755, file: !746, line: 28, baseType: !104, size: 64, align: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !755, file: !746, line: 30, baseType: !104, size: 64, align: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !755, file: !746, line: 31, baseType: !104, size: 64, align: 64, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !755, file: !746, line: 32, baseType: !104, size: 64, align: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !755, file: !746, line: 33, baseType: !143, size: 32, align: 32, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !755, file: !746, line: 34, baseType: !143, size: 32, align: 32, offset: 672)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !755, file: !746, line: 37, baseType: !143, size: 32, align: 32, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !755, file: !746, line: 43, baseType: !104, size: 64, align: 64, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !747, file: !746, line: 76, baseType: !773, size: 64, align: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !746, line: 50, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !747, file: !746, line: 77, baseType: !143, size: 32, align: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !747, file: !746, line: 78, baseType: !130, size: 8, align: 8, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !747, file: !746, line: 80, baseType: !130, size: 8, align: 8, offset: 296)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !747, file: !746, line: 85, baseType: !143, size: 32, align: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !747, file: !746, line: 86, baseType: !143, size: 32, align: 32, offset: 352)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !747, file: !746, line: 88, baseType: !781, size: 64, align: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !746, line: 54, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!143, !104, !773, !143, !104}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !747, file: !746, line: 89, baseType: !781, size: 64, align: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !747, file: !746, line: 90, baseType: !104, size: 64, align: 64, offset: 512)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !747, file: !746, line: 91, baseType: !104, size: 64, align: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !747, file: !746, line: 93, baseType: !104, size: 64, align: 64, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !747, file: !746, line: 94, baseType: !104, size: 64, align: 64, offset: 704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !747, file: !746, line: 95, baseType: !104, size: 64, align: 64, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !747, file: !746, line: 97, baseType: !104, size: 64, align: 64, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !747, file: !746, line: 98, baseType: !104, size: 64, align: 64, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !747, file: !746, line: 99, baseType: !104, size: 64, align: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !747, file: !746, line: 101, baseType: !104, size: 64, align: 64, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !747, file: !746, line: 103, baseType: !143, size: 32, align: 32, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !747, file: !746, line: 105, baseType: !104, size: 64, align: 64, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !747, file: !746, line: 106, baseType: !116, size: 64, align: 64, offset: 1216)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !747, file: !746, line: 108, baseType: !143, size: 32, align: 32, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !747, file: !746, line: 109, baseType: !104, size: 64, align: 64, offset: 1344)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !747, file: !746, line: 134, baseType: !437, size: 64, align: 64, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !747, file: !746, line: 135, baseType: !189, size: 64, align: 64, offset: 1472)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !803, file: !637, line: 3638, type: !104)
!803 = distinct !DILexicalBlock(scope: !638, file: !637, line: 3638, column: 8)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !805, file: !637, line: 3638, type: !104)
!805 = distinct !DILexicalBlock(scope: !806, file: !637, line: 3638, column: 101)
!806 = distinct !DILexicalBlock(scope: !803, file: !637, line: 3638, column: 67)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !808, file: !637, line: 3643, type: !104)
!808 = distinct !DILexicalBlock(scope: !638, file: !637, line: 3643, column: 8)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !810, file: !637, line: 3643, type: !104)
!810 = distinct !DILexicalBlock(scope: !811, file: !637, line: 3643, column: 101)
!811 = distinct !DILexicalBlock(scope: !808, file: !637, line: 3643, column: 67)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !636, file: !637, line: 3452, baseType: !143, size: 32, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !636, file: !637, line: 3453, baseType: !143, size: 32, align: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !636, file: !637, line: 3454, baseType: !336, size: 640, align: 64, offset: 64)
!816 = !{!817, !821, !825, !836, !841, !869, !876, !893, !976, !987, !997, !998, !1007, !1085, !1136, !1144, !1154, !1171, !1177, !1187, !1191, !1194, !1202, !1210, !1227, !1235, !1247, !1265, !1278, !1298, !1319, !1338, !1356, !1370, !1392, !1397, !1403, !1408, !1411, !1421, !1429, !1444, !1497, !1508, !1516, !1523, !1529, !1536, !1552, !638, !1556, !1563, !1568, !1584, !1593, !1603, !1610, !1637, !1679, !1687, !1705, !1716, !1727, !1746, !1758, !1772, !1779, !1807, !1816, !1825, !1837, !1846, !1858, !1864, !1871, !1879, !1891, !1946, !1973, !1976, !1981, !2008, !2016, !2025, !2031}
!817 = !DISubprogram(name: "PyInit__socket", scope: !637, file: !637, line: 5765, type: !652, isLocal: false, isDefinition: true, scopeLine: 5766, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__socket, variables: !818)
!818 = !{!819, !820}
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !817, file: !637, line: 5767, type: !104)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_ipv6", scope: !817, file: !637, line: 5767, type: !104)
!821 = !DISubprogram(name: "os_init", scope: !637, file: !637, line: 5719, type: !822, isLocal: true, isDefinition: true, scopeLine: 5720, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @os_init, variables: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{!143}
!824 = !{}
!825 = !DISubprogram(name: "sock_dealloc", scope: !637, file: !637, line: 3848, type: !826, isLocal: true, isDefinition: true, scopeLine: 3849, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PySocketSockObject*)* @sock_dealloc, variables: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !641}
!828 = !{!829, !830, !833, !834, !835}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !825, file: !637, line: 3848, type: !641)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !831, file: !637, line: 3851, type: !104)
!831 = distinct !DILexicalBlock(scope: !832, file: !637, line: 3850, column: 27)
!832 = distinct !DILexicalBlock(scope: !825, file: !637, line: 3850, column: 9)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !831, file: !637, line: 3851, type: !104)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !831, file: !637, line: 3851, type: !104)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_refcount", scope: !831, file: !637, line: 3852, type: !110)
!836 = !DISubprogram(name: "sock_repr", scope: !637, file: !637, line: 3869, type: !837, isLocal: true, isDefinition: true, scopeLine: 3870, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PySocketSockObject*)* @sock_repr, variables: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!104, !641}
!839 = !{!840}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !836, file: !637, line: 3869, type: !641)
!841 = !DISubprogram(name: "sock_accept", scope: !637, file: !637, line: 1961, type: !837, isLocal: true, isDefinition: true, scopeLine: 1962, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PySocketSockObject*)* @sock_accept, variables: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851, !853, !854, !855, !856, !859, !861, !864, !866}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !841, file: !637, line: 1961, type: !641)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrbuf", scope: !841, file: !637, line: 1963, type: !667)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newfd", scope: !841, file: !637, line: 1964, type: !456)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrlen", scope: !841, file: !637, line: 1965, type: !691)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sock", scope: !841, file: !637, line: 1966, type: !104)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr", scope: !841, file: !637, line: 1967, type: !104)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !841, file: !637, line: 1968, type: !104)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !841, file: !637, line: 1969, type: !143)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "now", scope: !852, file: !637, line: 1982, type: !730)
!852 = distinct !DILexicalBlock(scope: !841, file: !637, line: 1982, column: 5)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deadline", scope: !852, file: !637, line: 1982, type: !730)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interval", scope: !852, file: !637, line: 1982, type: !655)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_timeout", scope: !852, file: !637, line: 1982, type: !143)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !857, file: !637, line: 1984, type: !744)
!857 = distinct !DILexicalBlock(scope: !858, file: !637, line: 1984, column: 5)
!858 = distinct !DILexicalBlock(scope: !852, file: !637, line: 1982, column: 413)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !860, file: !637, line: 2046, type: !104)
!860 = distinct !DILexicalBlock(scope: !841, file: !637, line: 2046, column: 8)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !637, line: 2046, type: !104)
!862 = distinct !DILexicalBlock(scope: !863, file: !637, line: 2046, column: 96)
!863 = distinct !DILexicalBlock(scope: !860, file: !637, line: 2046, column: 62)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !865, file: !637, line: 2047, type: !104)
!865 = distinct !DILexicalBlock(scope: !841, file: !637, line: 2047, column: 8)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !637, line: 2047, type: !104)
!867 = distinct !DILexicalBlock(scope: !868, file: !637, line: 2047, column: 96)
!868 = distinct !DILexicalBlock(scope: !865, file: !637, line: 2047, column: 62)
!869 = !DISubprogram(name: "getsockaddrlen", scope: !637, file: !637, line: 1716, type: !870, isLocal: true, isDefinition: true, scopeLine: 1717, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PySocketSockObject*, i32*)* @getsockaddrlen, variables: !873)
!870 = !DISubroutineType(types: !871)
!871 = !{!143, !641, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!873 = !{!874, !875}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !869, file: !637, line: 1716, type: !641)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len_ret", arg: 2, scope: !869, file: !637, line: 1716, type: !872)
!876 = !DISubprogram(name: "internal_select_ex", scope: !637, file: !637, line: 596, type: !877, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PySocketSockObject*, i32, double)* @internal_select_ex, variables: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{!143, !641, !143, !655}
!879 = !{!880, !881, !882, !883, !884, !892}
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !876, file: !637, line: 596, type: !641)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writing", arg: 2, scope: !876, file: !637, line: 596, type: !143)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "interval", arg: 3, scope: !876, file: !637, line: 596, type: !655)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !876, file: !637, line: 598, type: !143)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pollfd", scope: !885, file: !637, line: 616, type: !886)
!885 = distinct !DILexicalBlock(scope: !876, file: !637, line: 615, column: 5)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !887, line: 39, size: 64, align: 32, elements: !888)
!887 = !DIFile(filename: "/usr/include/sys/poll.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !886, file: !887, line: 41, baseType: !143, size: 32, align: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !886, file: !887, line: 42, baseType: !585, size: 16, align: 16, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !886, file: !887, line: 43, baseType: !585, size: 16, align: 16, offset: 48)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !885, file: !637, line: 617, type: !143)
!893 = !DISubprogram(name: "makesockaddr", scope: !637, file: !637, line: 986, type: !894, isLocal: true, isDefinition: true, scopeLine: 987, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, %struct.sockaddr*, i64, i32)* @makesockaddr, variables: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!104, !456, !577, !194, !143}
!896 = !{!897, !898, !899, !900, !901, !904, !905, !906, !910, !911, !913, !915, !917, !919, !920, !921, !925, !926, !928, !929, !931, !933, !934, !967, !969, !970, !972, !974, !975}
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sockfd", arg: 1, scope: !893, file: !637, line: 986, type: !456)
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "addr", arg: 2, scope: !893, file: !637, line: 986, type: !577)
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "addrlen", arg: 3, scope: !893, file: !637, line: 986, type: !194)
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proto", arg: 4, scope: !893, file: !637, line: 986, type: !143)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !902, file: !637, line: 998, type: !458)
!902 = distinct !DILexicalBlock(scope: !903, file: !637, line: 997, column: 5)
!903 = distinct !DILexicalBlock(scope: !893, file: !637, line: 994, column: 30)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrobj", scope: !902, file: !637, line: 999, type: !104)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !902, file: !637, line: 1000, type: !104)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__v", scope: !907, file: !637, line: 1003, type: !176)
!907 = distinct !DILexicalBlock(scope: !908, file: !637, line: 1003, column: 64)
!908 = distinct !DILexicalBlock(scope: !909, file: !637, line: 1001, column: 22)
!909 = distinct !DILexicalBlock(scope: !902, file: !637, line: 1001, column: 13)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__x", scope: !907, file: !637, line: 1003, type: !176)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !912, file: !637, line: 1004, type: !104)
!912 = distinct !DILexicalBlock(scope: !908, file: !637, line: 1004, column: 16)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !914, file: !637, line: 1012, type: !476)
!914 = distinct !DILexicalBlock(scope: !903, file: !637, line: 1011, column: 5)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !916, file: !637, line: 1030, type: !485)
!916 = distinct !DILexicalBlock(scope: !903, file: !637, line: 1029, column: 8)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !918, file: !637, line: 1038, type: !497)
!918 = distinct !DILexicalBlock(scope: !903, file: !637, line: 1037, column: 5)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addrobj", scope: !918, file: !637, line: 1039, type: !104)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !918, file: !637, line: 1040, type: !104)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__v", scope: !922, file: !637, line: 1045, type: !176)
!922 = distinct !DILexicalBlock(scope: !923, file: !637, line: 1045, column: 49)
!923 = distinct !DILexicalBlock(scope: !924, file: !637, line: 1041, column: 22)
!924 = distinct !DILexicalBlock(scope: !918, file: !637, line: 1041, column: 13)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__x", scope: !922, file: !637, line: 1045, type: !176)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__v", scope: !927, file: !637, line: 1046, type: !448)
!927 = distinct !DILexicalBlock(scope: !923, file: !637, line: 1046, column: 49)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__x", scope: !927, file: !637, line: 1046, type: !448)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !930, file: !637, line: 1048, type: !104)
!930 = distinct !DILexicalBlock(scope: !923, file: !637, line: 1048, column: 16)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !932, file: !637, line: 1116, type: !521)
!932 = distinct !DILexicalBlock(scope: !903, file: !637, line: 1115, column: 5)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ifname", scope: !932, file: !637, line: 1117, type: !151)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ifr", scope: !932, file: !637, line: 1118, type: !935)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !936, line: 126, size: 320, align: 64, elements: !937)
!936 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!937 = !{!938, !943}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !935, file: !936, line: 133, baseType: !939, size: 128, align: 8)
!939 = !DICompositeType(tag: DW_TAG_union_type, scope: !935, file: !936, line: 130, size: 128, align: 8, elements: !940)
!940 = !{!941}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !939, file: !936, line: 132, baseType: !942, size: 128, align: 8)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 8, elements: !512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !935, file: !936, line: 149, baseType: !944, size: 192, align: 64, offset: 128)
!944 = !DICompositeType(tag: DW_TAG_union_type, scope: !935, file: !936, line: 135, size: 192, align: 64, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !954, !963, !964, !965}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !944, file: !936, line: 137, baseType: !578, size: 128, align: 16)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !944, file: !936, line: 138, baseType: !578, size: 128, align: 16)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !944, file: !936, line: 139, baseType: !578, size: 128, align: 16)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !944, file: !936, line: 140, baseType: !578, size: 128, align: 16)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !944, file: !936, line: 141, baseType: !578, size: 128, align: 16)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !944, file: !936, line: 142, baseType: !585, size: 16, align: 16)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !944, file: !936, line: 143, baseType: !143, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !944, file: !936, line: 144, baseType: !143, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !944, file: !936, line: 145, baseType: !955, size: 192, align: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !936, line: 111, size: 192, align: 64, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !955, file: !936, line: 113, baseType: !196, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !955, file: !936, line: 114, baseType: !196, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !955, file: !936, line: 115, baseType: !176, size: 16, align: 16, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !955, file: !936, line: 116, baseType: !473, size: 8, align: 8, offset: 144)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !955, file: !936, line: 117, baseType: !473, size: 8, align: 8, offset: 152)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !955, file: !936, line: 118, baseType: !473, size: 8, align: 8, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !944, file: !936, line: 146, baseType: !942, size: 128, align: 8)
