; ModuleID = 'irs-onlybc/statement.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !19, subprograms: !386, globals: !670)
!1 = !DIFile(filename: "statement.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 43, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_sqlite/statement.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "TYPE_LONG", value: 0)
!7 = !DIEnumerator(name: "TYPE_FLOAT", value: 1)
!8 = !DIEnumerator(name: "TYPE_UNICODE", value: 2)
!9 = !DIEnumerator(name: "TYPE_BUFFER", value: 3)
!10 = !DIEnumerator(name: "TYPE_UNKNOWN", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 34, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "LINECOMMENT_1", value: 0)
!14 = !DIEnumerator(name: "IN_LINECOMMENT", value: 1)
!15 = !DIEnumerator(name: "COMMENTSTART_1", value: 2)
!16 = !DIEnumerator(name: "IN_COMMENT", value: 3)
!17 = !DIEnumerator(name: "COMMENTEND_1", value: 4)
!18 = !DIEnumerator(name: "NORMAL", value: 5)
!19 = !{!20, !21, !60, !366, !368, !369, !377}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !23, line: 109, baseType: !24)
!23 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !23, line: 105, size: 128, align: 64, elements: !25)
!25 = !{!26, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !24, file: !23, line: 107, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !28, line: 177, baseType: !29)
!28 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !30, line: 102, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !32, line: 181, baseType: !33)
!32 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !24, file: !23, line: 108, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !23, line: 334, size: 3200, align: 64, elements: !37)
!37 = !{!38, !44, !48, !49, !50, !55, !118, !123, !128, !129, !134, !186, !217, !229, !235, !236, !237, !239, !241, !272, !273, !274, !283, !284, !289, !290, !292, !294, !304, !314, !332, !333, !334, !336, !338, !339, !341, !346, !351, !356, !357, !358, !359, !360, !361, !362, !363, !365}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !36, file: !23, line: 335, baseType: !39, size: 192, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !23, line: 114, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 111, size: 192, align: 64, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !40, file: !23, line: 112, baseType: !22, size: 128, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !40, file: !23, line: 113, baseType: !27, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !36, file: !23, line: 336, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !36, file: !23, line: 337, baseType: !27, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !36, file: !23, line: 337, baseType: !27, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !36, file: !23, line: 341, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !23, line: 308, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !21}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !36, file: !23, line: 342, baseType: !56, size: 64, align: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !23, line: 314, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !21, !61, !60}
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 48, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 246, size: 1728, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!65 = !{!66, !67, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !87, !88, !89, !90, !92, !94, !96, !100, !103, !105, !106, !107, !108, !109, !113, !114}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 247, baseType: !60, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 252, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 253, baseType: !68, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 254, baseType: !68, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 255, baseType: !68, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 256, baseType: !68, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 257, baseType: !68, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 258, baseType: !68, size: 64, align: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 259, baseType: !68, size: 64, align: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 261, baseType: !68, size: 64, align: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 262, baseType: !68, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 263, baseType: !68, size: 64, align: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 265, baseType: !80, size: 64, align: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 161, size: 192, align: 64, elements: !82)
!82 = !{!83, !84, !86}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !81, file: !64, line: 162, baseType: !80, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !81, file: !64, line: 163, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !81, file: !64, line: 167, baseType: !60, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 267, baseType: !85, size: 64, align: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 269, baseType: !60, size: 32, align: 32, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 273, baseType: !60, size: 32, align: 32, offset: 928)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 275, baseType: !91, size: 64, align: 64, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !32, line: 140, baseType: !33)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 279, baseType: !93, size: 16, align: 16, offset: 1024)
!93 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 280, baseType: !95, size: 8, align: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 281, baseType: !97, size: 8, align: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 285, baseType: !101, size: 64, align: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 155, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 294, baseType: !104, size: 64, align: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !32, line: 141, baseType: !33)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !63, file: !64, line: 303, baseType: !20, size: 64, align: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !63, file: !64, line: 304, baseType: !20, size: 64, align: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !63, file: !64, line: 305, baseType: !20, size: 64, align: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !63, file: !64, line: 306, baseType: !20, size: 64, align: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 307, baseType: !110, size: 64, align: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !112)
!111 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 309, baseType: !60, size: 32, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 311, baseType: !115, size: 160, align: 8, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !36, file: !23, line: 343, baseType: !119, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !23, line: 316, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!21, !21, !68}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !36, file: !23, line: 344, baseType: !124, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !23, line: 318, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!60, !21, !68, !21}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !36, file: !23, line: 345, baseType: !20, size: 64, align: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !36, file: !23, line: 346, baseType: !130, size: 64, align: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !23, line: 320, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!21, !21}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !36, file: !23, line: 350, baseType: !135, size: 64, align: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !23, line: 278, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 236, size: 2176, align: 64, elements: !138)
!138 = !{!139, !144, !145, !146, !147, !148, !153, !155, !156, !157, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !137, file: !23, line: 241, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !23, line: 166, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!21, !21, !21}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !137, file: !23, line: 242, baseType: !140, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !137, file: !23, line: 243, baseType: !140, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !137, file: !23, line: 244, baseType: !140, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !137, file: !23, line: 245, baseType: !140, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !137, file: !23, line: 246, baseType: !149, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !23, line: 167, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!21, !21, !21, !21}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !137, file: !23, line: 247, baseType: !154, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !23, line: 165, baseType: !131)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !137, file: !23, line: 248, baseType: !154, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !137, file: !23, line: 249, baseType: !154, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !137, file: !23, line: 250, baseType: !158, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !23, line: 168, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!60, !21}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !137, file: !23, line: 251, baseType: !154, size: 64, align: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !137, file: !23, line: 252, baseType: !140, size: 64, align: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !137, file: !23, line: 253, baseType: !140, size: 64, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !137, file: !23, line: 254, baseType: !140, size: 64, align: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !137, file: !23, line: 255, baseType: !140, size: 64, align: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !137, file: !23, line: 256, baseType: !140, size: 64, align: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !137, file: !23, line: 257, baseType: !154, size: 64, align: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !137, file: !23, line: 258, baseType: !20, size: 64, align: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !137, file: !23, line: 259, baseType: !154, size: 64, align: 64, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !137, file: !23, line: 261, baseType: !140, size: 64, align: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !137, file: !23, line: 262, baseType: !140, size: 64, align: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !137, file: !23, line: 263, baseType: !140, size: 64, align: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !137, file: !23, line: 264, baseType: !140, size: 64, align: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !137, file: !23, line: 265, baseType: !149, size: 64, align: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !137, file: !23, line: 266, baseType: !140, size: 64, align: 64, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !137, file: !23, line: 267, baseType: !140, size: 64, align: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !137, file: !23, line: 268, baseType: !140, size: 64, align: 64, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !137, file: !23, line: 269, baseType: !140, size: 64, align: 64, offset: 1728)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !137, file: !23, line: 270, baseType: !140, size: 64, align: 64, offset: 1792)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !137, file: !23, line: 272, baseType: !140, size: 64, align: 64, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !137, file: !23, line: 273, baseType: !140, size: 64, align: 64, offset: 1920)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !137, file: !23, line: 274, baseType: !140, size: 64, align: 64, offset: 1984)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !137, file: !23, line: 275, baseType: !140, size: 64, align: 64, offset: 2048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !137, file: !23, line: 277, baseType: !154, size: 64, align: 64, offset: 2112)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !36, file: !23, line: 351, baseType: !187, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !23, line: 292, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 280, size: 640, align: 64, elements: !190)
!190 = !{!191, !196, !197, !202, !203, !204, !209, !210, !215, !216}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !189, file: !23, line: 281, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !23, line: 169, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!27, !21}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !189, file: !23, line: 282, baseType: !140, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !189, file: !23, line: 283, baseType: !198, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !23, line: 170, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!21, !21, !27}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !189, file: !23, line: 284, baseType: !198, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !189, file: !23, line: 285, baseType: !20, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !189, file: !23, line: 286, baseType: !205, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !23, line: 172, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!60, !21, !27, !21}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !189, file: !23, line: 287, baseType: !20, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !189, file: !23, line: 288, baseType: !211, size: 64, align: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !23, line: 231, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!60, !21, !21}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !189, file: !23, line: 290, baseType: !140, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !189, file: !23, line: 291, baseType: !198, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !36, file: !23, line: 352, baseType: !218, size: 64, align: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !23, line: 298, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 294, size: 192, align: 64, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !220, file: !23, line: 295, baseType: !192, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !220, file: !23, line: 296, baseType: !140, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !220, file: !23, line: 297, baseType: !225, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !23, line: 174, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!60, !21, !21, !21}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !36, file: !23, line: 356, baseType: !230, size: 64, align: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !23, line: 321, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !21}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !28, line: 186, baseType: !27)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !36, file: !23, line: 357, baseType: !149, size: 64, align: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !36, file: !23, line: 358, baseType: !130, size: 64, align: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !36, file: !23, line: 359, baseType: !238, size: 64, align: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !23, line: 317, baseType: !141)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !36, file: !23, line: 360, baseType: !240, size: 64, align: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !23, line: 319, baseType: !226)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !36, file: !23, line: 363, baseType: !242, size: 64, align: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !23, line: 304, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 301, size: 128, align: 64, elements: !245)
!245 = !{!246, !267}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !244, file: !23, line: 302, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !23, line: 193, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!60, !21, !251, !60}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !23, line: 191, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !23, line: 178, size: 640, align: 64, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !264, !265, !266}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !253, file: !23, line: 179, baseType: !20, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !253, file: !23, line: 180, baseType: !21, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !253, file: !23, line: 181, baseType: !27, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !253, file: !23, line: 182, baseType: !27, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !253, file: !23, line: 184, baseType: !60, size: 32, align: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !253, file: !23, line: 185, baseType: !60, size: 32, align: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !253, file: !23, line: 186, baseType: !68, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !253, file: !23, line: 187, baseType: !263, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !253, file: !23, line: 188, baseType: !263, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !253, file: !23, line: 189, baseType: !263, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !253, file: !23, line: 190, baseType: !20, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !244, file: !23, line: 303, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !23, line: 194, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !21, !251}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !36, file: !23, line: 366, baseType: !112, size: 64, align: 64, offset: 1344)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !36, file: !23, line: 368, baseType: !45, size: 64, align: 64, offset: 1408)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !36, file: !23, line: 372, baseType: !275, size: 64, align: 64, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !23, line: 233, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!60, !21, !279, !20}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !23, line: 232, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!60, !21, !20}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !36, file: !23, line: 375, baseType: !158, size: 64, align: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !36, file: !23, line: 379, baseType: !285, size: 64, align: 64, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !23, line: 322, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!21, !21, !21, !60}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !36, file: !23, line: 382, baseType: !27, size: 64, align: 64, offset: 1664)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !36, file: !23, line: 385, baseType: !291, size: 64, align: 64, offset: 1728)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !23, line: 323, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !36, file: !23, line: 386, baseType: !293, size: 64, align: 64, offset: 1792)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !23, line: 324, baseType: !131)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !36, file: !23, line: 389, baseType: !295, size: 64, align: 64, offset: 1856)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !297, line: 40, size: 256, align: 64, elements: !298)
!297 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!298 = !{!299, !300, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !296, file: !297, line: 41, baseType: !45, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !296, file: !297, line: 42, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !297, line: 18, baseType: !141)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !296, file: !297, line: 43, baseType: !60, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !296, file: !297, line: 45, baseType: !45, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !36, file: !23, line: 390, baseType: !305, size: 64, align: 64, offset: 1920)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !307, line: 18, size: 320, align: 64, elements: !308)
!307 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!308 = !{!309, !310, !311, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 19, baseType: !68, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !307, line: 20, baseType: !60, size: 32, align: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !306, file: !307, line: 21, baseType: !27, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !307, line: 22, baseType: !60, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !306, file: !307, line: 23, baseType: !68, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !36, file: !23, line: 391, baseType: !315, size: 64, align: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !317, line: 11, size: 320, align: 64, elements: !318)
!317 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!318 = !{!319, !320, !325, !330, !331}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 12, baseType: !68, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !316, file: !317, line: 13, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !317, line: 8, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!21, !21, !20}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !316, file: !317, line: 14, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !317, line: 9, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!60, !21, !21, !20}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !316, file: !317, line: 15, baseType: !68, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !316, file: !317, line: 16, baseType: !20, size: 64, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !36, file: !23, line: 392, baseType: !35, size: 64, align: 64, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !36, file: !23, line: 393, baseType: !21, size: 64, align: 64, offset: 2112)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !36, file: !23, line: 394, baseType: !335, size: 64, align: 64, offset: 2176)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !23, line: 325, baseType: !150)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !36, file: !23, line: 395, baseType: !337, size: 64, align: 64, offset: 2240)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !23, line: 326, baseType: !226)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !36, file: !23, line: 396, baseType: !27, size: 64, align: 64, offset: 2304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !36, file: !23, line: 397, baseType: !340, size: 64, align: 64, offset: 2368)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !23, line: 327, baseType: !226)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !36, file: !23, line: 398, baseType: !342, size: 64, align: 64, offset: 2432)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !23, line: 329, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!21, !35, !27}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !36, file: !23, line: 399, baseType: !347, size: 64, align: 64, offset: 2496)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !23, line: 328, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!21, !35, !21, !21}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !36, file: !23, line: 400, baseType: !352, size: 64, align: 64, offset: 2560)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !23, line: 307, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !20}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !36, file: !23, line: 401, baseType: !158, size: 64, align: 64, offset: 2624)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !36, file: !23, line: 402, baseType: !21, size: 64, align: 64, offset: 2688)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !36, file: !23, line: 403, baseType: !21, size: 64, align: 64, offset: 2752)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !36, file: !23, line: 404, baseType: !21, size: 64, align: 64, offset: 2816)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !36, file: !23, line: 405, baseType: !21, size: 64, align: 64, offset: 2880)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !36, file: !23, line: 406, baseType: !21, size: 64, align: 64, offset: 2944)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !36, file: !23, line: 407, baseType: !51, size: 64, align: 64, offset: 3008)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !36, file: !23, line: 410, baseType: !364, size: 32, align: 32, offset: 3072)
!364 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !36, file: !23, line: 412, baseType: !51, size: 64, align: 64, offset: 3136)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_destructor_type", file: !367, line: 4239, baseType: !353)
!367 = !DIFile(filename: "/usr/include/sqlite3.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !371, line: 33, baseType: !372)
!371 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!372 = !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 25, size: 256, align: 64, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 26, baseType: !39, size: 192, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !372, file: !371, line: 27, baseType: !376, size: 64, align: 64, offset: 192)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, align: 64, elements: !98)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !379, line: 40, baseType: !380)
!379 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 23, size: 320, align: 64, elements: !381)
!381 = !{!382, !383, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !380, file: !379, line: 24, baseType: !39, size: 192, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !380, file: !379, line: 26, baseType: !384, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !380, file: !379, line: 39, baseType: !27, size: 64, align: 64, offset: 256)
!386 = !{!387, !534, !552, !607, !620, !630, !638, !643, !655, !659, !662}
!387 = !DISubprogram(name: "pysqlite_statement_create", scope: !4, file: !4, line: 51, type: !388, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Statement*, %struct.pysqlite_Connection*, %struct._object*)* @pysqlite_statement_create, variables: !466)
!388 = !DISubroutineType(types: !389)
!389 = !{!60, !390, !407, !21}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Statement", file: !392, line: 42, baseType: !393)
!392 = !DIFile(filename: "Modules/_sqlite/statement.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!393 = !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 34, size: 448, align: 64, elements: !394)
!394 = !{!395, !396, !400, !404, !405, !406}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !393, file: !392, line: 36, baseType: !22, size: 128, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !393, file: !392, line: 37, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !367, line: 228, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !367, line: 228, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !393, file: !392, line: 38, baseType: !401, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !367, line: 2911, baseType: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !367, line: 2911, flags: DIFlagFwdDecl)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sql", scope: !393, file: !392, line: 39, baseType: !21, size: 64, align: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !393, file: !392, line: 40, baseType: !60, size: 32, align: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !393, file: !392, line: 41, baseType: !21, size: 64, align: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Connection", file: !409, line: 112, baseType: !410)
!409 = !DIFile(filename: "Modules/_sqlite/connection.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !409, line: 35, size: 1792, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !410, file: !409, line: 37, baseType: !22, size: 128, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !410, file: !409, line: 38, baseType: !397, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "inTransaction", scope: !410, file: !409, line: 42, baseType: !47, size: 8, align: 8, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "detect_types", scope: !410, file: !409, line: 46, baseType: !60, size: 32, align: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !410, file: !409, line: 49, baseType: !417, size: 64, align: 64, offset: 256)
!417 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_started", scope: !410, file: !409, line: 53, baseType: !417, size: 64, align: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "isolation_level", scope: !410, file: !409, line: 56, baseType: !21, size: 64, align: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "begin_statement", scope: !410, file: !409, line: 60, baseType: !68, size: 64, align: 64, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "check_same_thread", scope: !410, file: !409, line: 64, baseType: !60, size: 32, align: 32, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !410, file: !409, line: 66, baseType: !60, size: 32, align: 32, offset: 544)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ident", scope: !410, file: !409, line: 69, baseType: !33, size: 64, align: 64, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "statement_cache", scope: !410, file: !409, line: 71, baseType: !425, size: 64, align: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Cache", file: !427, line: 59, baseType: !428)
!427 = !DIFile(filename: "Modules/_sqlite/cache.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!428 = !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 42, size: 512, align: 64, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !446, !447}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !428, file: !427, line: 44, baseType: !22, size: 128, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !428, file: !427, line: 45, baseType: !60, size: 32, align: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !428, file: !427, line: 48, baseType: !21, size: 64, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !428, file: !427, line: 51, baseType: !21, size: 64, align: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !428, file: !427, line: 53, baseType: !435, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Node", file: !427, line: 40, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_pysqlite_Node", file: !427, line: 32, size: 448, align: 64, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !445}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !437, file: !427, line: 34, baseType: !22, size: 128, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !437, file: !427, line: 35, baseType: !21, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !427, line: 36, baseType: !21, size: 64, align: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !437, file: !427, line: 37, baseType: !33, size: 64, align: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !427, line: 38, baseType: !444, size: 64, align: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !427, line: 39, baseType: !444, size: 64, align: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !428, file: !427, line: 54, baseType: !435, size: 64, align: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "decref_factory", scope: !428, file: !427, line: 58, baseType: !60, size: 32, align: 32, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "statements", scope: !410, file: !409, line: 74, baseType: !21, size: 64, align: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !410, file: !409, line: 75, baseType: !21, size: 64, align: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "created_statements", scope: !410, file: !409, line: 79, baseType: !60, size: 32, align: 32, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "created_cursors", scope: !410, file: !409, line: 80, baseType: !60, size: 32, align: 32, offset: 864)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "row_factory", scope: !410, file: !409, line: 82, baseType: !21, size: 64, align: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "text_factory", scope: !410, file: !409, line: 90, baseType: !21, size: 64, align: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "function_pinboard", scope: !410, file: !409, line: 96, baseType: !21, size: 64, align: 64, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "collations", scope: !410, file: !409, line: 99, baseType: !21, size: 64, align: 64, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Warning", scope: !410, file: !409, line: 102, baseType: !21, size: 64, align: 64, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !410, file: !409, line: 103, baseType: !21, size: 64, align: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceError", scope: !410, file: !409, line: 104, baseType: !21, size: 64, align: 64, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DatabaseError", scope: !410, file: !409, line: 105, baseType: !21, size: 64, align: 64, offset: 1344)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DataError", scope: !410, file: !409, line: 106, baseType: !21, size: 64, align: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "OperationalError", scope: !410, file: !409, line: 107, baseType: !21, size: 64, align: 64, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "IntegrityError", scope: !410, file: !409, line: 108, baseType: !21, size: 64, align: 64, offset: 1536)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "InternalError", scope: !410, file: !409, line: 109, baseType: !21, size: 64, align: 64, offset: 1600)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ProgrammingError", scope: !410, file: !409, line: 110, baseType: !21, size: 64, align: 64, offset: 1664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "NotSupportedError", scope: !410, file: !409, line: 111, baseType: !21, size: 64, align: 64, offset: 1728)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !387, file: !4, line: 51, type: !390)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "connection", arg: 2, scope: !387, file: !4, line: 51, type: !407)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sql", arg: 3, scope: !387, file: !4, line: 51, type: !21)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !387, file: !4, line: 53, type: !45)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !387, file: !4, line: 54, type: !60)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sql_cstr", scope: !387, file: !4, line: 55, type: !45)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sql_cstr_len", scope: !387, file: !4, line: 56, type: !27)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !475, file: !4, line: 71, type: !476)
!475 = distinct !DILexicalBlock(scope: !387, file: !4, line: 71, column: 5)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !478, line: 139, baseType: !479)
!478 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !478, line: 69, size: 1536, align: 64, elements: !480)
!480 = !{!481, !483, !484, !504, !507, !508, !509, !510, !511, !512, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !479, file: !478, line: 72, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !478, line: 73, baseType: !482, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !479, file: !478, line: 74, baseType: !485, size: 64, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !478, line: 44, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !478, line: 19, size: 832, align: 64, elements: !488)
!488 = !{!489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !478, line: 21, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !487, file: !478, line: 22, baseType: !482, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !487, file: !478, line: 24, baseType: !21, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !487, file: !478, line: 25, baseType: !21, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !487, file: !478, line: 26, baseType: !21, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !487, file: !478, line: 27, baseType: !21, size: 64, align: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !487, file: !478, line: 28, baseType: !21, size: 64, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !487, file: !478, line: 30, baseType: !21, size: 64, align: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !487, file: !478, line: 31, baseType: !21, size: 64, align: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !487, file: !478, line: 32, baseType: !21, size: 64, align: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !487, file: !478, line: 33, baseType: !60, size: 32, align: 32, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !487, file: !478, line: 34, baseType: !60, size: 32, align: 32, offset: 672)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !487, file: !478, line: 37, baseType: !60, size: 32, align: 32, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !487, file: !478, line: 43, baseType: !21, size: 64, align: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !479, file: !478, line: 76, baseType: !505, size: 64, align: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !478, line: 50, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !479, file: !478, line: 77, baseType: !60, size: 32, align: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !479, file: !478, line: 78, baseType: !47, size: 8, align: 8, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !479, file: !478, line: 80, baseType: !47, size: 8, align: 8, offset: 296)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !479, file: !478, line: 85, baseType: !60, size: 32, align: 32, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !479, file: !478, line: 86, baseType: !60, size: 32, align: 32, offset: 352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !479, file: !478, line: 88, baseType: !513, size: 64, align: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !478, line: 54, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!60, !21, !505, !60, !21}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !479, file: !478, line: 89, baseType: !513, size: 64, align: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !479, file: !478, line: 90, baseType: !21, size: 64, align: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !479, file: !478, line: 91, baseType: !21, size: 64, align: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !479, file: !478, line: 93, baseType: !21, size: 64, align: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !479, file: !478, line: 94, baseType: !21, size: 64, align: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !479, file: !478, line: 95, baseType: !21, size: 64, align: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !479, file: !478, line: 97, baseType: !21, size: 64, align: 64, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !479, file: !478, line: 98, baseType: !21, size: 64, align: 64, offset: 896)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !479, file: !478, line: 99, baseType: !21, size: 64, align: 64, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !479, file: !478, line: 101, baseType: !21, size: 64, align: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !479, file: !478, line: 103, baseType: !60, size: 32, align: 32, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !479, file: !478, line: 105, baseType: !21, size: 64, align: 64, offset: 1152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !479, file: !478, line: 106, baseType: !33, size: 64, align: 64, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !479, file: !478, line: 108, baseType: !60, size: 32, align: 32, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !479, file: !478, line: 109, baseType: !21, size: 64, align: 64, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !479, file: !478, line: 134, baseType: !353, size: 64, align: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !479, file: !478, line: 135, baseType: !20, size: 64, align: 64, offset: 1472)
!534 = !DISubprogram(name: "pysqlite_statement_bind_parameter", scope: !4, file: !4, line: 90, type: !535, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Statement*, i32, %struct._object*)* @pysqlite_statement_bind_parameter, variables: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{!60, !390, !60, !21}
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !547}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !534, file: !4, line: 90, type: !390)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 2, scope: !534, file: !4, line: 90, type: !60)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parameter", arg: 3, scope: !534, file: !4, line: 90, type: !21)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !534, file: !4, line: 92, type: !60)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !534, file: !4, line: 93, type: !45)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !534, file: !4, line: 94, type: !68)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !534, file: !4, line: 95, type: !27)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "paramtype", scope: !534, file: !4, line: 96, type: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "parameter_type", file: !4, line: 49, baseType: !3)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !548, file: !4, line: 123, type: !550)
!548 = distinct !DILexicalBlock(scope: !549, file: !4, line: 122, column: 25)
!549 = distinct !DILexicalBlock(scope: !534, file: !4, line: 121, column: 24)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite_int64", file: !367, line: 253, baseType: !551)
!551 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!552 = !DISubprogram(name: "pysqlite_statement_bind_parameters", scope: !4, file: !4, line: 179, type: !553, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pysqlite_Statement*, %struct._object*)* @pysqlite_statement_bind_parameters, variables: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !390, !21}
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !567, !576, !580, !586, !588, !595, !599, !605}
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !552, file: !4, line: 179, type: !390)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parameters", arg: 2, scope: !552, file: !4, line: 179, type: !21)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current_param", scope: !552, file: !4, line: 181, type: !21)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adapted", scope: !552, file: !4, line: 182, type: !21)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binding_name", scope: !552, file: !4, line: 183, type: !45)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !552, file: !4, line: 184, type: !60)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !552, file: !4, line: 185, type: !60)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_params_needed", scope: !552, file: !4, line: 186, type: !60)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_params", scope: !552, file: !4, line: 187, type: !27)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !566, file: !4, line: 189, type: !476)
!566 = distinct !DILexicalBlock(scope: !552, file: !4, line: 189, column: 5)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !568, file: !4, line: 212, type: !21)
!568 = distinct !DILexicalBlock(scope: !569, file: !4, line: 212, column: 20)
