; ModuleID = 'irs-onlybc/stringio.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !427, globals: !725)
!1 = !DIFile(filename: "stringio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !32, !35, !113, !371, !23, !389, !75, !391, !392, !67, !400}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !13, line: 253, baseType: !14)
!13 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !13, line: 246, size: 192, align: 64, elements: !15)
!15 = !{!16, !30}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !14, file: !13, line: 251, baseType: !17, size: 192, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !13, line: 247, size: 192, align: 64, elements: !18)
!18 = !{!19, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !17, file: !13, line: 248, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !17, file: !13, line: 249, baseType: !20, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !17, file: !13, line: 250, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !24, line: 177, baseType: !25)
!24 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 102, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 181, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !14, file: !13, line: 252, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 62, baseType: !34)
!33 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !37, line: 109, baseType: !38)
!37 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !37, line: 105, size: 128, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !38, file: !37, line: 107, baseType: !23, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !38, file: !37, line: 108, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !37, line: 334, size: 3200, align: 64, elements: !44)
!44 = !{!45, !51, !55, !56, !57, !62, !123, !128, !133, !134, !139, !191, !222, !234, !240, !241, !242, !244, !246, !277, !278, !279, !288, !289, !294, !295, !297, !299, !309, !319, !337, !338, !339, !341, !343, !344, !346, !351, !356, !361, !362, !363, !364, !365, !366, !367, !368, !370}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !43, file: !37, line: 335, baseType: !46, size: 192, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !37, line: 114, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 111, size: 192, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !47, file: !37, line: 112, baseType: !36, size: 128, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !47, file: !37, line: 113, baseType: !23, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !43, file: !37, line: 336, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !43, file: !37, line: 337, baseType: !23, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !43, file: !37, line: 337, baseType: !23, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !43, file: !37, line: 341, baseType: !58, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !37, line: 308, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !35}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !43, file: !37, line: 342, baseType: !63, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !37, line: 314, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !35, !68, !67}
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 48, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !71, line: 246, size: 1728, align: 64, elements: !72)
!71 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!72 = !{!73, !74, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !94, !95, !96, !97, !99, !101, !103, !107, !110, !112, !114, !115, !116, !117, !118, !119}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !70, file: !71, line: 247, baseType: !67, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !70, file: !71, line: 252, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !70, file: !71, line: 253, baseType: !75, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !70, file: !71, line: 254, baseType: !75, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !70, file: !71, line: 255, baseType: !75, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !70, file: !71, line: 256, baseType: !75, size: 64, align: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !70, file: !71, line: 257, baseType: !75, size: 64, align: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !70, file: !71, line: 258, baseType: !75, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !70, file: !71, line: 259, baseType: !75, size: 64, align: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !70, file: !71, line: 261, baseType: !75, size: 64, align: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !70, file: !71, line: 262, baseType: !75, size: 64, align: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !70, file: !71, line: 263, baseType: !75, size: 64, align: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !70, file: !71, line: 265, baseType: !87, size: 64, align: 64, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !71, line: 161, size: 192, align: 64, elements: !89)
!89 = !{!90, !91, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !88, file: !71, line: 162, baseType: !87, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !88, file: !71, line: 163, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !88, file: !71, line: 167, baseType: !67, size: 32, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !70, file: !71, line: 267, baseType: !92, size: 64, align: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !70, file: !71, line: 269, baseType: !67, size: 32, align: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !70, file: !71, line: 273, baseType: !67, size: 32, align: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !70, file: !71, line: 275, baseType: !98, size: 64, align: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 140, baseType: !29)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !70, file: !71, line: 279, baseType: !100, size: 16, align: 16, offset: 1024)
!100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !70, file: !71, line: 280, baseType: !102, size: 8, align: 8, offset: 1040)
!102 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !70, file: !71, line: 281, baseType: !104, size: 8, align: 8, offset: 1048)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 1)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !70, file: !71, line: 285, baseType: !108, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !71, line: 155, baseType: null)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !70, file: !71, line: 294, baseType: !111, size: 64, align: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 141, baseType: !29)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !70, file: !71, line: 303, baseType: !113, size: 64, align: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !70, file: !71, line: 304, baseType: !113, size: 64, align: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !70, file: !71, line: 305, baseType: !113, size: 64, align: 64, offset: 1344)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !70, file: !71, line: 306, baseType: !113, size: 64, align: 64, offset: 1408)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !70, file: !71, line: 307, baseType: !32, size: 64, align: 64, offset: 1472)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !70, file: !71, line: 309, baseType: !67, size: 32, align: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !70, file: !71, line: 311, baseType: !120, size: 160, align: 8, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 160, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !43, file: !37, line: 343, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !37, line: 316, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!35, !35, !75}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !43, file: !37, line: 344, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !37, line: 318, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!67, !35, !75, !35}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !43, file: !37, line: 345, baseType: !113, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !43, file: !37, line: 346, baseType: !135, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !37, line: 320, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!35, !35}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !43, file: !37, line: 350, baseType: !140, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !37, line: 278, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 236, size: 2176, align: 64, elements: !143)
!143 = !{!144, !149, !150, !151, !152, !153, !158, !160, !161, !162, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !142, file: !37, line: 241, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !37, line: 166, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!35, !35, !35}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !142, file: !37, line: 242, baseType: !145, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !142, file: !37, line: 243, baseType: !145, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !142, file: !37, line: 244, baseType: !145, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !142, file: !37, line: 245, baseType: !145, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !142, file: !37, line: 246, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !37, line: 167, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!35, !35, !35, !35}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !142, file: !37, line: 247, baseType: !159, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !37, line: 165, baseType: !136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !142, file: !37, line: 248, baseType: !159, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !142, file: !37, line: 249, baseType: !159, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !142, file: !37, line: 250, baseType: !163, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !37, line: 168, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!67, !35}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !142, file: !37, line: 251, baseType: !159, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !142, file: !37, line: 252, baseType: !145, size: 64, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !142, file: !37, line: 253, baseType: !145, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !142, file: !37, line: 254, baseType: !145, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !142, file: !37, line: 255, baseType: !145, size: 64, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !142, file: !37, line: 256, baseType: !145, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !142, file: !37, line: 257, baseType: !159, size: 64, align: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !142, file: !37, line: 258, baseType: !113, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !142, file: !37, line: 259, baseType: !159, size: 64, align: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !142, file: !37, line: 261, baseType: !145, size: 64, align: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !142, file: !37, line: 262, baseType: !145, size: 64, align: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !142, file: !37, line: 263, baseType: !145, size: 64, align: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !142, file: !37, line: 264, baseType: !145, size: 64, align: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !142, file: !37, line: 265, baseType: !154, size: 64, align: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !142, file: !37, line: 266, baseType: !145, size: 64, align: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !142, file: !37, line: 267, baseType: !145, size: 64, align: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !142, file: !37, line: 268, baseType: !145, size: 64, align: 64, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !142, file: !37, line: 269, baseType: !145, size: 64, align: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !142, file: !37, line: 270, baseType: !145, size: 64, align: 64, offset: 1792)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !142, file: !37, line: 272, baseType: !145, size: 64, align: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !142, file: !37, line: 273, baseType: !145, size: 64, align: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !142, file: !37, line: 274, baseType: !145, size: 64, align: 64, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !142, file: !37, line: 275, baseType: !145, size: 64, align: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !142, file: !37, line: 277, baseType: !159, size: 64, align: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !43, file: !37, line: 351, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !37, line: 292, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 280, size: 640, align: 64, elements: !195)
!195 = !{!196, !201, !202, !207, !208, !209, !214, !215, !220, !221}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !194, file: !37, line: 281, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !37, line: 169, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!23, !35}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !194, file: !37, line: 282, baseType: !145, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !194, file: !37, line: 283, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !37, line: 170, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!35, !35, !23}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !194, file: !37, line: 284, baseType: !203, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !194, file: !37, line: 285, baseType: !113, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !194, file: !37, line: 286, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !37, line: 172, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!67, !35, !23, !35}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !194, file: !37, line: 287, baseType: !113, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !194, file: !37, line: 288, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !37, line: 231, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!67, !35, !35}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !194, file: !37, line: 290, baseType: !145, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !194, file: !37, line: 291, baseType: !203, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !43, file: !37, line: 352, baseType: !223, size: 64, align: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !37, line: 298, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 294, size: 192, align: 64, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !225, file: !37, line: 295, baseType: !197, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !225, file: !37, line: 296, baseType: !145, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !225, file: !37, line: 297, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !37, line: 174, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!67, !35, !35, !35}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !43, file: !37, line: 356, baseType: !235, size: 64, align: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !37, line: 321, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !35}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !24, line: 186, baseType: !23)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !43, file: !37, line: 357, baseType: !154, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !43, file: !37, line: 358, baseType: !135, size: 64, align: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !43, file: !37, line: 359, baseType: !243, size: 64, align: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !37, line: 317, baseType: !146)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !43, file: !37, line: 360, baseType: !245, size: 64, align: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !37, line: 319, baseType: !231)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !43, file: !37, line: 363, baseType: !247, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !37, line: 304, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 301, size: 128, align: 64, elements: !250)
!250 = !{!251, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !249, file: !37, line: 302, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !37, line: 193, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!67, !35, !256, !67}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !37, line: 191, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !37, line: 178, size: 640, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !37, line: 179, baseType: !113, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !258, file: !37, line: 180, baseType: !35, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !37, line: 181, baseType: !23, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !258, file: !37, line: 182, baseType: !23, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !258, file: !37, line: 184, baseType: !67, size: 32, align: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !258, file: !37, line: 185, baseType: !67, size: 32, align: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !258, file: !37, line: 186, baseType: !75, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !258, file: !37, line: 187, baseType: !268, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !258, file: !37, line: 188, baseType: !268, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !258, file: !37, line: 189, baseType: !268, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !258, file: !37, line: 190, baseType: !113, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !249, file: !37, line: 303, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !37, line: 194, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !35, !256}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !43, file: !37, line: 366, baseType: !34, size: 64, align: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !43, file: !37, line: 368, baseType: !52, size: 64, align: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !43, file: !37, line: 372, baseType: !280, size: 64, align: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !37, line: 233, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!67, !35, !284, !113}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !37, line: 232, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!67, !35, !113}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !43, file: !37, line: 375, baseType: !163, size: 64, align: 64, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !43, file: !37, line: 379, baseType: !290, size: 64, align: 64, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !37, line: 322, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!35, !35, !35, !67}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !43, file: !37, line: 382, baseType: !23, size: 64, align: 64, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !43, file: !37, line: 385, baseType: !296, size: 64, align: 64, offset: 1728)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !37, line: 323, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !43, file: !37, line: 386, baseType: !298, size: 64, align: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !37, line: 324, baseType: !136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !43, file: !37, line: 389, baseType: !300, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !302, line: 40, size: 256, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!303 = !{!304, !305, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !301, file: !302, line: 41, baseType: !52, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !301, file: !302, line: 42, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !302, line: 18, baseType: !146)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !301, file: !302, line: 43, baseType: !67, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !301, file: !302, line: 45, baseType: !52, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !43, file: !37, line: 390, baseType: !310, size: 64, align: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !312, line: 18, size: 320, align: 64, elements: !313)
!312 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!313 = !{!314, !315, !316, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !312, line: 19, baseType: !75, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !312, line: 20, baseType: !67, size: 32, align: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !311, file: !312, line: 21, baseType: !23, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !312, line: 22, baseType: !67, size: 32, align: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !311, file: !312, line: 23, baseType: !75, size: 64, align: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !43, file: !37, line: 391, baseType: !320, size: 64, align: 64, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !322, line: 11, size: 320, align: 64, elements: !323)
!322 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!323 = !{!324, !325, !330, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !322, line: 12, baseType: !75, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !321, file: !322, line: 13, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !322, line: 8, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!35, !35, !113}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !321, file: !322, line: 14, baseType: !331, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !322, line: 9, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!67, !35, !35, !113}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !321, file: !322, line: 15, baseType: !75, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !321, file: !322, line: 16, baseType: !113, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !43, file: !37, line: 392, baseType: !42, size: 64, align: 64, offset: 2048)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !43, file: !37, line: 393, baseType: !35, size: 64, align: 64, offset: 2112)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !43, file: !37, line: 394, baseType: !340, size: 64, align: 64, offset: 2176)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !37, line: 325, baseType: !155)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !43, file: !37, line: 395, baseType: !342, size: 64, align: 64, offset: 2240)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !37, line: 326, baseType: !231)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !43, file: !37, line: 396, baseType: !23, size: 64, align: 64, offset: 2304)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !43, file: !37, line: 397, baseType: !345, size: 64, align: 64, offset: 2368)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !37, line: 327, baseType: !231)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !43, file: !37, line: 398, baseType: !347, size: 64, align: 64, offset: 2432)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !37, line: 329, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!35, !42, !23}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !43, file: !37, line: 399, baseType: !352, size: 64, align: 64, offset: 2496)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !37, line: 328, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!35, !42, !35, !35}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !43, file: !37, line: 400, baseType: !357, size: 64, align: 64, offset: 2560)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !37, line: 307, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !113}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !43, file: !37, line: 401, baseType: !163, size: 64, align: 64, offset: 2624)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !43, file: !37, line: 402, baseType: !35, size: 64, align: 64, offset: 2688)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !43, file: !37, line: 403, baseType: !35, size: 64, align: 64, offset: 2752)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !43, file: !37, line: 404, baseType: !35, size: 64, align: 64, offset: 2816)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !43, file: !37, line: 405, baseType: !35, size: 64, align: 64, offset: 2880)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !43, file: !37, line: 406, baseType: !35, size: 64, align: 64, offset: 2944)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !43, file: !37, line: 407, baseType: !58, size: 64, align: 64, offset: 3008)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !43, file: !37, line: 410, baseType: !369, size: 32, align: 32, offset: 3072)
!369 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !43, file: !37, line: 412, baseType: !58, size: 64, align: 64, offset: 3136)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !374)
!374 = !{!375, !376, !377, !378, !386}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !373, file: !4, line: 291, baseType: !36, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !373, file: !4, line: 292, baseType: !23, size: 64, align: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !373, file: !4, line: 293, baseType: !239, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !373, file: !4, line: 349, baseType: !379, size: 32, align: 32, offset: 256)
!379 = !DICompositeType(tag: DW_TAG_structure_type, scope: !373, file: !4, line: 294, size: 32, align: 32, elements: !380)
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !379, file: !4, line: 303, baseType: !369, size: 2, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !379, file: !4, line: 331, baseType: !369, size: 3, align: 32, offset: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !379, file: !4, line: 336, baseType: !369, size: 1, align: 32, offset: 5)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !379, file: !4, line: 340, baseType: !369, size: 1, align: 32, offset: 6)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !379, file: !4, line: 345, baseType: !369, size: 1, align: 32, offset: 7)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !373, file: !4, line: 350, baseType: !387, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !33, line: 90, baseType: !67)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !369)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !394, line: 33, baseType: !395)
!394 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!395 = !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 25, size: 256, align: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !395, file: !394, line: 26, baseType: !46, size: 192, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !395, file: !394, line: 27, baseType: !399, size: 64, align: 64, offset: 192)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, align: 64, elements: !105)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "stringio", file: !402, line: 40, baseType: !403)
!402 = !DIFile(filename: "./Modules/_io/stringio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!403 = !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 14, size: 960, align: 64, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !403, file: !402, line: 15, baseType: !36, size: 128, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !403, file: !402, line: 16, baseType: !389, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !403, file: !402, line: 17, baseType: !23, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "string_size", scope: !403, file: !402, line: 18, baseType: !23, size: 64, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !403, file: !402, line: 19, baseType: !32, size: 64, align: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !403, file: !402, line: 27, baseType: !67, size: 32, align: 32, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "accu", scope: !403, file: !402, line: 28, baseType: !412, size: 128, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyAccu", file: !413, line: 24, baseType: !414)
!413 = !DIFile(filename: "Include/accu.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 21, size: 128, align: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "large", scope: !414, file: !413, line: 22, baseType: !35, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "small", scope: !414, file: !413, line: 23, baseType: !35, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !403, file: !402, line: 30, baseType: !54, size: 8, align: 8, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !403, file: !402, line: 31, baseType: !54, size: 8, align: 8, offset: 584)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "readuniversal", scope: !403, file: !402, line: 32, baseType: !54, size: 8, align: 8, offset: 592)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "readtranslate", scope: !403, file: !402, line: 33, baseType: !54, size: 8, align: 8, offset: 600)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !403, file: !402, line: 34, baseType: !35, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "readnl", scope: !403, file: !402, line: 35, baseType: !35, size: 64, align: 64, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "writenl", scope: !403, file: !402, line: 36, baseType: !35, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !403, file: !402, line: 38, baseType: !35, size: 64, align: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !403, file: !402, line: 39, baseType: !35, size: 64, align: 64, offset: 896)
!427 = !{!428, !459, !470, !481, !497, !512, !520, !531, !552, !555, !563, !576, !582, !585, !591, !597, !602, !626, !630, !634, !638, !646, !664, !670, !674, !678, !711}
!428 = !DISubprogram(name: "stringio_dealloc", scope: !402, file: !402, line: 607, type: !429, isLocal: true, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.stringio*)* @stringio_dealloc, variables: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !400}
!431 = !{!432, !433, !435, !437, !441, !443, !447, !449, !453, !455}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !428, file: !402, line: 607, type: !400)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !434, file: !402, line: 609, type: !11)
!434 = distinct !DILexicalBlock(scope: !428, file: !402, line: 609, column: 8)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !436, file: !402, line: 616, type: !35)
!436 = distinct !DILexicalBlock(scope: !428, file: !402, line: 616, column: 8)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !438, file: !402, line: 616, type: !35)
!438 = distinct !DILexicalBlock(scope: !439, file: !402, line: 616, column: 119)
!439 = distinct !DILexicalBlock(scope: !440, file: !402, line: 616, column: 85)
!440 = distinct !DILexicalBlock(scope: !436, file: !402, line: 616, column: 62)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !442, file: !402, line: 617, type: !35)
!442 = distinct !DILexicalBlock(scope: !428, file: !402, line: 617, column: 8)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !402, line: 617, type: !35)
!444 = distinct !DILexicalBlock(scope: !445, file: !402, line: 617, column: 121)
!445 = distinct !DILexicalBlock(scope: !446, file: !402, line: 617, column: 86)
!446 = distinct !DILexicalBlock(scope: !442, file: !402, line: 617, column: 63)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !448, file: !402, line: 618, type: !35)
!448 = distinct !DILexicalBlock(scope: !428, file: !402, line: 618, column: 8)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !450, file: !402, line: 618, type: !35)
!450 = distinct !DILexicalBlock(scope: !451, file: !402, line: 618, column: 121)
!451 = distinct !DILexicalBlock(scope: !452, file: !402, line: 618, column: 86)
!452 = distinct !DILexicalBlock(scope: !448, file: !402, line: 618, column: 63)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !454, file: !402, line: 619, type: !35)
!454 = distinct !DILexicalBlock(scope: !428, file: !402, line: 619, column: 8)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !456, file: !402, line: 619, type: !35)
!456 = distinct !DILexicalBlock(scope: !457, file: !402, line: 619, column: 115)
!457 = distinct !DILexicalBlock(scope: !458, file: !402, line: 619, column: 83)
!458 = distinct !DILexicalBlock(scope: !454, file: !402, line: 619, column: 60)
!459 = !DISubprogram(name: "stringio_traverse", scope: !402, file: !402, line: 593, type: !460, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.stringio*, i32 (%struct._object*, i8*)*, i8*)* @stringio_traverse, variables: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!67, !400, !284, !113}
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !459, file: !402, line: 593, type: !400)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !459, file: !402, line: 593, type: !284)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !459, file: !402, line: 593, type: !113)
