; ModuleID = 'programs_new/Python-new/symtable.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!39 = !DIEnumerator(name: "Subscript_kind", value: 22)
!40 = !DIEnumerator(name: "Starred_kind", value: 23)
!41 = !DIEnumerator(name: "Name_kind", value: 24)
!42 = !DIEnumerator(name: "List_kind", value: 25)
!43 = !DIEnumerator(name: "Tuple_kind", value: 26)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_boolop", file: !10, line: 16, size: 32, align: 32, elements: !45)
!45 = !{!46, !47}
!46 = !DIEnumerator(name: "And", value: 1)
!47 = !DIEnumerator(name: "Or", value: 2)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_operator", file: !10, line: 18, size: 32, align: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!50 = !DIEnumerator(name: "Add", value: 1)
!51 = !DIEnumerator(name: "Sub", value: 2)
!52 = !DIEnumerator(name: "Mult", value: 3)
!53 = !DIEnumerator(name: "Div", value: 4)
!54 = !DIEnumerator(name: "Mod", value: 5)
!55 = !DIEnumerator(name: "Pow", value: 6)
!56 = !DIEnumerator(name: "LShift", value: 7)
!57 = !DIEnumerator(name: "RShift", value: 8)
!58 = !DIEnumerator(name: "BitOr", value: 9)
!59 = !DIEnumerator(name: "BitXor", value: 10)
!60 = !DIEnumerator(name: "BitAnd", value: 11)
!61 = !DIEnumerator(name: "FloorDiv", value: 12)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_unaryop", file: !10, line: 22, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "Invert", value: 1)
!65 = !DIEnumerator(name: "Not", value: 2)
!66 = !DIEnumerator(name: "UAdd", value: 3)
!67 = !DIEnumerator(name: "USub", value: 4)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_context", file: !10, line: 11, size: 32, align: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIEnumerator(name: "Load", value: 1)
!71 = !DIEnumerator(name: "Store", value: 2)
!72 = !DIEnumerator(name: "Del", value: 3)
!73 = !DIEnumerator(name: "AugLoad", value: 4)
!74 = !DIEnumerator(name: "AugStore", value: 5)
!75 = !DIEnumerator(name: "Param", value: 6)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_slice_kind", file: !10, line: 323, size: 32, align: 32, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "Slice_kind", value: 1)
!79 = !DIEnumerator(name: "ExtSlice_kind", value: 2)
!80 = !DIEnumerator(name: "Index_kind", value: 3)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !82, line: 23, size: 32, align: 32, elements: !83)
!82 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!83 = !{!84, !85, !86, !87, !88}
!84 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!85 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!86 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!87 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!88 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_stmt_kind", file: !10, line: 66, size: 32, align: 32, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!91 = !DIEnumerator(name: "FunctionDef_kind", value: 1)
!92 = !DIEnumerator(name: "ClassDef_kind", value: 2)
!93 = !DIEnumerator(name: "Return_kind", value: 3)
!94 = !DIEnumerator(name: "Delete_kind", value: 4)
!95 = !DIEnumerator(name: "Assign_kind", value: 5)
!96 = !DIEnumerator(name: "AugAssign_kind", value: 6)
!97 = !DIEnumerator(name: "For_kind", value: 7)
!98 = !DIEnumerator(name: "While_kind", value: 8)
!99 = !DIEnumerator(name: "If_kind", value: 9)
!100 = !DIEnumerator(name: "With_kind", value: 10)
!101 = !DIEnumerator(name: "Raise_kind", value: 11)
!102 = !DIEnumerator(name: "Try_kind", value: 12)
!103 = !DIEnumerator(name: "Assert_kind", value: 13)
!104 = !DIEnumerator(name: "Import_kind", value: 14)
!105 = !DIEnumerator(name: "ImportFrom_kind", value: 15)
!106 = !DIEnumerator(name: "Global_kind", value: 16)
!107 = !DIEnumerator(name: "Nonlocal_kind", value: 17)
!108 = !DIEnumerator(name: "Expr_kind", value: 18)
!109 = !DIEnumerator(name: "Pass_kind", value: 19)
!110 = !DIEnumerator(name: "Break_kind", value: 20)
!111 = !DIEnumerator(name: "Continue_kind", value: 21)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_excepthandler_kind", file: !10, line: 350, size: 32, align: 32, elements: !113)
!113 = !{!114}
!114 = !DIEnumerator(name: "ExceptHandler_kind", value: 1)
!115 = !{!116, !117, !462, !520, !831, !859, !881, !882, !891, !554, !899, !905, !921, !532, !927, !548, !933, !952, !683}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !119, line: 109, baseType: !120)
!119 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !119, line: 105, size: 128, align: 64, elements: !121)
!121 = !{!122, !130}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !120, file: !119, line: 107, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !124, line: 177, baseType: !125)
!124 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !126, line: 102, baseType: !127)
!126 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !128, line: 181, baseType: !129)
!128 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!129 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !120, file: !119, line: 108, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !119, line: 334, size: 3200, align: 64, elements: !133)
!133 = !{!134, !140, !144, !145, !146, !151, !214, !219, !224, !225, !230, !282, !313, !325, !331, !332, !333, !335, !337, !368, !369, !370, !379, !380, !385, !386, !388, !390, !400, !410, !428, !429, !430, !432, !434, !435, !437, !442, !447, !452, !453, !454, !455, !456, !457, !458, !459, !461}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !132, file: !119, line: 335, baseType: !135, size: 192, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !119, line: 114, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 111, size: 192, align: 64, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !136, file: !119, line: 112, baseType: !118, size: 128, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !136, file: !119, line: 113, baseType: !123, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !132, file: !119, line: 336, baseType: !141, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !132, file: !119, line: 337, baseType: !123, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !132, file: !119, line: 337, baseType: !123, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !132, file: !119, line: 341, baseType: !147, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !119, line: 308, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !117}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !132, file: !119, line: 342, baseType: !152, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !119, line: 314, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !117, !157, !156}
!156 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 48, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !160, line: 246, size: 1728, align: 64, elements: !161)
!160 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!161 = !{!162, !163, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !183, !184, !185, !186, !188, !190, !192, !196, !199, !201, !202, !203, !204, !205, !209, !210}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !159, file: !160, line: 247, baseType: !156, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !159, file: !160, line: 252, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !159, file: !160, line: 253, baseType: !164, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !159, file: !160, line: 254, baseType: !164, size: 64, align: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !159, file: !160, line: 255, baseType: !164, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !159, file: !160, line: 256, baseType: !164, size: 64, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !159, file: !160, line: 257, baseType: !164, size: 64, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !159, file: !160, line: 258, baseType: !164, size: 64, align: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !159, file: !160, line: 259, baseType: !164, size: 64, align: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !159, file: !160, line: 261, baseType: !164, size: 64, align: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !159, file: !160, line: 262, baseType: !164, size: 64, align: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !159, file: !160, line: 263, baseType: !164, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !159, file: !160, line: 265, baseType: !176, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !160, line: 161, size: 192, align: 64, elements: !178)
!178 = !{!179, !180, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !177, file: !160, line: 162, baseType: !176, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !177, file: !160, line: 163, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !177, file: !160, line: 167, baseType: !156, size: 32, align: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !159, file: !160, line: 267, baseType: !181, size: 64, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !159, file: !160, line: 269, baseType: !156, size: 32, align: 32, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !159, file: !160, line: 273, baseType: !156, size: 32, align: 32, offset: 928)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !159, file: !160, line: 275, baseType: !187, size: 64, align: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !128, line: 140, baseType: !129)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !159, file: !160, line: 279, baseType: !189, size: 16, align: 16, offset: 1024)
!189 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !159, file: !160, line: 280, baseType: !191, size: 8, align: 8, offset: 1040)
!191 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !159, file: !160, line: 281, baseType: !193, size: 8, align: 8, offset: 1048)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 8, align: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !159, file: !160, line: 285, baseType: !197, size: 64, align: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !160, line: 155, baseType: null)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !159, file: !160, line: 294, baseType: !200, size: 64, align: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !128, line: 141, baseType: !129)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !159, file: !160, line: 303, baseType: !116, size: 64, align: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !159, file: !160, line: 304, baseType: !116, size: 64, align: 64, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !159, file: !160, line: 305, baseType: !116, size: 64, align: 64, offset: 1344)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !159, file: !160, line: 306, baseType: !116, size: 64, align: 64, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !159, file: !160, line: 307, baseType: !206, size: 64, align: 64, offset: 1472)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !207, line: 62, baseType: !208)
!207 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!208 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !159, file: !160, line: 309, baseType: !156, size: 32, align: 32, offset: 1536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !159, file: !160, line: 311, baseType: !211, size: 160, align: 8, offset: 1568)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 160, align: 8, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 20)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !132, file: !119, line: 343, baseType: !215, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !119, line: 316, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!117, !117, !164}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !132, file: !119, line: 344, baseType: !220, size: 64, align: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !119, line: 318, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!156, !117, !164, !117}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !132, file: !119, line: 345, baseType: !116, size: 64, align: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !132, file: !119, line: 346, baseType: !226, size: 64, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !119, line: 320, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!117, !117}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !132, file: !119, line: 350, baseType: !231, size: 64, align: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !119, line: 278, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 236, size: 2176, align: 64, elements: !234)
!234 = !{!235, !240, !241, !242, !243, !244, !249, !251, !252, !253, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !233, file: !119, line: 241, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !119, line: 166, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!117, !117, !117}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !233, file: !119, line: 242, baseType: !236, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !233, file: !119, line: 243, baseType: !236, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !233, file: !119, line: 244, baseType: !236, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !233, file: !119, line: 245, baseType: !236, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !233, file: !119, line: 246, baseType: !245, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !119, line: 167, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!117, !117, !117, !117}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !233, file: !119, line: 247, baseType: !250, size: 64, align: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !119, line: 165, baseType: !227)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !233, file: !119, line: 248, baseType: !250, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !233, file: !119, line: 249, baseType: !250, size: 64, align: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !233, file: !119, line: 250, baseType: !254, size: 64, align: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !119, line: 168, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!156, !117}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !233, file: !119, line: 251, baseType: !250, size: 64, align: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !233, file: !119, line: 252, baseType: !236, size: 64, align: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !233, file: !119, line: 253, baseType: !236, size: 64, align: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !233, file: !119, line: 254, baseType: !236, size: 64, align: 64, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !233, file: !119, line: 255, baseType: !236, size: 64, align: 64, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !233, file: !119, line: 256, baseType: !236, size: 64, align: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !233, file: !119, line: 257, baseType: !250, size: 64, align: 64, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !233, file: !119, line: 258, baseType: !116, size: 64, align: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !233, file: !119, line: 259, baseType: !250, size: 64, align: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !233, file: !119, line: 261, baseType: !236, size: 64, align: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !233, file: !119, line: 262, baseType: !236, size: 64, align: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !233, file: !119, line: 263, baseType: !236, size: 64, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !233, file: !119, line: 264, baseType: !236, size: 64, align: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !233, file: !119, line: 265, baseType: !245, size: 64, align: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !233, file: !119, line: 266, baseType: !236, size: 64, align: 64, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !233, file: !119, line: 267, baseType: !236, size: 64, align: 64, offset: 1600)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !233, file: !119, line: 268, baseType: !236, size: 64, align: 64, offset: 1664)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !233, file: !119, line: 269, baseType: !236, size: 64, align: 64, offset: 1728)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !233, file: !119, line: 270, baseType: !236, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !233, file: !119, line: 272, baseType: !236, size: 64, align: 64, offset: 1856)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !233, file: !119, line: 273, baseType: !236, size: 64, align: 64, offset: 1920)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !233, file: !119, line: 274, baseType: !236, size: 64, align: 64, offset: 1984)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !233, file: !119, line: 275, baseType: !236, size: 64, align: 64, offset: 2048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !233, file: !119, line: 277, baseType: !250, size: 64, align: 64, offset: 2112)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !132, file: !119, line: 351, baseType: !283, size: 64, align: 64, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !119, line: 292, baseType: !285)
!285 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 280, size: 640, align: 64, elements: !286)
!286 = !{!287, !292, !293, !298, !299, !300, !305, !306, !311, !312}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !285, file: !119, line: 281, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !119, line: 169, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!123, !117}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !285, file: !119, line: 282, baseType: !236, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !285, file: !119, line: 283, baseType: !294, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !119, line: 170, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!117, !117, !123}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !285, file: !119, line: 284, baseType: !294, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !285, file: !119, line: 285, baseType: !116, size: 64, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !285, file: !119, line: 286, baseType: !301, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !119, line: 172, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!156, !117, !123, !117}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !285, file: !119, line: 287, baseType: !116, size: 64, align: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !285, file: !119, line: 288, baseType: !307, size: 64, align: 64, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !119, line: 231, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!156, !117, !117}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !285, file: !119, line: 290, baseType: !236, size: 64, align: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !285, file: !119, line: 291, baseType: !294, size: 64, align: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !132, file: !119, line: 352, baseType: !314, size: 64, align: 64, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !119, line: 298, baseType: !316)
!316 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 294, size: 192, align: 64, elements: !317)
!317 = !{!318, !319, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !316, file: !119, line: 295, baseType: !288, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !316, file: !119, line: 296, baseType: !236, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !316, file: !119, line: 297, baseType: !321, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !119, line: 174, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!156, !117, !117, !117}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !132, file: !119, line: 356, baseType: !326, size: 64, align: 64, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !119, line: 321, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !117}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !124, line: 186, baseType: !123)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !132, file: !119, line: 357, baseType: !245, size: 64, align: 64, offset: 1024)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !132, file: !119, line: 358, baseType: !226, size: 64, align: 64, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !132, file: !119, line: 359, baseType: !334, size: 64, align: 64, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !119, line: 317, baseType: !237)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !132, file: !119, line: 360, baseType: !336, size: 64, align: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !119, line: 319, baseType: !322)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !132, file: !119, line: 363, baseType: !338, size: 64, align: 64, offset: 1280)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !119, line: 304, baseType: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 301, size: 128, align: 64, elements: !341)
!341 = !{!342, !363}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !340, file: !119, line: 302, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !119, line: 193, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!156, !117, !347, !156}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !119, line: 191, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !119, line: 178, size: 640, align: 64, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !360, !361, !362}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !349, file: !119, line: 179, baseType: !116, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !349, file: !119, line: 180, baseType: !117, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !349, file: !119, line: 181, baseType: !123, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !349, file: !119, line: 182, baseType: !123, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !349, file: !119, line: 184, baseType: !156, size: 32, align: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !349, file: !119, line: 185, baseType: !156, size: 32, align: 32, offset: 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !349, file: !119, line: 186, baseType: !164, size: 64, align: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !349, file: !119, line: 187, baseType: !359, size: 64, align: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !349, file: !119, line: 188, baseType: !359, size: 64, align: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !349, file: !119, line: 189, baseType: !359, size: 64, align: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !349, file: !119, line: 190, baseType: !116, size: 64, align: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !340, file: !119, line: 303, baseType: !364, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !119, line: 194, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !117, !347}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !132, file: !119, line: 366, baseType: !208, size: 64, align: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !132, file: !119, line: 368, baseType: !141, size: 64, align: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !132, file: !119, line: 372, baseType: !371, size: 64, align: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !119, line: 233, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!156, !117, !375, !116}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !119, line: 232, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!156, !117, !116}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !132, file: !119, line: 375, baseType: !254, size: 64, align: 64, offset: 1536)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !132, file: !119, line: 379, baseType: !381, size: 64, align: 64, offset: 1600)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !119, line: 322, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!117, !117, !117, !156}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !132, file: !119, line: 382, baseType: !123, size: 64, align: 64, offset: 1664)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !132, file: !119, line: 385, baseType: !387, size: 64, align: 64, offset: 1728)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !119, line: 323, baseType: !227)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !132, file: !119, line: 386, baseType: !389, size: 64, align: 64, offset: 1792)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !119, line: 324, baseType: !227)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !132, file: !119, line: 389, baseType: !391, size: 64, align: 64, offset: 1856)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !393, line: 40, size: 256, align: 64, elements: !394)
!393 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!394 = !{!395, !396, !398, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !392, file: !393, line: 41, baseType: !141, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !392, file: !393, line: 42, baseType: !397, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !393, line: 18, baseType: !237)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !392, file: !393, line: 43, baseType: !156, size: 32, align: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !392, file: !393, line: 45, baseType: !141, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !132, file: !119, line: 390, baseType: !401, size: 64, align: 64, offset: 1920)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !403, line: 18, size: 320, align: 64, elements: !404)
!403 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !{!405, !406, !407, !408, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !402, file: !403, line: 19, baseType: !164, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !403, line: 20, baseType: !156, size: 32, align: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !402, file: !403, line: 21, baseType: !123, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !402, file: !403, line: 22, baseType: !156, size: 32, align: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !402, file: !403, line: 23, baseType: !164, size: 64, align: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !132, file: !119, line: 391, baseType: !411, size: 64, align: 64, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !413, line: 11, size: 320, align: 64, elements: !414)
!413 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!414 = !{!415, !416, !421, !426, !427}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !413, line: 12, baseType: !164, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !412, file: !413, line: 13, baseType: !417, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !413, line: 8, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!117, !117, !116}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !412, file: !413, line: 14, baseType: !422, size: 64, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !413, line: 9, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!156, !117, !117, !116}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !412, file: !413, line: 15, baseType: !164, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !412, file: !413, line: 16, baseType: !116, size: 64, align: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !132, file: !119, line: 392, baseType: !131, size: 64, align: 64, offset: 2048)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !132, file: !119, line: 393, baseType: !117, size: 64, align: 64, offset: 2112)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !132, file: !119, line: 394, baseType: !431, size: 64, align: 64, offset: 2176)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !119, line: 325, baseType: !246)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !132, file: !119, line: 395, baseType: !433, size: 64, align: 64, offset: 2240)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !119, line: 326, baseType: !322)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !132, file: !119, line: 396, baseType: !123, size: 64, align: 64, offset: 2304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !132, file: !119, line: 397, baseType: !436, size: 64, align: 64, offset: 2368)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !119, line: 327, baseType: !322)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !132, file: !119, line: 398, baseType: !438, size: 64, align: 64, offset: 2432)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !119, line: 329, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!117, !131, !123}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !132, file: !119, line: 399, baseType: !443, size: 64, align: 64, offset: 2496)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !119, line: 328, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!117, !131, !117, !117}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !132, file: !119, line: 400, baseType: !448, size: 64, align: 64, offset: 2560)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !119, line: 307, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !116}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !132, file: !119, line: 401, baseType: !254, size: 64, align: 64, offset: 2624)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !132, file: !119, line: 402, baseType: !117, size: 64, align: 64, offset: 2688)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !132, file: !119, line: 403, baseType: !117, size: 64, align: 64, offset: 2752)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !132, file: !119, line: 404, baseType: !117, size: 64, align: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !132, file: !119, line: 405, baseType: !117, size: 64, align: 64, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !132, file: !119, line: 406, baseType: !117, size: 64, align: 64, offset: 2944)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !132, file: !119, line: 407, baseType: !147, size: 64, align: 64, offset: 3008)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !132, file: !119, line: 410, baseType: !460, size: 32, align: 32, offset: 3072)
!460 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !132, file: !119, line: 412, baseType: !147, size: 64, align: 64, offset: 3136)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !464, line: 139, baseType: !465)
!464 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !464, line: 69, size: 1536, align: 64, elements: !466)
!466 = !{!467, !469, !470, !490, !493, !494, !495, !496, !497, !498, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !465, file: !464, line: 72, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !465, file: !464, line: 73, baseType: !468, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !465, file: !464, line: 74, baseType: !471, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !464, line: 44, baseType: !473)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !464, line: 19, size: 832, align: 64, elements: !474)
!474 = !{!475, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !464, line: 21, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !473, file: !464, line: 22, baseType: !468, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !473, file: !464, line: 24, baseType: !117, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !473, file: !464, line: 25, baseType: !117, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !473, file: !464, line: 26, baseType: !117, size: 64, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !473, file: !464, line: 27, baseType: !117, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !473, file: !464, line: 28, baseType: !117, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !473, file: !464, line: 30, baseType: !117, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !473, file: !464, line: 31, baseType: !117, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !473, file: !464, line: 32, baseType: !117, size: 64, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !473, file: !464, line: 33, baseType: !156, size: 32, align: 32, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !473, file: !464, line: 34, baseType: !156, size: 32, align: 32, offset: 672)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !473, file: !464, line: 37, baseType: !156, size: 32, align: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !473, file: !464, line: 43, baseType: !117, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !465, file: !464, line: 76, baseType: !491, size: 64, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !464, line: 50, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !465, file: !464, line: 77, baseType: !156, size: 32, align: 32, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !465, file: !464, line: 78, baseType: !143, size: 8, align: 8, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !465, file: !464, line: 80, baseType: !143, size: 8, align: 8, offset: 296)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !465, file: !464, line: 85, baseType: !156, size: 32, align: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !465, file: !464, line: 86, baseType: !156, size: 32, align: 32, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !465, file: !464, line: 88, baseType: !499, size: 64, align: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !464, line: 54, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!156, !117, !491, !156, !117}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !465, file: !464, line: 89, baseType: !499, size: 64, align: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !465, file: !464, line: 90, baseType: !117, size: 64, align: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !465, file: !464, line: 91, baseType: !117, size: 64, align: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !465, file: !464, line: 93, baseType: !117, size: 64, align: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !465, file: !464, line: 94, baseType: !117, size: 64, align: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !465, file: !464, line: 95, baseType: !117, size: 64, align: 64, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !465, file: !464, line: 97, baseType: !117, size: 64, align: 64, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !465, file: !464, line: 98, baseType: !117, size: 64, align: 64, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !465, file: !464, line: 99, baseType: !117, size: 64, align: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !465, file: !464, line: 101, baseType: !117, size: 64, align: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !465, file: !464, line: 103, baseType: !156, size: 32, align: 32, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !465, file: !464, line: 105, baseType: !117, size: 64, align: 64, offset: 1152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !465, file: !464, line: 106, baseType: !129, size: 64, align: 64, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !465, file: !464, line: 108, baseType: !156, size: 32, align: 32, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !465, file: !464, line: 109, baseType: !117, size: 64, align: 64, offset: 1344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !465, file: !464, line: 134, baseType: !449, size: 64, align: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !465, file: !464, line: 135, baseType: !116, size: 64, align: 64, offset: 1472)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "stmt_ty", file: !10, line: 7, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_stmt", file: !10, line: 72, size: 576, align: 64, elements: !523)
!523 = !{!524, !525, !829, !830}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !522, file: !10, line: 73, baseType: !89, size: 32, align: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !522, file: !10, line: 175, baseType: !526, size: 448, align: 64, offset: 64)
!526 = !DICompositeType(tag: DW_TAG_union_type, scope: !522, file: !10, line: 74, size: 448, align: 64, elements: !527)
!527 = !{!528, !737, !747, !751, !755, !760, !766, !773, !779, !785, !790, !795, !802, !807, !811, !817, !821, !825}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "FunctionDef", scope: !526, file: !10, line: 81, baseType: !529, size: 320, align: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 75, size: 320, align: 64, elements: !530)
!530 = !{!531, !534, !734, !735, !736}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !529, file: !10, line: 76, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "identifier", file: !533, line: 4, baseType: !117)
!533 = !DIFile(filename: "Include/asdl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!534 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !529, file: !10, line: 77, baseType: !535, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments_ty", file: !10, line: 31, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arguments", file: !10, line: 365, size: 384, align: 64, elements: !538)
!538 = !{!539, !547, !730, !731, !732, !733}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !537, file: !10, line: 366, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_seq", file: !533, line: 21, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 18, size: 128, align: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !542, file: !533, line: 19, baseType: !123, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !542, file: !533, line: 20, baseType: !546, size: 64, align: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, align: 64, elements: !194)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vararg", scope: !537, file: !10, line: 367, baseType: !548, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_ty", file: !10, line: 33, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arg", file: !10, line: 374, size: 192, align: 64, elements: !551)
!551 = !{!552, !553, !728, !729}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !550, file: !10, line: 375, baseType: !532, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "annotation", scope: !550, file: !10, line: 376, baseType: !554, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_ty", file: !10, line: 9, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_expr", file: !10, line: 188, size: 448, align: 64, elements: !557)
!557 = !{!558, !559, !726, !727}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !556, file: !10, line: 189, baseType: !16, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !556, file: !10, line: 318, baseType: !560, size: 320, align: 64, offset: 64)
!560 = !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !10, line: 190, size: 320, align: 64, elements: !561)
!561 = !{!562, !568, !575, !581, !586, !592, !597, !601, !606, !611, !617, !622, !626, !630, !643, !651, !656, !661, !666, !671, !678, !706, !711, !716, !721}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "BoolOp", scope: !560, file: !10, line: 194, baseType: !563, size: 128, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 191, size: 128, align: 64, elements: !564)
!564 = !{!565, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !563, file: !10, line: 192, baseType: !566, size: 32, align: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolop_ty", file: !10, line: 16, baseType: !44)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !563, file: !10, line: 193, baseType: !540, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "BinOp", scope: !560, file: !10, line: 200, baseType: !569, size: 192, align: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 196, size: 192, align: 64, elements: !570)
!570 = !{!571, !572, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !569, file: !10, line: 197, baseType: !554, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !569, file: !10, line: 198, baseType: !573, size: 32, align: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "operator_ty", file: !10, line: 20, baseType: !48)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !569, file: !10, line: 199, baseType: !554, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "UnaryOp", scope: !560, file: !10, line: 205, baseType: !576, size: 128, align: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 202, size: 128, align: 64, elements: !577)
!577 = !{!578, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !576, file: !10, line: 203, baseType: !579, size: 32, align: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryop_ty", file: !10, line: 22, baseType: !62)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "operand", scope: !576, file: !10, line: 204, baseType: !554, size: 64, align: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Lambda", scope: !560, file: !10, line: 210, baseType: !582, size: 128, align: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 207, size: 128, align: 64, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !582, file: !10, line: 208, baseType: !535, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !582, file: !10, line: 209, baseType: !554, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "IfExp", scope: !560, file: !10, line: 216, baseType: !587, size: 192, align: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 212, size: 192, align: 64, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !587, file: !10, line: 213, baseType: !554, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !587, file: !10, line: 214, baseType: !554, size: 64, align: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !587, file: !10, line: 215, baseType: !554, size: 64, align: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Dict", scope: !560, file: !10, line: 221, baseType: !593, size: 128, align: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 218, size: 128, align: 64, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !593, file: !10, line: 219, baseType: !540, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !593, file: !10, line: 220, baseType: !540, size: 64, align: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Set", scope: !560, file: !10, line: 225, baseType: !598, size: 64, align: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 223, size: 64, align: 64, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !598, file: !10, line: 224, baseType: !540, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ListComp", scope: !560, file: !10, line: 230, baseType: !602, size: 128, align: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 227, size: 128, align: 64, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !602, file: !10, line: 228, baseType: !554, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !602, file: !10, line: 229, baseType: !540, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "SetComp", scope: !560, file: !10, line: 235, baseType: !607, size: 128, align: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 232, size: 128, align: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !607, file: !10, line: 233, baseType: !554, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !607, file: !10, line: 234, baseType: !540, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "DictComp", scope: !560, file: !10, line: 241, baseType: !612, size: 192, align: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 237, size: 192, align: 64, elements: !613)
!613 = !{!614, !615, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !612, file: !10, line: 238, baseType: !554, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !612, file: !10, line: 239, baseType: !554, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !612, file: !10, line: 240, baseType: !540, size: 64, align: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "GeneratorExp", scope: !560, file: !10, line: 246, baseType: !618, size: 128, align: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 243, size: 128, align: 64, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !618, file: !10, line: 244, baseType: !554, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !618, file: !10, line: 245, baseType: !540, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Yield", scope: !560, file: !10, line: 250, baseType: !623, size: 64, align: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 248, size: 64, align: 64, elements: !624)
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !623, file: !10, line: 249, baseType: !554, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "YieldFrom", scope: !560, file: !10, line: 254, baseType: !627, size: 64, align: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 252, size: 64, align: 64, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !627, file: !10, line: 253, baseType: !554, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "Compare", scope: !560, file: !10, line: 260, baseType: !631, size: 192, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 256, size: 192, align: 64, elements: !632)
!632 = !{!633, !634, !642}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !631, file: !10, line: 257, baseType: !554, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !631, file: !10, line: 258, baseType: !635, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_int_seq", file: !533, line: 26, baseType: !637)
!637 = !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 23, size: 128, align: 64, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !533, line: 24, baseType: !123, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !637, file: !533, line: 25, baseType: !641, size: 32, align: 32, offset: 64)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 32, align: 32, elements: !194)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "comparators", scope: !631, file: !10, line: 259, baseType: !540, size: 64, align: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Call", scope: !560, file: !10, line: 268, baseType: !644, size: 320, align: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 262, size: 320, align: 64, elements: !645)
!645 = !{!646, !647, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !644, file: !10, line: 263, baseType: !554, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !644, file: !10, line: 264, baseType: !540, size: 64, align: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !644, file: !10, line: 265, baseType: !540, size: 64, align: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !644, file: !10, line: 266, baseType: !554, size: 64, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !644, file: !10, line: 267, baseType: !554, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Num", scope: !560, file: !10, line: 272, baseType: !652, size: 64, align: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 270, size: 64, align: 64, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !652, file: !10, line: 271, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !533, line: 7, baseType: !117)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !560, file: !10, line: 276, baseType: !657, size: 64, align: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 274, size: 64, align: 64, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !657, file: !10, line: 275, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !533, line: 5, baseType: !117)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", scope: !560, file: !10, line: 280, baseType: !662, size: 64, align: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 278, size: 64, align: 64, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !662, file: !10, line: 279, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytes", file: !533, line: 6, baseType: !117)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "NameConstant", scope: !560, file: !10, line: 284, baseType: !667, size: 64, align: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 282, size: 64, align: 64, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !667, file: !10, line: 283, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "singleton", file: !533, line: 8, baseType: !117)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !560, file: !10, line: 290, baseType: !672, size: 192, align: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 286, size: 192, align: 64, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !672, file: !10, line: 287, baseType: !554, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !672, file: !10, line: 288, baseType: !532, size: 64, align: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !672, file: !10, line: 289, baseType: !677, size: 32, align: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_context_ty", file: !10, line: 12, baseType: !68)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Subscript", scope: !560, file: !10, line: 296, baseType: !679, size: 192, align: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 292, size: 192, align: 64, elements: !680)
!680 = !{!681, !682, !705}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !679, file: !10, line: 293, baseType: !554, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !679, file: !10, line: 294, baseType: !683, size: 64, align: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "slice_ty", file: !10, line: 14, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "_slice", file: !10, line: 324, size: 256, align: 64, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !685, file: !10, line: 325, baseType: !76, size: 32, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !685, file: !10, line: 341, baseType: !689, size: 192, align: 64, offset: 64)
!689 = !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !10, line: 326, size: 192, align: 64, elements: !690)
!690 = !{!691, !697, !701}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !689, file: !10, line: 331, baseType: !692, size: 192, align: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !10, line: 327, size: 192, align: 64, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !692, file: !10, line: 328, baseType: !554, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !692, file: !10, line: 329, baseType: !554, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !692, file: !10, line: 330, baseType: !554, size: 64, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ExtSlice", scope: !689, file: !10, line: 335, baseType: !698, size: 64, align: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !10, line: 333, size: 64, align: 64, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !698, file: !10, line: 334, baseType: !540, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !689, file: !10, line: 339, baseType: !702, size: 64, align: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !10, line: 337, size: 64, align: 64, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !702, file: !10, line: 338, baseType: !554, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !679, file: !10, line: 295, baseType: !677, size: 32, align: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Starred", scope: !560, file: !10, line: 301, baseType: !707, size: 128, align: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 298, size: 128, align: 64, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !707, file: !10, line: 299, baseType: !554, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !707, file: !10, line: 300, baseType: !677, size: 32, align: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !560, file: !10, line: 306, baseType: !712, size: 128, align: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 303, size: 128, align: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !712, file: !10, line: 304, baseType: !532, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !712, file: !10, line: 305, baseType: !677, size: 32, align: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !560, file: !10, line: 311, baseType: !717, size: 128, align: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 308, size: 128, align: 64, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !717, file: !10, line: 309, baseType: !540, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !717, file: !10, line: 310, baseType: !677, size: 32, align: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Tuple", scope: !560, file: !10, line: 316, baseType: !722, size: 128, align: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !10, line: 313, size: 128, align: 64, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !722, file: !10, line: 314, baseType: !540, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !722, file: !10, line: 315, baseType: !677, size: 32, align: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !556, file: !10, line: 319, baseType: !156, size: 32, align: 32, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !556, file: !10, line: 320, baseType: !156, size: 32, align: 32, offset: 416)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !550, file: !10, line: 377, baseType: !156, size: 32, align: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !550, file: !10, line: 378, baseType: !156, size: 32, align: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "kwonlyargs", scope: !537, file: !10, line: 368, baseType: !540, size: 64, align: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "kw_defaults", scope: !537, file: !10, line: 369, baseType: !540, size: 64, align: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "kwarg", scope: !537, file: !10, line: 370, baseType: !548, size: 64, align: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !537, file: !10, line: 371, baseType: !540, size: 64, align: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !529, file: !10, line: 78, baseType: !540, size: 64, align: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "decorator_list", scope: !529, file: !10, line: 79, baseType: !540, size: 64, align: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "returns", scope: !529, file: !10, line: 80, baseType: !554, size: 64, align: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ClassDef", scope: !526, file: !10, line: 91, baseType: !738, size: 448, align: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 83, size: 448, align: 64, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !738, file: !10, line: 84, baseType: !532, size: 64, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !738, file: !10, line: 85, baseType: !540, size: 64, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !738, file: !10, line: 86, baseType: !540, size: 64, align: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !738, file: !10, line: 87, baseType: !554, size: 64, align: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !738, file: !10, line: 88, baseType: !554, size: 64, align: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !738, file: !10, line: 89, baseType: !540, size: 64, align: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "decorator_list", scope: !738, file: !10, line: 90, baseType: !540, size: 64, align: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Return", scope: !526, file: !10, line: 95, baseType: !748, size: 64, align: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 93, size: 64, align: 64, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !748, file: !10, line: 94, baseType: !554, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !526, file: !10, line: 99, baseType: !752, size: 64, align: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 97, size: 64, align: 64, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !752, file: !10, line: 98, baseType: !540, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Assign", scope: !526, file: !10, line: 104, baseType: !756, size: 128, align: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 101, size: 128, align: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !756, file: !10, line: 102, baseType: !540, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !756, file: !10, line: 103, baseType: !554, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "AugAssign", scope: !526, file: !10, line: 110, baseType: !761, size: 192, align: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 106, size: 192, align: 64, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !761, file: !10, line: 107, baseType: !554, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !761, file: !10, line: 108, baseType: !573, size: 32, align: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !761, file: !10, line: 109, baseType: !554, size: 64, align: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "For", scope: !526, file: !10, line: 117, baseType: !767, size: 256, align: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 112, size: 256, align: 64, elements: !768)
!768 = !{!769, !770, !771, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !767, file: !10, line: 113, baseType: !554, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !767, file: !10, line: 114, baseType: !554, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !767, file: !10, line: 115, baseType: !540, size: 64, align: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !767, file: !10, line: 116, baseType: !540, size: 64, align: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "While", scope: !526, file: !10, line: 123, baseType: !774, size: 192, align: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 119, size: 192, align: 64, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !774, file: !10, line: 120, baseType: !554, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !774, file: !10, line: 121, baseType: !540, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !774, file: !10, line: 122, baseType: !540, size: 64, align: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "If", scope: !526, file: !10, line: 129, baseType: !780, size: 192, align: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 125, size: 192, align: 64, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !780, file: !10, line: 126, baseType: !554, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !780, file: !10, line: 127, baseType: !540, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !780, file: !10, line: 128, baseType: !540, size: 64, align: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "With", scope: !526, file: !10, line: 134, baseType: !786, size: 128, align: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 131, size: 128, align: 64, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !786, file: !10, line: 132, baseType: !540, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !786, file: !10, line: 133, baseType: !540, size: 64, align: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Raise", scope: !526, file: !10, line: 139, baseType: !791, size: 128, align: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 136, size: 128, align: 64, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "exc", scope: !791, file: !10, line: 137, baseType: !554, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !791, file: !10, line: 138, baseType: !554, size: 64, align: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Try", scope: !526, file: !10, line: 146, baseType: !796, size: 256, align: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 141, size: 256, align: 64, elements: !797)
!797 = !{!798, !799, !800, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !796, file: !10, line: 142, baseType: !540, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !796, file: !10, line: 143, baseType: !540, size: 64, align: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !796, file: !10, line: 144, baseType: !540, size: 64, align: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "finalbody", scope: !796, file: !10, line: 145, baseType: !540, size: 64, align: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Assert", scope: !526, file: !10, line: 151, baseType: !803, size: 128, align: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 148, size: 128, align: 64, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !803, file: !10, line: 149, baseType: !554, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !803, file: !10, line: 150, baseType: !554, size: 64, align: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Import", scope: !526, file: !10, line: 155, baseType: !808, size: 64, align: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 153, size: 64, align: 64, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !808, file: !10, line: 154, baseType: !540, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ImportFrom", scope: !526, file: !10, line: 161, baseType: !812, size: 192, align: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 157, size: 192, align: 64, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !812, file: !10, line: 158, baseType: !532, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !812, file: !10, line: 159, baseType: !540, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !812, file: !10, line: 160, baseType: !156, size: 32, align: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Global", scope: !526, file: !10, line: 165, baseType: !818, size: 64, align: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 163, size: 64, align: 64, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !818, file: !10, line: 164, baseType: !540, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "Nonlocal", scope: !526, file: !10, line: 169, baseType: !822, size: 64, align: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 167, size: 64, align: 64, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !822, file: !10, line: 168, baseType: !540, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Expr", scope: !526, file: !10, line: 173, baseType: !826, size: 64, align: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !10, line: 171, size: 64, align: 64, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !826, file: !10, line: 172, baseType: !554, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !522, file: !10, line: 176, baseType: !156, size: 32, align: 32, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !522, file: !10, line: 177, baseType: !156, size: 32, align: 32, offset: 544)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySTEntryObject", file: !4, line: 65, baseType: !833)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "_symtable_entry", file: !4, line: 37, size: 896, align: 64, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !833, file: !4, line: 38, baseType: !118, size: 128, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ste_id", scope: !833, file: !4, line: 39, baseType: !117, size: 64, align: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ste_symbols", scope: !833, file: !4, line: 40, baseType: !117, size: 64, align: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ste_name", scope: !833, file: !4, line: 41, baseType: !117, size: 64, align: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ste_varnames", scope: !833, file: !4, line: 42, baseType: !117, size: 64, align: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ste_children", scope: !833, file: !4, line: 43, baseType: !117, size: 64, align: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ste_directives", scope: !833, file: !4, line: 44, baseType: !117, size: 64, align: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ste_type", scope: !833, file: !4, line: 45, baseType: !843, size: 32, align: 32, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_block_ty", file: !4, line: 14, baseType: !3)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ste_unoptimized", scope: !833, file: !4, line: 46, baseType: !156, size: 32, align: 32, offset: 544)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ste_nested", scope: !833, file: !4, line: 47, baseType: !156, size: 32, align: 32, offset: 576)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ste_free", scope: !833, file: !4, line: 48, baseType: !460, size: 1, align: 32, offset: 608)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ste_child_free", scope: !833, file: !4, line: 49, baseType: !460, size: 1, align: 32, offset: 609)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ste_generator", scope: !833, file: !4, line: 51, baseType: !460, size: 1, align: 32, offset: 610)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ste_varargs", scope: !833, file: !4, line: 52, baseType: !460, size: 1, align: 32, offset: 611)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ste_varkeywords", scope: !833, file: !4, line: 53, baseType: !460, size: 1, align: 32, offset: 612)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ste_returns_value", scope: !833, file: !4, line: 54, baseType: !460, size: 1, align: 32, offset: 613)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ste_needs_class_closure", scope: !833, file: !4, line: 56, baseType: !460, size: 1, align: 32, offset: 614)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ste_lineno", scope: !833, file: !4, line: 59, baseType: !156, size: 32, align: 32, offset: 640)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ste_col_offset", scope: !833, file: !4, line: 60, baseType: !156, size: 32, align: 32, offset: 672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ste_opt_lineno", scope: !833, file: !4, line: 61, baseType: !156, size: 32, align: 32, offset: 704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ste_opt_col_offset", scope: !833, file: !4, line: 62, baseType: !156, size: 32, align: 32, offset: 736)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ste_tmpname", scope: !833, file: !4, line: 63, baseType: !156, size: 32, align: 32, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ste_table", scope: !833, file: !4, line: 64, baseType: !859, size: 64, align: 64, offset: 832)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64, align: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "symtable", file: !4, line: 18, size: 640, align: 64, elements: !861)
!861 = !{!862, !863, !865, !866, !867, !868, !869, !870, !871, !879, !880}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_filename", scope: !860, file: !4, line: 19, baseType: !117, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_cur", scope: !860, file: !4, line: 21, baseType: !864, size: 64, align: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "st_top", scope: !860, file: !4, line: 22, baseType: !864, size: 64, align: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !860, file: !4, line: 23, baseType: !117, size: 64, align: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "st_stack", scope: !860, file: !4, line: 25, baseType: !117, size: 64, align: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_global", scope: !860, file: !4, line: 26, baseType: !117, size: 64, align: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "st_nblocks", scope: !860, file: !4, line: 27, baseType: !156, size: 32, align: 32, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_private", scope: !860, file: !4, line: 30, baseType: !117, size: 64, align: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_future", scope: !860, file: !4, line: 31, baseType: !872, size: 64, align: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFutureFeatures", file: !874, line: 20, baseType: !875)
!874 = !DIFile(filename: "Include/compile.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!875 = !DICompositeType(tag: DW_TAG_structure_type, file: !874, line: 17, size: 64, align: 32, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ff_features", scope: !875, file: !874, line: 18, baseType: !156, size: 32, align: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ff_lineno", scope: !875, file: !874, line: 19, baseType: !156, size: 32, align: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !860, file: !4, line: 33, baseType: !156, size: 32, align: 32, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_limit", scope: !860, file: !4, line: 34, baseType: !156, size: 32, align: 32, offset: 608)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !884, line: 40, baseType: !885)
!884 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!885 = !DICompositeType(tag: DW_TAG_structure_type, file: !884, line: 23, size: 320, align: 64, elements: !886)
!886 = !{!887, !888, !890}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !885, file: !884, line: 24, baseType: !135, size: 192, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !885, file: !884, line: 26, baseType: !889, size: 64, align: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !885, file: !884, line: 39, baseType: !123, size: 64, align: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64, align: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !893, line: 33, baseType: !894)
!893 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!894 = !DICompositeType(tag: DW_TAG_structure_type, file: !893, line: 25, size: 256, align: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !894, file: !893, line: 26, baseType: !135, size: 192, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !894, file: !893, line: 27, baseType: !898, size: 64, align: 64, offset: 192)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 64, align: 64, elements: !194)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "keyword_ty", file: !10, line: 35, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "_keyword", file: !10, line: 381, size: 128, align: 64, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !901, file: !10, line: 382, baseType: !532, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !901, file: !10, line: 383, baseType: !554, size: 64, align: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "excepthandler_ty", file: !10, line: 29, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "_excepthandler", file: !10, line: 351, size: 320, align: 64, elements: !908)
!908 = !{!909, !910, !919, !920}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !907, file: !10, line: 352, baseType: !112, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !907, file: !10, line: 360, baseType: !911, size: 192, align: 64, offset: 64)
!911 = !DICompositeType(tag: DW_TAG_union_type, scope: !907, file: !10, line: 353, size: 192, align: 64, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptHandler", scope: !911, file: !10, line: 358, baseType: !914, size: 192, align: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !10, line: 354, size: 192, align: 64, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !914, file: !10, line: 355, baseType: !554, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !10, line: 356, baseType: !532, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !914, file: !10, line: 357, baseType: !540, size: 64, align: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !907, file: !10, line: 361, baseType: !156, size: 32, align: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !907, file: !10, line: 362, baseType: !156, size: 32, align: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_ty", file: !10, line: 37, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "_alias", file: !10, line: 386, size: 128, align: 64, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !10, line: 387, baseType: !532, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "asname", scope: !923, file: !10, line: 388, baseType: !532, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "withitem_ty", file: !10, line: 39, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "_withitem", file: !10, line: 391, size: 128, align: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "context_expr", scope: !929, file: !10, line: 392, baseType: !554, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "optional_vars", scope: !929, file: !10, line: 393, baseType: !554, size: 64, align: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !935, line: 351, baseType: !936)
!935 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!936 = !DICompositeType(tag: DW_TAG_structure_type, file: !935, line: 217, size: 384, align: 64, elements: !937)
!937 = !{!938, !939, !940, !941, !949}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !936, file: !935, line: 291, baseType: !118, size: 128, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !936, file: !935, line: 292, baseType: !123, size: 64, align: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !936, file: !935, line: 293, baseType: !330, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !936, file: !935, line: 349, baseType: !942, size: 32, align: 32, offset: 256)
!942 = !DICompositeType(tag: DW_TAG_structure_type, scope: !936, file: !935, line: 294, size: 32, align: 32, elements: !943)
!943 = !{!944, !945, !946, !947, !948}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !942, file: !935, line: 303, baseType: !460, size: 2, align: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !942, file: !935, line: 331, baseType: !460, size: 3, align: 32, offset: 2)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !942, file: !935, line: 336, baseType: !460, size: 1, align: 32, offset: 5)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !942, file: !935, line: 340, baseType: !460, size: 1, align: 32, offset: 6)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !942, file: !935, line: 345, baseType: !460, size: 1, align: 32, offset: 7)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !936, file: !935, line: 350, baseType: !950, size: 64, align: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !207, line: 90, baseType: !156)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "comprehension_ty", file: !10, line: 27, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "_comprehension", file: !10, line: 344, size: 192, align: 64, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !954, file: !10, line: 345, baseType: !554, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !954, file: !10, line: 346, baseType: !554, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ifs", scope: !954, file: !10, line: 347, baseType: !540, size: 64, align: 64, offset: 128)
