; ModuleID = 'irs-onlybc/sysmodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !473, globals: !1353)
!1 = !DIFile(filename: "sysmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !114, !29, !465, !35, !119, !121, !466}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !14, line: 139, baseType: !15)
!14 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !14, line: 69, size: 1536, align: 64, elements: !16)
!16 = !{!17, !19, !20, !379, !438, !439, !440, !441, !442, !443, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !14, line: 72, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !14, line: 73, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !15, file: !14, line: 74, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !14, line: 44, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !14, line: 19, size: 832, align: 64, elements: !24)
!24 = !{!25, !27, !28, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !14, line: 21, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !23, file: !14, line: 22, baseType: !18, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !23, file: !14, line: 24, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !31, line: 109, baseType: !32)
!31 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !31, line: 105, size: 128, align: 64, elements: !33)
!33 = !{!34, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !32, file: !31, line: 107, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !36, line: 177, baseType: !37)
!36 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !38, line: 102, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !40, line: 181, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !32, file: !31, line: 108, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !31, line: 334, size: 3200, align: 64, elements: !45)
!45 = !{!46, !52, !56, !57, !58, !63, !127, !132, !137, !138, !143, !195, !226, !238, !244, !245, !246, !248, !250, !281, !282, !283, !292, !293, !298, !299, !301, !303, !313, !316, !334, !335, !336, !338, !340, !341, !343, !348, !353, !358, !359, !360, !361, !362, !363, !364, !365, !367}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !31, line: 335, baseType: !47, size: 192, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !31, line: 114, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 111, size: 192, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !48, file: !31, line: 112, baseType: !30, size: 128, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !48, file: !31, line: 113, baseType: !35, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !44, file: !31, line: 336, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !44, file: !31, line: 341, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !31, line: 308, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !29}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !44, file: !31, line: 342, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !31, line: 314, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !29, !69, !68}
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 48, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 246, size: 1728, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!73 = !{!74, !75, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !95, !96, !97, !98, !100, !102, !104, !108, !111, !113, !115, !116, !117, !118, !122, !123}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 247, baseType: !68, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 252, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 253, baseType: !76, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 254, baseType: !76, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 255, baseType: !76, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 256, baseType: !76, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 257, baseType: !76, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 258, baseType: !76, size: 64, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 259, baseType: !76, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 261, baseType: !76, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 262, baseType: !76, size: 64, align: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 263, baseType: !76, size: 64, align: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 265, baseType: !88, size: 64, align: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 161, size: 192, align: 64, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !89, file: !72, line: 162, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !89, file: !72, line: 163, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !89, file: !72, line: 167, baseType: !68, size: 32, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 267, baseType: !93, size: 64, align: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 269, baseType: !68, size: 32, align: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 273, baseType: !68, size: 32, align: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 275, baseType: !99, size: 64, align: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !41)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 279, baseType: !101, size: 16, align: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 280, baseType: !103, size: 8, align: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 281, baseType: !105, size: 8, align: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 285, baseType: !109, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 155, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 294, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 141, baseType: !41)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !71, file: !72, line: 303, baseType: !114, size: 64, align: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !71, file: !72, line: 304, baseType: !114, size: 64, align: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !71, file: !72, line: 305, baseType: !114, size: 64, align: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !71, file: !72, line: 306, baseType: !114, size: 64, align: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 307, baseType: !119, size: 64, align: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 62, baseType: !121)
!120 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!121 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 309, baseType: !68, size: 32, align: 32, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 311, baseType: !124, size: 160, align: 8, offset: 1568)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 20)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !44, file: !31, line: 343, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !31, line: 316, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!29, !29, !76}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !44, file: !31, line: 344, baseType: !133, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !31, line: 318, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!68, !29, !76, !29}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !44, file: !31, line: 345, baseType: !114, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !44, file: !31, line: 346, baseType: !139, size: 64, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !31, line: 320, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!29, !29}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !44, file: !31, line: 350, baseType: !144, size: 64, align: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !31, line: 278, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 236, size: 2176, align: 64, elements: !147)
!147 = !{!148, !153, !154, !155, !156, !157, !162, !164, !165, !166, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !146, file: !31, line: 241, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !31, line: 166, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!29, !29, !29}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !146, file: !31, line: 242, baseType: !149, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !146, file: !31, line: 243, baseType: !149, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !146, file: !31, line: 244, baseType: !149, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !146, file: !31, line: 245, baseType: !149, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !146, file: !31, line: 246, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !31, line: 167, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!29, !29, !29, !29}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !146, file: !31, line: 247, baseType: !163, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !31, line: 165, baseType: !140)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !146, file: !31, line: 248, baseType: !163, size: 64, align: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !146, file: !31, line: 249, baseType: !163, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !146, file: !31, line: 250, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !31, line: 168, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!68, !29}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !146, file: !31, line: 251, baseType: !163, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !146, file: !31, line: 252, baseType: !149, size: 64, align: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !146, file: !31, line: 253, baseType: !149, size: 64, align: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !146, file: !31, line: 254, baseType: !149, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !146, file: !31, line: 255, baseType: !149, size: 64, align: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !146, file: !31, line: 256, baseType: !149, size: 64, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !146, file: !31, line: 257, baseType: !163, size: 64, align: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !146, file: !31, line: 258, baseType: !114, size: 64, align: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !146, file: !31, line: 259, baseType: !163, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !146, file: !31, line: 261, baseType: !149, size: 64, align: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !146, file: !31, line: 262, baseType: !149, size: 64, align: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !146, file: !31, line: 263, baseType: !149, size: 64, align: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !146, file: !31, line: 264, baseType: !149, size: 64, align: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !146, file: !31, line: 265, baseType: !158, size: 64, align: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !146, file: !31, line: 266, baseType: !149, size: 64, align: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !146, file: !31, line: 267, baseType: !149, size: 64, align: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !146, file: !31, line: 268, baseType: !149, size: 64, align: 64, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !146, file: !31, line: 269, baseType: !149, size: 64, align: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !146, file: !31, line: 270, baseType: !149, size: 64, align: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !146, file: !31, line: 272, baseType: !149, size: 64, align: 64, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !146, file: !31, line: 273, baseType: !149, size: 64, align: 64, offset: 1920)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !146, file: !31, line: 274, baseType: !149, size: 64, align: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !146, file: !31, line: 275, baseType: !149, size: 64, align: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !146, file: !31, line: 277, baseType: !163, size: 64, align: 64, offset: 2112)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !44, file: !31, line: 351, baseType: !196, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !31, line: 292, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 280, size: 640, align: 64, elements: !199)
!199 = !{!200, !205, !206, !211, !212, !213, !218, !219, !224, !225}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !198, file: !31, line: 281, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !31, line: 169, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!35, !29}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !198, file: !31, line: 282, baseType: !149, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !198, file: !31, line: 283, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !31, line: 170, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !29, !35}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !198, file: !31, line: 284, baseType: !207, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !198, file: !31, line: 285, baseType: !114, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !198, file: !31, line: 286, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !31, line: 172, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!68, !29, !35, !29}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !198, file: !31, line: 287, baseType: !114, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !198, file: !31, line: 288, baseType: !220, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !31, line: 231, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!68, !29, !29}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !198, file: !31, line: 290, baseType: !149, size: 64, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !198, file: !31, line: 291, baseType: !207, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !44, file: !31, line: 352, baseType: !227, size: 64, align: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !31, line: 298, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 294, size: 192, align: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !229, file: !31, line: 295, baseType: !201, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !229, file: !31, line: 296, baseType: !149, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !229, file: !31, line: 297, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !31, line: 174, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!68, !29, !29, !29}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !44, file: !31, line: 356, baseType: !239, size: 64, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !31, line: 321, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !29}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !36, line: 186, baseType: !35)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !44, file: !31, line: 357, baseType: !158, size: 64, align: 64, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !44, file: !31, line: 358, baseType: !139, size: 64, align: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !44, file: !31, line: 359, baseType: !247, size: 64, align: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !31, line: 317, baseType: !150)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !44, file: !31, line: 360, baseType: !249, size: 64, align: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !31, line: 319, baseType: !235)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !44, file: !31, line: 363, baseType: !251, size: 64, align: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !31, line: 304, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 301, size: 128, align: 64, elements: !254)
!254 = !{!255, !276}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !253, file: !31, line: 302, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !31, line: 193, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!68, !29, !260, !68}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !31, line: 191, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !31, line: 178, size: 640, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !273, !274, !275}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !262, file: !31, line: 179, baseType: !114, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !262, file: !31, line: 180, baseType: !29, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !262, file: !31, line: 181, baseType: !35, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !262, file: !31, line: 182, baseType: !35, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !262, file: !31, line: 184, baseType: !68, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !262, file: !31, line: 185, baseType: !68, size: 32, align: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !262, file: !31, line: 186, baseType: !76, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !262, file: !31, line: 187, baseType: !272, size: 64, align: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !262, file: !31, line: 188, baseType: !272, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !262, file: !31, line: 189, baseType: !272, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !262, file: !31, line: 190, baseType: !114, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !253, file: !31, line: 303, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !31, line: 194, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !29, !260}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !44, file: !31, line: 366, baseType: !121, size: 64, align: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !44, file: !31, line: 368, baseType: !53, size: 64, align: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !44, file: !31, line: 372, baseType: !284, size: 64, align: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !31, line: 233, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!68, !29, !288, !114}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !31, line: 232, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!68, !29, !114}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !44, file: !31, line: 375, baseType: !167, size: 64, align: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !44, file: !31, line: 379, baseType: !294, size: 64, align: 64, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !31, line: 322, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!29, !29, !29, !68}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !44, file: !31, line: 382, baseType: !35, size: 64, align: 64, offset: 1664)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !44, file: !31, line: 385, baseType: !300, size: 64, align: 64, offset: 1728)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !31, line: 323, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !44, file: !31, line: 386, baseType: !302, size: 64, align: 64, offset: 1792)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !31, line: 324, baseType: !140)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !44, file: !31, line: 389, baseType: !304, size: 64, align: 64, offset: 1856)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !306, line: 40, size: 256, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!307 = !{!308, !309, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !305, file: !306, line: 41, baseType: !53, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !305, file: !306, line: 42, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !306, line: 18, baseType: !150)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !305, file: !306, line: 43, baseType: !68, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !305, file: !306, line: 45, baseType: !53, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !44, file: !31, line: 390, baseType: !314, size: 64, align: 64, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !31, line: 390, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !44, file: !31, line: 391, baseType: !317, size: 64, align: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !319, line: 11, size: 320, align: 64, elements: !320)
!319 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!320 = !{!321, !322, !327, !332, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 12, baseType: !76, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !318, file: !319, line: 13, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !319, line: 8, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!29, !29, !114}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !318, file: !319, line: 14, baseType: !328, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !319, line: 9, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!68, !29, !29, !114}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !318, file: !319, line: 15, baseType: !76, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !318, file: !319, line: 16, baseType: !114, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !44, file: !31, line: 392, baseType: !43, size: 64, align: 64, offset: 2048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !44, file: !31, line: 393, baseType: !29, size: 64, align: 64, offset: 2112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !44, file: !31, line: 394, baseType: !337, size: 64, align: 64, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !31, line: 325, baseType: !159)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !44, file: !31, line: 395, baseType: !339, size: 64, align: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !31, line: 326, baseType: !235)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !44, file: !31, line: 396, baseType: !35, size: 64, align: 64, offset: 2304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !44, file: !31, line: 397, baseType: !342, size: 64, align: 64, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !31, line: 327, baseType: !235)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !44, file: !31, line: 398, baseType: !344, size: 64, align: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !31, line: 329, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!29, !43, !35}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !44, file: !31, line: 399, baseType: !349, size: 64, align: 64, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !31, line: 328, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!29, !43, !29, !29}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !44, file: !31, line: 400, baseType: !354, size: 64, align: 64, offset: 2560)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !31, line: 307, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !114}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !44, file: !31, line: 401, baseType: !167, size: 64, align: 64, offset: 2624)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !44, file: !31, line: 402, baseType: !29, size: 64, align: 64, offset: 2688)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !44, file: !31, line: 403, baseType: !29, size: 64, align: 64, offset: 2752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !44, file: !31, line: 404, baseType: !29, size: 64, align: 64, offset: 2816)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !44, file: !31, line: 405, baseType: !29, size: 64, align: 64, offset: 2880)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !44, file: !31, line: 406, baseType: !29, size: 64, align: 64, offset: 2944)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !44, file: !31, line: 407, baseType: !59, size: 64, align: 64, offset: 3008)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !44, file: !31, line: 410, baseType: !366, size: 32, align: 32, offset: 3072)
!366 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !44, file: !31, line: 412, baseType: !59, size: 64, align: 64, offset: 3136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !23, file: !14, line: 25, baseType: !29, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !23, file: !14, line: 26, baseType: !29, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !23, file: !14, line: 27, baseType: !29, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !23, file: !14, line: 28, baseType: !29, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !23, file: !14, line: 30, baseType: !29, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !23, file: !14, line: 31, baseType: !29, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !23, file: !14, line: 32, baseType: !29, size: 64, align: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !23, file: !14, line: 33, baseType: !68, size: 32, align: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !23, file: !14, line: 34, baseType: !68, size: 32, align: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !23, file: !14, line: 37, baseType: !68, size: 32, align: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !23, file: !14, line: 43, baseType: !29, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !15, file: !14, line: 76, baseType: !380, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !382, line: 17, size: 3072, align: 64, elements: !383)
!382 = !DIFile(filename: "Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!383 = !{!384, !385, !386, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !436}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !382, line: 18, baseType: !47, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !381, file: !382, line: 19, baseType: !380, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !381, file: !382, line: 20, baseType: !387, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !389, line: 33, baseType: !390)
!389 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!390 = !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 11, size: 1152, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !408, !409, !410, !411, !412}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !390, file: !389, line: 12, baseType: !30, size: 128, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !390, file: !389, line: 13, baseType: !68, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !390, file: !389, line: 14, baseType: !68, size: 32, align: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !390, file: !389, line: 15, baseType: !68, size: 32, align: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !390, file: !389, line: 16, baseType: !68, size: 32, align: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !390, file: !389, line: 17, baseType: !68, size: 32, align: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !390, file: !389, line: 18, baseType: !29, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !390, file: !389, line: 19, baseType: !29, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !390, file: !389, line: 20, baseType: !29, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !390, file: !389, line: 21, baseType: !29, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !390, file: !389, line: 22, baseType: !29, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !390, file: !389, line: 23, baseType: !29, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !390, file: !389, line: 25, baseType: !405, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !390, file: !389, line: 26, baseType: !29, size: 64, align: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !390, file: !389, line: 27, baseType: !29, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !390, file: !389, line: 28, baseType: !68, size: 32, align: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !390, file: !389, line: 29, baseType: !29, size: 64, align: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !390, file: !389, line: 31, baseType: !114, size: 64, align: 64, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !390, file: !389, line: 32, baseType: !29, size: 64, align: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !381, file: !382, line: 21, baseType: !29, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !381, file: !382, line: 22, baseType: !29, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !381, file: !382, line: 23, baseType: !29, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !381, file: !382, line: 24, baseType: !417, size: 64, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !381, file: !382, line: 28, baseType: !417, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !381, file: !382, line: 29, baseType: !29, size: 64, align: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !381, file: !382, line: 38, baseType: !29, size: 64, align: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !381, file: !382, line: 38, baseType: !29, size: 64, align: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !381, file: !382, line: 38, baseType: !29, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !381, file: !382, line: 40, baseType: !29, size: 64, align: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !381, file: !382, line: 42, baseType: !68, size: 32, align: 32, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !381, file: !382, line: 48, baseType: !68, size: 32, align: 32, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !381, file: !382, line: 49, baseType: !68, size: 32, align: 32, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !381, file: !382, line: 50, baseType: !55, size: 8, align: 8, offset: 1056)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !381, file: !382, line: 51, baseType: !429, size: 1920, align: 32, offset: 1088)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1920, align: 32, elements: !125)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !382, line: 15, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 11, size: 96, align: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !431, file: !382, line: 12, baseType: !68, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !431, file: !382, line: 13, baseType: !68, size: 32, align: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !431, file: !382, line: 14, baseType: !68, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !381, file: !382, line: 52, baseType: !437, size: 64, align: 64, offset: 3008)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, align: 64, elements: !106)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !15, file: !14, line: 77, baseType: !68, size: 32, align: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !15, file: !14, line: 78, baseType: !55, size: 8, align: 8, offset: 288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !15, file: !14, line: 80, baseType: !55, size: 8, align: 8, offset: 296)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !15, file: !14, line: 85, baseType: !68, size: 32, align: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !15, file: !14, line: 86, baseType: !68, size: 32, align: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !15, file: !14, line: 88, baseType: !444, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !14, line: 54, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!68, !29, !380, !68, !29}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !15, file: !14, line: 89, baseType: !444, size: 64, align: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !15, file: !14, line: 90, baseType: !29, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !15, file: !14, line: 91, baseType: !29, size: 64, align: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !15, file: !14, line: 93, baseType: !29, size: 64, align: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !15, file: !14, line: 94, baseType: !29, size: 64, align: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !15, file: !14, line: 95, baseType: !29, size: 64, align: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !15, file: !14, line: 97, baseType: !29, size: 64, align: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !15, file: !14, line: 98, baseType: !29, size: 64, align: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !15, file: !14, line: 99, baseType: !29, size: 64, align: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !15, file: !14, line: 101, baseType: !29, size: 64, align: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !15, file: !14, line: 103, baseType: !68, size: 32, align: 32, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !15, file: !14, line: 105, baseType: !29, size: 64, align: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !15, file: !14, line: 106, baseType: !41, size: 64, align: 64, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !15, file: !14, line: 108, baseType: !68, size: 32, align: 32, offset: 1280)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !15, file: !14, line: 109, baseType: !29, size: 64, align: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !15, file: !14, line: 134, baseType: !355, size: 64, align: 64, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !15, file: !14, line: 135, baseType: !114, size: 64, align: 64, offset: 1472)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !468, line: 33, baseType: !469)
!468 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!469 = !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 25, size: 256, align: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !469, file: !468, line: 26, baseType: !47, size: 192, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !469, file: !468, line: 27, baseType: !437, size: 64, align: 64, offset: 192)
!473 = !{!474, !503, !515, !528, !541, !545, !555, !566, !569, !596, !599, !751, !757, !769, !775, !793, !797, !801, !805, !814, !819, !822, !831, !835, !839, !853, !889, !899, !906, !911, !914, !924, !927, !930, !934, !937, !955, !968, !973, !977, !981, !987, !991, !1002, !1006, !1010, !1021, !1034, !1045, !1050, !1054, !1081, !1092, !1098, !1102, !1129, !1158, !1177, !1190, !1211, !1219, !1237, !1255, !1285, !1306, !1314, !1337}
!474 = !DISubprogram(name: "_PySys_GetObjectId", scope: !475, file: !475, line: 51, type: !476, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_Identifier*)* @_PySys_GetObjectId, variables: !486)
!475 = !DIFile(filename: "./Python/sysmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!476 = !DISubroutineType(types: !477)
!477 = !{!29, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !31, line: 144, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !31, line: 140, size: 192, align: 64, elements: !481)
!481 = !{!482, !484, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !31, line: 141, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !480, file: !31, line: 142, baseType: !53, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !480, file: !31, line: 143, baseType: !29, size: 64, align: 64, offset: 128)
!486 = !{!487, !488, !489, !496, !497, !500, !502}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !474, file: !475, line: 51, type: !478)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !474, file: !475, line: 53, type: !12)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !490, file: !475, line: 53, type: !491)
!490 = distinct !DILexicalBlock(scope: !474, file: !475, line: 53, column: 61)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !493, file: !4, line: 32, baseType: !114, size: 64, align: 64)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !490, file: !475, line: 53, type: !114)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !490, file: !475, line: 53, type: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !490, file: !475, line: 53, type: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !474, file: !475, line: 54, type: !29)
!503 = !DISubprogram(name: "PySys_GetObject", scope: !475, file: !475, line: 61, type: !504, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PySys_GetObject, variables: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!29, !53}
!506 = !{!507, !508, !509, !511, !512, !513, !514}
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !503, file: !475, line: 61, type: !53)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !503, file: !475, line: 63, type: !12)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !510, file: !475, line: 63, type: !491)
!510 = distinct !DILexicalBlock(scope: !503, file: !475, line: 63, column: 61)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !510, file: !475, line: 63, type: !114)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !510, file: !475, line: 63, type: !498)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !510, file: !475, line: 63, type: !501)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !503, file: !475, line: 64, type: !29)
!515 = !DISubprogram(name: "_PySys_SetObjectId", scope: !475, file: !475, line: 71, type: !516, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_Identifier*, %struct._object*)* @_PySys_SetObjectId, variables: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!68, !478, !29}
!518 = !{!519, !520, !521, !522, !524, !525, !526, !527}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !515, file: !475, line: 71, type: !478)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !515, file: !475, line: 71, type: !29)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !515, file: !475, line: 73, type: !12)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !523, file: !475, line: 73, type: !491)
!523 = distinct !DILexicalBlock(scope: !515, file: !475, line: 73, column: 61)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !523, file: !475, line: 73, type: !114)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !523, file: !475, line: 73, type: !498)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !523, file: !475, line: 73, type: !501)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !515, file: !475, line: 74, type: !29)
!528 = !DISubprogram(name: "PySys_SetObject", scope: !475, file: !475, line: 86, type: !529, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @PySys_SetObject, variables: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{!68, !53, !29}
!531 = !{!532, !533, !534, !535, !537, !538, !539, !540}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !528, file: !475, line: 86, type: !53)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !528, file: !475, line: 86, type: !29)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !528, file: !475, line: 88, type: !12)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !536, file: !475, line: 88, type: !491)
!536 = distinct !DILexicalBlock(scope: !528, file: !475, line: 88, column: 61)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !536, file: !475, line: 88, type: !114)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !536, file: !475, line: 88, type: !498)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !536, file: !475, line: 88, type: !501)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !528, file: !475, line: 89, type: !29)
!541 = !DISubprogram(name: "PySys_ResetWarnOptions", scope: !475, file: !475, line: 1219, type: !542, isLocal: false, isDefinition: true, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PySys_ResetWarnOptions, variables: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{null}
!544 = !{}
!545 = !DISubprogram(name: "PySys_AddWarnOptionUnicode", scope: !475, file: !475, line: 1227, type: !61, isLocal: false, isDefinition: true, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PySys_AddWarnOptionUnicode, variables: !546)
!546 = !{!547, !548, !552}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unicode", arg: 1, scope: !545, file: !475, line: 1227, type: !29)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !549, file: !475, line: 1230, type: !29)
!549 = distinct !DILexicalBlock(scope: !550, file: !475, line: 1230, column: 12)
!550 = distinct !DILexicalBlock(scope: !551, file: !475, line: 1229, column: 115)
!551 = distinct !DILexicalBlock(scope: !545, file: !475, line: 1229, column: 9)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !475, line: 1230, type: !29)
!553 = distinct !DILexicalBlock(scope: !554, file: !475, line: 1230, column: 107)
!554 = distinct !DILexicalBlock(scope: !549, file: !475, line: 1230, column: 73)
!555 = !DISubprogram(name: "PySys_AddWarnOption", scope: !475, file: !475, line: 1239, type: !556, isLocal: false, isDefinition: true, scopeLine: 1240, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @PySys_AddWarnOption, variables: !561)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !120, line: 90, baseType: !68)
!561 = !{!562, !563, !564}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !555, file: !475, line: 1239, type: !558)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !555, file: !475, line: 1241, type: !29)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !565, file: !475, line: 1246, type: !29)
!565 = distinct !DILexicalBlock(scope: !555, file: !475, line: 1246, column: 8)
!566 = !DISubprogram(name: "PySys_HasWarnOptions", scope: !475, file: !475, line: 1250, type: !567, isLocal: false, isDefinition: true, scopeLine: 1251, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PySys_HasWarnOptions, variables: !544)
!567 = !DISubroutineType(types: !568)
!568 = !{!68}
!569 = !DISubprogram(name: "PySys_AddXOption", scope: !475, file: !475, line: 1268, type: !556, isLocal: false, isDefinition: true, scopeLine: 1269, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @PySys_AddXOption, variables: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !578, !580, !582, !585, !587, !590, !593, !594, !595}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !569, file: !475, line: 1268, type: !558)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opts", scope: !569, file: !475, line: 1270, type: !29)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !569, file: !475, line: 1271, type: !29)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !569, file: !475, line: 1271, type: !29)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_end", scope: !569, file: !475, line: 1272, type: !558)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !577, file: !475, line: 1291, type: !29)
!577 = distinct !DILexicalBlock(scope: !569, file: !475, line: 1291, column: 8)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !475, line: 1292, type: !29)
!579 = distinct !DILexicalBlock(scope: !569, file: !475, line: 1292, column: 8)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !581, file: !475, line: 1296, type: !29)
!581 = distinct !DILexicalBlock(scope: !569, file: !475, line: 1296, column: 8)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !475, line: 1296, type: !29)
!583 = distinct !DILexicalBlock(scope: !584, file: !475, line: 1296, column: 96)
!584 = distinct !DILexicalBlock(scope: !581, file: !475, line: 1296, column: 62)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !586, file: !475, line: 1297, type: !29)
!586 = distinct !DILexicalBlock(scope: !569, file: !475, line: 1297, column: 8)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !475, line: 1297, type: !29)
!588 = distinct !DILexicalBlock(scope: !589, file: !475, line: 1297, column: 97)
!589 = distinct !DILexicalBlock(scope: !586, file: !475, line: 1297, column: 63)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !591, file: !475, line: 1299, type: !491)
!591 = distinct !DILexicalBlock(scope: !592, file: !475, line: 1299, column: 24)
!592 = distinct !DILexicalBlock(scope: !569, file: !475, line: 1299, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !591, file: !475, line: 1299, type: !114)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !591, file: !475, line: 1299, type: !498)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !591, file: !475, line: 1299, type: !501)
!596 = !DISubprogram(name: "PySys_GetXOptions", scope: !475, file: !475, line: 1304, type: !597, isLocal: false, isDefinition: true, scopeLine: 1305, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PySys_GetXOptions, variables: !544)
!597 = !DISubroutineType(types: !598)
!598 = !{!29}
!599 = !DISubprogram(name: "_PySys_Init", scope: !475, file: !475, line: 1622, type: !597, isLocal: false, isDefinition: true, scopeLine: 1623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @_PySys_Init, variables: !600)
!600 = !{!601, !602, !603, !604, !605, !643, !645, !647, !649, !651, !653, !655, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !719, !721, !723, !725, !727, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747, !749}
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !599, file: !475, line: 1624, type: !29)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sysdict", scope: !599, file: !475, line: 1624, type: !29)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "version_info", scope: !599, file: !475, line: 1624, type: !29)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !599, file: !475, line: 1625, type: !68)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sb", scope: !606, file: !475, line: 1660, type: !607)
!606 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1659, column: 5)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !608, line: 46, size: 1152, align: 64, elements: !609)
!608 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!609 = !{!610, !612, !614, !616, !618, !620, !622, !623, !624, !625, !627, !629, !637, !638, !639}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !607, file: !608, line: 48, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !40, line: 133, baseType: !121)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !607, file: !608, line: 53, baseType: !613, size: 64, align: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !40, line: 136, baseType: !121)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !607, file: !608, line: 61, baseType: !615, size: 64, align: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !40, line: 139, baseType: !121)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !607, file: !608, line: 62, baseType: !617, size: 32, align: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 138, baseType: !366)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !607, file: !608, line: 64, baseType: !619, size: 32, align: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !40, line: 134, baseType: !366)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !607, file: !608, line: 65, baseType: !621, size: 32, align: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !40, line: 135, baseType: !366)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !607, file: !608, line: 67, baseType: !68, size: 32, align: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !607, file: !608, line: 69, baseType: !611, size: 64, align: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !607, file: !608, line: 74, baseType: !99, size: 64, align: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !607, file: !608, line: 78, baseType: !626, size: 64, align: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !40, line: 162, baseType: !41)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !607, file: !608, line: 80, baseType: !628, size: 64, align: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !40, line: 167, baseType: !41)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !607, file: !608, line: 91, baseType: !630, size: 128, align: 64, offset: 576)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !631, line: 120, size: 128, align: 64, elements: !632)
!631 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!632 = !{!633, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !630, file: !631, line: 122, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 148, baseType: !41)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !630, file: !631, line: 123, baseType: !636, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !40, line: 184, baseType: !41)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !607, file: !608, line: 92, baseType: !630, size: 128, align: 64, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !607, file: !608, line: 93, baseType: !630, size: 128, align: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !607, file: !608, line: 106, baseType: !640, size: 192, align: 64, offset: 960)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 192, align: 64, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 3)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !644, file: !475, line: 1673, type: !29)
!644 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1673, column: 8)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !646, file: !475, line: 1675, type: !29)
!646 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1675, column: 8)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !648, file: !475, line: 1677, type: !29)
!648 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1677, column: 8)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !650, file: !475, line: 1677, type: !29)
!650 = distinct !DILexicalBlock(scope: !648, file: !475, line: 1677, column: 159)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !652, file: !475, line: 1679, type: !29)
!652 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1679, column: 8)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !654, file: !475, line: 1679, type: !29)
!654 = distinct !DILexicalBlock(scope: !652, file: !475, line: 1679, column: 200)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !656, file: !475, line: 1681, type: !29)
!656 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1681, column: 8)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !658, file: !475, line: 1681, type: !29)
!658 = distinct !DILexicalBlock(scope: !656, file: !475, line: 1681, column: 195)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !660, file: !475, line: 1684, type: !29)
!660 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1684, column: 8)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !475, line: 1684, type: !29)
!662 = distinct !DILexicalBlock(scope: !660, file: !475, line: 1684, column: 175)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !664, file: !475, line: 1686, type: !29)
!664 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1686, column: 8)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !666, file: !475, line: 1686, type: !29)
!666 = distinct !DILexicalBlock(scope: !664, file: !475, line: 1686, column: 147)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !668, file: !475, line: 1688, type: !29)
!668 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1688, column: 8)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !475, line: 1688, type: !29)
!670 = distinct !DILexicalBlock(scope: !668, file: !475, line: 1688, column: 163)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !672, file: !475, line: 1690, type: !29)
!672 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1690, column: 8)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !674, file: !475, line: 1690, type: !29)
!674 = distinct !DILexicalBlock(scope: !672, file: !475, line: 1690, column: 161)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !676, file: !475, line: 1692, type: !29)
!676 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1692, column: 8)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !475, line: 1692, type: !29)
!678 = distinct !DILexicalBlock(scope: !676, file: !475, line: 1692, column: 177)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !680, file: !475, line: 1695, type: !29)
!680 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1695, column: 8)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !475, line: 1695, type: !29)
!682 = distinct !DILexicalBlock(scope: !680, file: !475, line: 1695, column: 163)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !684, file: !475, line: 1697, type: !29)
!684 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1697, column: 8)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !475, line: 1697, type: !29)
!686 = distinct !DILexicalBlock(scope: !684, file: !475, line: 1697, column: 172)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !688, file: !475, line: 1699, type: !29)
!688 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1699, column: 8)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !690, file: !475, line: 1699, type: !29)
!690 = distinct !DILexicalBlock(scope: !688, file: !475, line: 1699, column: 168)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !692, file: !475, line: 1701, type: !29)
!692 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1701, column: 8)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !475, line: 1701, type: !29)
!694 = distinct !DILexicalBlock(scope: !692, file: !475, line: 1701, column: 177)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !696, file: !475, line: 1703, type: !29)
!696 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1703, column: 8)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !475, line: 1703, type: !29)
!698 = distinct !DILexicalBlock(scope: !696, file: !475, line: 1703, column: 173)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !700, file: !475, line: 1705, type: !29)
!700 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1705, column: 8)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !702, file: !475, line: 1705, type: !29)
!702 = distinct !DILexicalBlock(scope: !700, file: !475, line: 1705, column: 142)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !704, file: !475, line: 1707, type: !29)
!704 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1707, column: 8)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !706, file: !475, line: 1707, type: !29)
!706 = distinct !DILexicalBlock(scope: !704, file: !475, line: 1707, column: 139)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !708, file: !475, line: 1714, type: !29)
!708 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1714, column: 8)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !710, file: !475, line: 1714, type: !29)
!710 = distinct !DILexicalBlock(scope: !708, file: !475, line: 1714, column: 139)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !712, file: !475, line: 1716, type: !29)
!712 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1716, column: 8)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !714, file: !475, line: 1716, type: !29)
!714 = distinct !DILexicalBlock(scope: !712, file: !475, line: 1716, column: 150)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !716, file: !475, line: 1718, type: !29)
!716 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1718, column: 8)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !718, file: !475, line: 1718, type: !29)
!718 = distinct !DILexicalBlock(scope: !716, file: !475, line: 1718, column: 162)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !720, file: !475, line: 1724, type: !29)
!720 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1724, column: 8)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !475, line: 1724, type: !29)
!722 = distinct !DILexicalBlock(scope: !720, file: !475, line: 1724, column: 154)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !724, file: !475, line: 1735, type: !29)
!724 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1735, column: 8)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !726, file: !475, line: 1735, type: !29)
!726 = distinct !DILexicalBlock(scope: !724, file: !475, line: 1735, column: 148)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !728, file: !475, line: 1746, type: !29)
!728 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1746, column: 8)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !730, file: !475, line: 1748, type: !29)
!730 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1748, column: 8)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !732, file: !475, line: 1757, type: !29)
!732 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1757, column: 8)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !734, file: !475, line: 1757, type: !29)
!734 = distinct !DILexicalBlock(scope: !732, file: !475, line: 1757, column: 139)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !736, file: !475, line: 1766, type: !29)
!736 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1766, column: 8)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !475, line: 1766, type: !29)
!738 = distinct !DILexicalBlock(scope: !736, file: !475, line: 1766, column: 157)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !740, file: !475, line: 1773, type: !29)
!740 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1773, column: 8)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !742, file: !475, line: 1773, type: !29)
!742 = distinct !DILexicalBlock(scope: !740, file: !475, line: 1773, column: 132)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !744, file: !475, line: 1797, type: !29)
!744 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1797, column: 8)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !746, file: !475, line: 1797, type: !29)
!746 = distinct !DILexicalBlock(scope: !744, file: !475, line: 1797, column: 160)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !748, file: !475, line: 1805, type: !29)
!748 = distinct !DILexicalBlock(scope: !599, file: !475, line: 1805, column: 8)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !750, file: !475, line: 1805, type: !29)
!750 = distinct !DILexicalBlock(scope: !748, file: !475, line: 1805, column: 144)
!751 = !DISubprogram(name: "PySys_SetPath", scope: !475, file: !475, line: 1849, type: !556, isLocal: false, isDefinition: true, scopeLine: 1850, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @PySys_SetPath, variables: !752)
!752 = !{!753, !754, !755}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !751, file: !475, line: 1849, type: !558)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !751, file: !475, line: 1851, type: !29)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !475, line: 1856, type: !29)
!756 = distinct !DILexicalBlock(scope: !751, file: !475, line: 1856, column: 8)
!757 = !DISubprogram(name: "PySys_SetArgvEx", scope: !475, file: !475, line: 1992, type: !758, isLocal: false, isDefinition: true, scopeLine: 1993, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32**, i32)* @PySys_SetArgvEx, variables: !762)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !68, !760, !68}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!762 = !{!763, !764, !765, !766, !767}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !757, file: !475, line: 1992, type: !68)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !757, file: !475, line: 1992, type: !760)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "updatepath", arg: 3, scope: !757, file: !475, line: 1992, type: !68)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "av", scope: !757, file: !475, line: 1994, type: !29)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !768, file: !475, line: 1999, type: !29)
!768 = distinct !DILexicalBlock(scope: !757, file: !475, line: 1999, column: 8)
!769 = !DISubprogram(name: "PySys_SetArgv", scope: !475, file: !475, line: 2005, type: !770, isLocal: false, isDefinition: true, scopeLine: 2006, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32**)* @PySys_SetArgv, variables: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !68, !760}
!772 = !{!773, !774}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !769, file: !475, line: 2005, type: !68)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !769, file: !475, line: 2005, type: !760)
!775 = !DISubprogram(name: "PySys_WriteStdout", scope: !475, file: !475, line: 2117, type: !776, isLocal: false, isDefinition: true, scopeLine: 2118, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_WriteStdout, variables: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !53, null}
!778 = !{!779, !780}
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !775, file: !475, line: 2117, type: !53)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !775, file: !475, line: 2119, type: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !38, line: 79, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !783, line: 50, baseType: !784)
!783 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 2119, baseType: !785)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 192, align: 64, elements: !106)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 2119, baseType: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 2119, size: 192, align: 64, elements: !788)
!788 = !{!789, !790, !791, !792}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !787, file: !1, line: 2119, baseType: !366, size: 32, align: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !787, file: !1, line: 2119, baseType: !366, size: 32, align: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !787, file: !1, line: 2119, baseType: !114, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !787, file: !1, line: 2119, baseType: !114, size: 64, align: 64, offset: 128)
!793 = !DISubprogram(name: "PySys_WriteStderr", scope: !475, file: !475, line: 2127, type: !776, isLocal: false, isDefinition: true, scopeLine: 2128, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_WriteStderr, variables: !794)
!794 = !{!795, !796}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !793, file: !475, line: 2127, type: !53)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !793, file: !475, line: 2129, type: !781)
!797 = !DISubprogram(name: "PySys_FormatStdout", scope: !475, file: !475, line: 2159, type: !776, isLocal: false, isDefinition: true, scopeLine: 2160, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_FormatStdout, variables: !798)
!798 = !{!799, !800}
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !797, file: !475, line: 2159, type: !53)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !797, file: !475, line: 2161, type: !781)
!801 = !DISubprogram(name: "PySys_FormatStderr", scope: !475, file: !475, line: 2169, type: !776, isLocal: false, isDefinition: true, scopeLine: 2170, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_FormatStderr, variables: !802)
!802 = !{!803, !804}
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !801, file: !475, line: 2169, type: !53)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !801, file: !475, line: 2171, type: !781)
!805 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !806, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !811)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !808, !501}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!811 = !{!812, !813}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !805, file: !4, line: 59, type: !808)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !805, file: !4, line: 59, type: !501)
!814 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !815, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !501}
!817 = !{!818}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !814, file: !4, line: 51, type: !501)
!819 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !815, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !820)
!820 = !{!821}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !819, file: !4, line: 44, type: !501)
!822 = !DISubprogram(name: "get_xoptions", scope: !475, file: !475, line: 1258, type: !597, isLocal: true, isDefinition: true, scopeLine: 1259, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @get_xoptions, variables: !823)
!823 = !{!824, !828}
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !825, file: !475, line: 1261, type: !29)
!825 = distinct !DILexicalBlock(scope: !826, file: !475, line: 1261, column: 12)
!826 = distinct !DILexicalBlock(scope: !827, file: !475, line: 1260, column: 109)
!827 = distinct !DILexicalBlock(scope: !822, file: !475, line: 1260, column: 9)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !829, file: !475, line: 1261, type: !29)
!829 = distinct !DILexicalBlock(scope: !830, file: !475, line: 1261, column: 104)
!830 = distinct !DILexicalBlock(scope: !825, file: !475, line: 1261, column: 70)
!831 = !DISubprogram(name: "sys_clear_type_cache", scope: !475, file: !475, line: 1101, type: !151, isLocal: true, isDefinition: true, scopeLine: 1102, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_clear_type_cache, variables: !832)
!832 = !{!833, !834}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !831, file: !475, line: 1101, type: !29)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !831, file: !475, line: 1101, type: !29)
!835 = !DISubprogram(name: "sys_current_frames", scope: !475, file: !475, line: 1016, type: !151, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_current_frames, variables: !836)
!836 = !{!837, !838}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !835, file: !475, line: 1016, type: !29)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !835, file: !475, line: 1016, type: !29)
!839 = !DISubprogram(name: "sys_displayhook", scope: !475, file: !475, line: 163, type: !151, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_displayhook, variables: !840)
!840 = !{!841, !842, !843, !844, !845, !847, !848, !849, !850, !851, !852}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !839, file: !475, line: 163, type: !29)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 2, scope: !839, file: !475, line: 163, type: !29)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outf", scope: !839, file: !475, line: 165, type: !29)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !839, file: !475, line: 166, type: !21)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !846, file: !475, line: 166, type: !491)
!846 = distinct !DILexicalBlock(scope: !839, file: !475, line: 166, column: 66)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !846, file: !475, line: 166, type: !114)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !846, file: !475, line: 166, type: !498)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !846, file: !475, line: 166, type: !501)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modules", scope: !839, file: !475, line: 167, type: !29)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !839, file: !475, line: 168, type: !29)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !839, file: !475, line: 170, type: !68)
!853 = !DISubprogram(name: "sys_displayhook_unencodable", scope: !475, file: !475, line: 107, type: !222, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @sys_displayhook_unencodable, variables: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !867, !871, !873, !875, !878, !882, !884, !886}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outf", arg: 1, scope: !853, file: !475, line: 107, type: !29)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 2, scope: !853, file: !475, line: 107, type: !29)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stdout_encoding", scope: !853, file: !475, line: 109, type: !29)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoded", scope: !853, file: !475, line: 110, type: !29)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "escaped_str", scope: !853, file: !475, line: 110, type: !29)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr_str", scope: !853, file: !475, line: 110, type: !29)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !853, file: !475, line: 110, type: !29)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !853, file: !475, line: 110, type: !29)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stdout_encoding_str", scope: !853, file: !475, line: 111, type: !76)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !853, file: !475, line: 112, type: !68)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !866, file: !475, line: 127, type: !29)
!866 = distinct !DILexicalBlock(scope: !853, file: !475, line: 127, column: 8)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !868, file: !475, line: 134, type: !29)
!868 = distinct !DILexicalBlock(scope: !869, file: !475, line: 134, column: 12)
!869 = distinct !DILexicalBlock(scope: !870, file: !475, line: 132, column: 17)
!870 = distinct !DILexicalBlock(scope: !853, file: !475, line: 132, column: 9)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !872, file: !475, line: 135, type: !29)
!872 = distinct !DILexicalBlock(scope: !869, file: !475, line: 135, column: 12)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !475, line: 138, type: !29)
!874 = distinct !DILexicalBlock(scope: !869, file: !475, line: 138, column: 12)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !876, file: !475, line: 145, type: !29)
!876 = distinct !DILexicalBlock(scope: !877, file: !475, line: 145, column: 12)
!877 = distinct !DILexicalBlock(scope: !870, file: !475, line: 140, column: 10)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !879, file: !475, line: 147, type: !29)
!879 = distinct !DILexicalBlock(scope: !880, file: !475, line: 147, column: 16)
!880 = distinct !DILexicalBlock(scope: !881, file: !475, line: 146, column: 60)
!881 = distinct !DILexicalBlock(scope: !877, file: !475, line: 146, column: 13)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !883, file: !475, line: 150, type: !29)
!883 = distinct !DILexicalBlock(scope: !877, file: !475, line: 150, column: 12)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !885, file: !475, line: 158, type: !29)
!885 = distinct !DILexicalBlock(scope: !853, file: !475, line: 158, column: 8)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !475, line: 158, type: !29)
!887 = distinct !DILexicalBlock(scope: !888, file: !475, line: 158, column: 107)
!888 = distinct !DILexicalBlock(scope: !885, file: !475, line: 158, column: 73)
!889 = !DISubprogram(name: "sys_exc_info", scope: !475, file: !475, line: 242, type: !151, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_exc_info, variables: !890)
!890 = !{!891, !892, !893, !894, !896, !897, !898}
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !889, file: !475, line: 242, type: !29)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !889, file: !475, line: 242, type: !29)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !889, file: !475, line: 244, type: !12)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !895, file: !475, line: 245, type: !491)
!895 = distinct !DILexicalBlock(scope: !889, file: !475, line: 245, column: 46)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !895, file: !475, line: 245, type: !114)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !895, file: !475, line: 245, type: !498)
