; ModuleID = 'irs-onlybc/textio.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !458, globals: !1773)
!1 = !DIFile(filename: "textio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !102, !50, !368, !386, !394, !405, !404, !409, !408, !412, !411, !413, !415, !417, !64, !56, !42, !419, !107, !22, !432, !433, !434, !446, !454, !456, !40}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "nldecoder_object", file: !13, line: 230, baseType: !14)
!13 = !DIFile(filename: "./Modules/_io/textio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 223, size: 320, align: 64, elements: !15)
!15 = !{!16, !363, !364, !365, !366, !367}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !14, file: !13, line: 224, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !51, !115, !120, !125, !126, !131, !183, !214, !226, !232, !233, !234, !236, !238, !269, !270, !271, !280, !281, !286, !287, !289, !291, !301, !311, !329, !330, !331, !333, !335, !336, !338, !343, !348, !353, !354, !355, !356, !357, !358, !359, !360, !362}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !50, !57, !56}
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 246, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!61 = !{!62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !90, !92, !96, !99, !101, !103, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 247, baseType: !56, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 252, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 253, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 254, baseType: !64, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 255, baseType: !64, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 256, baseType: !64, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 257, baseType: !64, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 258, baseType: !64, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 259, baseType: !64, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 261, baseType: !64, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 262, baseType: !64, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 263, baseType: !64, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 265, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 161, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !60, line: 162, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !60, line: 163, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !60, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 267, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 275, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 279, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 280, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 281, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 285, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 155, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 294, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 303, baseType: !102, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 304, baseType: !102, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 305, baseType: !102, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 306, baseType: !102, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 307, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 62, baseType: !109)
!108 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 311, baseType: !112, size: 160, align: 8, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!50, !50, !64}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !121, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !50, !64, !50}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !102, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !127, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!50, !50}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !135)
!135 = !{!136, !141, !142, !143, !144, !145, !150, !152, !153, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !134, file: !18, line: 241, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!50, !50, !50}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !134, file: !18, line: 242, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !134, file: !18, line: 243, baseType: !137, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !134, file: !18, line: 244, baseType: !137, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !134, file: !18, line: 245, baseType: !137, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !134, file: !18, line: 246, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!50, !50, !50, !50}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !134, file: !18, line: 247, baseType: !151, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !134, file: !18, line: 248, baseType: !151, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !134, file: !18, line: 249, baseType: !151, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !134, file: !18, line: 250, baseType: !155, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!56, !50}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !134, file: !18, line: 251, baseType: !151, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !134, file: !18, line: 252, baseType: !137, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !134, file: !18, line: 253, baseType: !137, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !134, file: !18, line: 254, baseType: !137, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !134, file: !18, line: 255, baseType: !137, size: 64, align: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !134, file: !18, line: 256, baseType: !137, size: 64, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !134, file: !18, line: 257, baseType: !151, size: 64, align: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !134, file: !18, line: 258, baseType: !102, size: 64, align: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !134, file: !18, line: 259, baseType: !151, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !134, file: !18, line: 261, baseType: !137, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !134, file: !18, line: 262, baseType: !137, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !134, file: !18, line: 263, baseType: !137, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !134, file: !18, line: 264, baseType: !137, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !134, file: !18, line: 265, baseType: !146, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !134, file: !18, line: 266, baseType: !137, size: 64, align: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !134, file: !18, line: 267, baseType: !137, size: 64, align: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !134, file: !18, line: 268, baseType: !137, size: 64, align: 64, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !134, file: !18, line: 269, baseType: !137, size: 64, align: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !134, file: !18, line: 270, baseType: !137, size: 64, align: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !134, file: !18, line: 272, baseType: !137, size: 64, align: 64, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !134, file: !18, line: 273, baseType: !137, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !134, file: !18, line: 274, baseType: !137, size: 64, align: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !134, file: !18, line: 275, baseType: !137, size: 64, align: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !134, file: !18, line: 277, baseType: !151, size: 64, align: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !184, size: 64, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199, !200, !201, !206, !207, !212, !213}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !186, file: !18, line: 281, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!22, !50}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !186, file: !18, line: 282, baseType: !137, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !186, file: !18, line: 283, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !50, !22}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !186, file: !18, line: 284, baseType: !195, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !186, file: !18, line: 285, baseType: !102, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !186, file: !18, line: 286, baseType: !202, size: 64, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!56, !50, !22, !50}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !186, file: !18, line: 287, baseType: !102, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !186, file: !18, line: 288, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!56, !50, !50}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !186, file: !18, line: 290, baseType: !137, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !186, file: !18, line: 291, baseType: !195, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !215, size: 64, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !217, file: !18, line: 295, baseType: !189, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !217, file: !18, line: 296, baseType: !137, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !217, file: !18, line: 297, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!56, !50, !50, !50}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !227, size: 64, align: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !50}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !146, size: 64, align: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !127, size: 64, align: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !235, size: 64, align: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !138)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !237, size: 64, align: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !223)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !239, size: 64, align: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !242)
!242 = !{!243, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !241, file: !18, line: 302, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!56, !50, !248, !56}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !18, line: 179, baseType: !102, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !250, file: !18, line: 180, baseType: !50, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !250, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !250, file: !18, line: 184, baseType: !56, size: 32, align: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !250, file: !18, line: 185, baseType: !56, size: 32, align: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !18, line: 186, baseType: !64, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !250, file: !18, line: 187, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !250, file: !18, line: 188, baseType: !260, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !250, file: !18, line: 189, baseType: !260, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !250, file: !18, line: 190, baseType: !102, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !241, file: !18, line: 303, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !50, !248}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !109, size: 64, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !272, size: 64, align: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!56, !50, !276, !102}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!56, !50, !102}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !155, size: 64, align: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !282, size: 64, align: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!50, !50, !50, !56}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !288, size: 64, align: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !290, size: 64, align: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !292, size: 64, align: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 40, size: 256, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 41, baseType: !40, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 42, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 18, baseType: !138)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 43, baseType: !56, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !302, size: 64, align: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !304, line: 18, size: 320, align: 64, elements: !305)
!304 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !304, line: 19, baseType: !64, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 20, baseType: !56, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !303, file: !304, line: 21, baseType: !22, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !304, line: 22, baseType: !56, size: 32, align: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !303, file: !304, line: 23, baseType: !64, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !312, size: 64, align: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !314, line: 11, size: 320, align: 64, elements: !315)
!314 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!315 = !{!316, !317, !322, !327, !328}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !314, line: 12, baseType: !64, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !313, file: !314, line: 13, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !314, line: 8, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!50, !50, !102}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !313, file: !314, line: 14, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !314, line: 9, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!56, !50, !50, !102}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !313, file: !314, line: 15, baseType: !64, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !313, file: !314, line: 16, baseType: !102, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !50, size: 64, align: 64, offset: 2112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !332, size: 64, align: 64, offset: 2176)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !147)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !334, size: 64, align: 64, offset: 2240)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !223)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !337, size: 64, align: 64, offset: 2368)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !223)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !339, size: 64, align: 64, offset: 2432)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!50, !30, !22}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !344, size: 64, align: 64, offset: 2496)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!50, !30, !50, !50}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !349, size: 64, align: 64, offset: 2560)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !102}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !155, size: 64, align: 64, offset: 2624)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !50, size: 64, align: 64, offset: 2688)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !50, size: 64, align: 64, offset: 2752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !50, size: 64, align: 64, offset: 2816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !50, size: 64, align: 64, offset: 2880)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !50, size: 64, align: 64, offset: 2944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !361, size: 32, align: 32, offset: 3072)
!361 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !14, file: !13, line: 225, baseType: !50, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !14, file: !13, line: 226, baseType: !50, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pendingcr", scope: !14, file: !13, line: 227, baseType: !56, size: 1, align: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !14, file: !13, line: 228, baseType: !56, size: 1, align: 32, offset: 257)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "seennl", scope: !14, file: !13, line: 229, baseType: !361, size: 3, align: 32, offset: 258)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375, !383}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !370, file: !4, line: 291, baseType: !17, size: 128, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !370, file: !4, line: 292, baseType: !22, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !370, file: !4, line: 293, baseType: !231, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !370, file: !4, line: 349, baseType: !376, size: 32, align: 32, offset: 256)
!376 = !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !4, line: 294, size: 32, align: 32, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !376, file: !4, line: 303, baseType: !361, size: 2, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !376, file: !4, line: 331, baseType: !361, size: 3, align: 32, offset: 2)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !376, file: !4, line: 336, baseType: !361, size: 1, align: 32, offset: 5)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !376, file: !4, line: 340, baseType: !361, size: 1, align: 32, offset: 6)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !376, file: !4, line: 345, baseType: !361, size: 1, align: 32, offset: 7)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !370, file: !4, line: 350, baseType: !384, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !108, line: 90, baseType: !56)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !389)
!389 = !{!390, !391, !392, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !388, file: !4, line: 357, baseType: !369, size: 384, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !388, file: !4, line: 358, baseType: !22, size: 64, align: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !388, file: !4, line: 360, baseType: !64, size: 64, align: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !388, file: !4, line: 361, baseType: !22, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !396, file: !4, line: 369, baseType: !387, size: 576, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !4, line: 375, baseType: !400, size: 64, align: 64, offset: 576)
!400 = !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !4, line: 370, size: 64, align: 64, elements: !401)
!401 = !{!402, !403, !407, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !400, file: !4, line: 371, baseType: !102, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !400, file: !4, line: 372, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !406)
!406 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !400, file: !4, line: 373, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !89)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !400, file: !4, line: 374, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !361)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !421, line: 253, baseType: !422)
!421 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!422 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !421, line: 246, size: 192, align: 64, elements: !423)
!423 = !{!424, !431}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !422, file: !421, line: 251, baseType: !425, size: 192, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !421, line: 247, size: 192, align: 64, elements: !426)
!426 = !{!427, !429, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !425, file: !421, line: 248, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !425, file: !421, line: 249, baseType: !428, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !425, file: !421, line: 250, baseType: !22, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !422, file: !421, line: 252, baseType: !432, size: 64, align: 64)
!432 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !436, line: 10, baseType: !437)
!436 = !DIFile(filename: "Include/longobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !438, line: 89, size: 256, align: 64, elements: !439)
!438 = !DIFile(filename: "Include/longintrepr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !437, file: !438, line: 90, baseType: !34, size: 192, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !437, file: !438, line: 91, baseType: !442, size: 32, align: 32, offset: 192)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 32, align: 32, elements: !94)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !438, line: 49, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !445, line: 51, baseType: !361)
!445 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !448, line: 41, baseType: !449)
!448 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!449 = !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 31, size: 320, align: 64, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !449, file: !448, line: 32, baseType: !34, size: 192, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !449, file: !448, line: 33, baseType: !231, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !449, file: !448, line: 34, baseType: !93, size: 8, align: 8, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!458 = !{!459, !519, !554, !557, !571, !575, !579, !583, !587, !591, !595, !606, !623, !636, !654, !660, !664, !670, !684, !692, !741, !806, !830, !881, !890, !910, !1015, !1021, !1039, !1096, !1108, !1115, !1170, !1232, !1238, !1243, !1256, !1296, !1300, !1304, !1308, !1312, !1316, !1320, !1401, !1419, !1428, !1435, !1513, !1519, !1527, !1531, !1536, !1540, !1544, !1552, !1737, !1741, !1745, !1749, !1753, !1757, !1761, !1765, !1769}
!459 = !DISubprogram(name: "_PyIncrementalNewlineDecoder_decode", scope: !13, file: !13, line: 298, type: !284, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @_PyIncrementalNewlineDecoder_decode, variables: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !470, !471, !472, !474, !479, !481, !483, !484, !485, !486, !487, !494, !498, !501, !505, !507, !508, !509, !510, !511, !515, !517}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !459, file: !13, line: 298, type: !50)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !459, file: !13, line: 299, type: !50)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "final", arg: 3, scope: !459, file: !13, line: 299, type: !56)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !459, file: !13, line: 301, type: !50)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output_len", scope: !459, file: !13, line: 302, type: !22)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !459, file: !13, line: 303, type: !11)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !468, file: !13, line: 327, type: !56)
!468 = distinct !DILexicalBlock(scope: !469, file: !13, line: 325, column: 55)
!469 = distinct !DILexicalBlock(scope: !459, file: !13, line: 325, column: 9)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modified", scope: !468, file: !13, line: 328, type: !50)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !468, file: !13, line: 329, type: !64)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !473, file: !13, line: 339, type: !50)
!473 = distinct !DILexicalBlock(scope: !468, file: !13, line: 339, column: 12)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modified", scope: !475, file: !13, line: 352, type: !50)
!475 = distinct !DILexicalBlock(scope: !476, file: !13, line: 351, column: 9)
!476 = distinct !DILexicalBlock(scope: !477, file: !13, line: 349, column: 13)
!477 = distinct !DILexicalBlock(scope: !478, file: !13, line: 348, column: 17)
!478 = distinct !DILexicalBlock(scope: !459, file: !13, line: 348, column: 9)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !13, line: 355, type: !50)
!480 = distinct !DILexicalBlock(scope: !475, file: !13, line: 355, column: 16)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_str", scope: !482, file: !13, line: 364, type: !102)
!482 = distinct !DILexicalBlock(scope: !459, file: !13, line: 363, column: 5)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !482, file: !13, line: 365, type: !22)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seennl", scope: !482, file: !13, line: 366, type: !56)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "only_lf", scope: !482, file: !13, line: 367, type: !56)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !482, file: !13, line: 368, type: !56)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !488, file: !13, line: 393, type: !22)
!488 = distinct !DILexicalBlock(scope: !489, file: !13, line: 392, column: 22)
!489 = distinct !DILexicalBlock(scope: !490, file: !13, line: 390, column: 21)
!490 = distinct !DILexicalBlock(scope: !491, file: !13, line: 389, column: 65)
!491 = distinct !DILexicalBlock(scope: !492, file: !13, line: 388, column: 17)
!492 = distinct !DILexicalBlock(scope: !493, file: !13, line: 384, column: 22)
!493 = distinct !DILexicalBlock(scope: !482, file: !13, line: 384, column: 13)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !495, file: !13, line: 395, type: !412)
!495 = distinct !DILexicalBlock(scope: !496, file: !13, line: 394, column: 30)
!496 = distinct !DILexicalBlock(scope: !497, file: !13, line: 394, column: 21)
!497 = distinct !DILexicalBlock(scope: !488, file: !13, line: 394, column: 21)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !499, file: !13, line: 413, type: !22)
!499 = distinct !DILexicalBlock(scope: !500, file: !13, line: 412, column: 36)
!500 = distinct !DILexicalBlock(scope: !493, file: !13, line: 412, column: 18)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !502, file: !13, line: 418, type: !412)
!502 = distinct !DILexicalBlock(scope: !503, file: !13, line: 417, column: 22)
!503 = distinct !DILexicalBlock(scope: !504, file: !13, line: 417, column: 13)
!504 = distinct !DILexicalBlock(scope: !499, file: !13, line: 417, column: 13)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "translated", scope: !506, file: !13, line: 442, type: !102)
!506 = distinct !DILexicalBlock(scope: !500, file: !13, line: 441, column: 14)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !506, file: !13, line: 443, type: !56)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_str", scope: !506, file: !13, line: 444, type: !102)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !506, file: !13, line: 445, type: !22)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !506, file: !13, line: 445, type: !22)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !512, file: !13, line: 459, type: !412)
!512 = distinct !DILexicalBlock(scope: !513, file: !13, line: 458, column: 22)
!513 = distinct !DILexicalBlock(scope: !514, file: !13, line: 458, column: 13)
!514 = distinct !DILexicalBlock(scope: !506, file: !13, line: 458, column: 13)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !516, file: !13, line: 482, type: !50)
!516 = distinct !DILexicalBlock(scope: !506, file: !13, line: 482, column: 16)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !518, file: !13, line: 494, type: !50)
!518 = distinct !DILexicalBlock(scope: !459, file: !13, line: 494, column: 8)
!519 = !DISubprogram(name: "_PyIO_find_line_ending", scope: !13, file: !13, line: 1681, type: !520, isLocal: false, isDefinition: true, scopeLine: 1684, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32, i32, %struct._object*, i32, i8*, i8*, i64*)* @_PyIO_find_line_ending, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!22, !56, !56, !50, !56, !64, !64, !260}
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !534, !537, !541, !543, !544, !547, !549, !550, !551, !553}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "translated", arg: 1, scope: !519, file: !13, line: 1682, type: !56)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "universal", arg: 2, scope: !519, file: !13, line: 1682, type: !56)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "readnl", arg: 3, scope: !519, file: !13, line: 1682, type: !50)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 4, scope: !519, file: !13, line: 1683, type: !56)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !519, file: !13, line: 1683, type: !64)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 6, scope: !519, file: !13, line: 1683, type: !64)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "consumed", arg: 7, scope: !519, file: !13, line: 1683, type: !260)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !519, file: !13, line: 1685, type: !22)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !532, file: !13, line: 1689, type: !64)
!532 = distinct !DILexicalBlock(scope: !533, file: !13, line: 1687, column: 21)
!533 = distinct !DILexicalBlock(scope: !519, file: !13, line: 1687, column: 9)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !535, file: !13, line: 1701, type: !64)
!535 = distinct !DILexicalBlock(scope: !536, file: !13, line: 1697, column: 25)
!536 = distinct !DILexicalBlock(scope: !533, file: !13, line: 1697, column: 14)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !538, file: !13, line: 1703, type: !412)
!538 = distinct !DILexicalBlock(scope: !539, file: !13, line: 1702, column: 18)
!539 = distinct !DILexicalBlock(scope: !540, file: !13, line: 1702, column: 9)
!540 = distinct !DILexicalBlock(scope: !535, file: !13, line: 1702, column: 9)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readnl_len", scope: !542, file: !13, line: 1726, type: !22)
!542 = distinct !DILexicalBlock(scope: !536, file: !13, line: 1724, column: 10)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nl", scope: !542, file: !13, line: 1727, type: !64)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !545, file: !13, line: 1731, type: !64)
!545 = distinct !DILexicalBlock(scope: !546, file: !13, line: 1730, column: 30)
!546 = distinct !DILexicalBlock(scope: !542, file: !13, line: 1730, column: 13)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !548, file: !13, line: 1738, type: !64)
!548 = distinct !DILexicalBlock(scope: !546, file: !13, line: 1737, column: 14)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !548, file: !13, line: 1739, type: !64)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !548, file: !13, line: 1740, type: !64)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !552, file: !13, line: 1744, type: !22)
!552 = distinct !DILexicalBlock(scope: !548, file: !13, line: 1743, column: 27)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !552, file: !13, line: 1745, type: !64)
!554 = !DISubprogram(name: "textiobase_detach", scope: !13, file: !13, line: 62, type: !129, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @textiobase_detach, variables: !555)
!555 = !{!556}
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !554, file: !13, line: 62, type: !50)
!557 = !DISubprogram(name: "_unsupported", scope: !13, file: !13, line: 46, type: !558, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_unsupported, variables: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{!50, !40}
!560 = !{!561, !562}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 1, scope: !557, file: !13, line: 46, type: !40)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !557, file: !13, line: 48, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !565, line: 135, baseType: !566)
!565 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!566 = !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 130, size: 192, align: 64, elements: !567)
!567 = !{!568, !569, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !566, file: !565, line: 131, baseType: !56, size: 32, align: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !566, file: !565, line: 132, baseType: !50, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !566, file: !565, line: 134, baseType: !50, size: 64, align: 64, offset: 128)
!571 = !DISubprogram(name: "textiobase_read", scope: !13, file: !13, line: 75, type: !139, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @textiobase_read, variables: !572)
!572 = !{!573, !574}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !571, file: !13, line: 75, type: !50)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !571, file: !13, line: 75, type: !50)
!575 = !DISubprogram(name: "textiobase_readline", scope: !13, file: !13, line: 87, type: !139, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @textiobase_readline, variables: !576)
!576 = !{!577, !578}
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !575, file: !13, line: 87, type: !50)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !575, file: !13, line: 87, type: !50)
!579 = !DISubprogram(name: "textiobase_write", scope: !13, file: !13, line: 99, type: !139, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @textiobase_write, variables: !580)
!580 = !{!581, !582}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !579, file: !13, line: 99, type: !50)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !579, file: !13, line: 99, type: !50)
!583 = !DISubprogram(name: "textiobase_encoding_get", scope: !13, file: !13, line: 111, type: !320, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @textiobase_encoding_get, variables: !584)
!584 = !{!585, !586}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !583, file: !13, line: 111, type: !50)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !583, file: !13, line: 111, type: !102)
!587 = !DISubprogram(name: "textiobase_newlines_get", scope: !13, file: !13, line: 125, type: !320, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @textiobase_newlines_get, variables: !588)
!588 = !{!589, !590}
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !587, file: !13, line: 125, type: !50)
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !587, file: !13, line: 125, type: !102)
!591 = !DISubprogram(name: "textiobase_errors_get", scope: !13, file: !13, line: 137, type: !320, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @textiobase_errors_get, variables: !592)
!592 = !{!593, !594}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !591, file: !13, line: 137, type: !50)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !591, file: !13, line: 137, type: !102)
!595 = !DISubprogram(name: "check_decoded", scope: !13, file: !13, line: 274, type: !157, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @check_decoded, variables: !596)
!596 = !{!597, !598, !602}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decoded", arg: 1, scope: !595, file: !13, line: 274, type: !50)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !13, line: 282, type: !50)
!599 = distinct !DILexicalBlock(scope: !600, file: !13, line: 282, column: 12)
!600 = distinct !DILexicalBlock(scope: !601, file: !13, line: 278, column: 82)
!601 = distinct !DILexicalBlock(scope: !595, file: !13, line: 278, column: 9)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !13, line: 286, type: !50)
!603 = distinct !DILexicalBlock(scope: !604, file: !13, line: 286, column: 12)
!604 = distinct !DILexicalBlock(scope: !605, file: !13, line: 285, column: 119)
!605 = distinct !DILexicalBlock(scope: !595, file: !13, line: 285, column: 9)
!606 = !DISubprogram(name: "incrementalnewlinedecoder_dealloc", scope: !13, file: !13, line: 266, type: !607, isLocal: true, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.nldecoder_object*)* @incrementalnewlinedecoder_dealloc, variables: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !11}
!609 = !{!610, !611, !613, !617, !619}
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !606, file: !13, line: 266, type: !11)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !612, file: !13, line: 268, type: !50)
!612 = distinct !DILexicalBlock(scope: !606, file: !13, line: 268, column: 8)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !13, line: 268, type: !50)
!614 = distinct !DILexicalBlock(scope: !615, file: !13, line: 268, column: 121)
!615 = distinct !DILexicalBlock(scope: !616, file: !13, line: 268, column: 86)
!616 = distinct !DILexicalBlock(scope: !612, file: !13, line: 268, column: 63)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !618, file: !13, line: 269, type: !50)
!618 = distinct !DILexicalBlock(scope: !606, file: !13, line: 269, column: 8)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !13, line: 269, type: !50)
!620 = distinct !DILexicalBlock(scope: !621, file: !13, line: 269, column: 119)
!621 = distinct !DILexicalBlock(scope: !622, file: !13, line: 269, column: 85)
!622 = distinct !DILexicalBlock(scope: !618, file: !13, line: 269, column: 62)
!623 = !DISubprogram(name: "incrementalnewlinedecoder_decode", scope: !13, file: !13, line: 499, type: !624, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*, %struct._object*)* @incrementalnewlinedecoder_decode, variables: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!50, !11, !50, !50}
!626 = !{!627, !628, !629, !630, !634, !635}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !623, file: !13, line: 499, type: !11)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !623, file: !13, line: 500, type: !50)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !623, file: !13, line: 500, type: !50)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !623, file: !13, line: 502, type: !631)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, align: 64, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 3)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !623, file: !13, line: 503, type: !50)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !623, file: !13, line: 504, type: !56)
!636 = !DISubprogram(name: "incrementalnewlinedecoder_getstate", scope: !13, file: !13, line: 513, type: !637, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*)* @incrementalnewlinedecoder_getstate, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!50, !11, !50}
!639 = !{!640, !641, !642, !643, !645, !648, !652}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !636, file: !13, line: 513, type: !11)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !636, file: !13, line: 513, type: !50)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !636, file: !13, line: 515, type: !50)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !636, file: !13, line: 516, type: !644)
!644 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !646, file: !13, line: 519, type: !50)
!646 = distinct !DILexicalBlock(scope: !647, file: !13, line: 518, column: 45)
!647 = distinct !DILexicalBlock(scope: !636, file: !13, line: 518, column: 9)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !649, file: !13, line: 524, type: !50)
!649 = distinct !DILexicalBlock(scope: !650, file: !13, line: 524, column: 16)
!650 = distinct !DILexicalBlock(scope: !651, file: !13, line: 523, column: 65)
!651 = distinct !DILexicalBlock(scope: !646, file: !13, line: 523, column: 13)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !653, file: !13, line: 528, type: !50)
!653 = distinct !DILexicalBlock(scope: !646, file: !13, line: 528, column: 12)
!654 = !DISubprogram(name: "incrementalnewlinedecoder_setstate", scope: !13, file: !13, line: 541, type: !637, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*)* @incrementalnewlinedecoder_setstate, variables: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !654, file: !13, line: 541, type: !11)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !654, file: !13, line: 541, type: !50)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !654, file: !13, line: 543, type: !50)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !654, file: !13, line: 544, type: !644)
!660 = !DISubprogram(name: "incrementalnewlinedecoder_reset", scope: !13, file: !13, line: 560, type: !637, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*)* @incrementalnewlinedecoder_reset, variables: !661)
!661 = !{!662, !663}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !660, file: !13, line: 560, type: !11)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !660, file: !13, line: 560, type: !50)
!664 = !DISubprogram(name: "incrementalnewlinedecoder_newlines_get", scope: !13, file: !13, line: 571, type: !665, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, i8*)* @incrementalnewlinedecoder_newlines_get, variables: !667)
!665 = !DISubroutineType(types: !666)
!666 = !{!50, !11, !102}
!667 = !{!668, !669}
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !664, file: !13, line: 571, type: !11)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !664, file: !13, line: 571, type: !102)
!670 = !DISubprogram(name: "incrementalnewlinedecoder_init", scope: !13, file: !13, line: 233, type: !671, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.nldecoder_object*, %struct._object*, %struct._object*)* @incrementalnewlinedecoder_init, variables: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!56, !11, !50, !50}
!673 = !{!674, !675, !676, !677, !678, !679, !680}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !670, file: !13, line: 233, type: !11)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !670, file: !13, line: 234, type: !50)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !670, file: !13, line: 234, type: !50)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !670, file: !13, line: 236, type: !50)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "translate", scope: !670, file: !13, line: 237, type: !56)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !670, file: !13, line: 238, type: !50)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !670, file: !13, line: 239, type: !681)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, align: 64, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 4)
!684 = !DISubprogram(name: "find_control_char", scope: !13, file: !13, line: 1663, type: !685, isLocal: true, isDefinition: true, scopeLine: 1664, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, i8*, i8*, i32)* @find_control_char, variables: !687)
!685 = !DISubroutineType(types: !686)
!686 = !{!64, !56, !64, !64, !412}
!687 = !{!688, !689, !690, !691}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 1, scope: !684, file: !13, line: 1663, type: !56)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !684, file: !13, line: 1663, type: !64)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !684, file: !13, line: 1663, type: !64)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 4, scope: !684, file: !13, line: 1663, type: !412)
!692 = !DISubprogram(name: "textiowrapper_dealloc", scope: !13, file: !13, line: 1150, type: !693, isLocal: true, isDefinition: true, scopeLine: 1151, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.textio*)* @textiowrapper_dealloc, variables: !731)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "textio", file: !13, line: 743, baseType: !697)
!697 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 686, size: 1536, align: 64, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !697, file: !13, line: 688, baseType: !17, size: 128, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !697, file: !13, line: 689, baseType: !56, size: 32, align: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !697, file: !13, line: 690, baseType: !56, size: 32, align: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !697, file: !13, line: 691, baseType: !22, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !697, file: !13, line: 692, baseType: !50, size: 64, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !697, file: !13, line: 693, baseType: !50, size: 64, align: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !697, file: !13, line: 694, baseType: !50, size: 64, align: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !697, file: !13, line: 695, baseType: !50, size: 64, align: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "readnl", scope: !697, file: !13, line: 696, baseType: !50, size: 64, align: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !697, file: !13, line: 697, baseType: !50, size: 64, align: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "writenl", scope: !697, file: !13, line: 698, baseType: !40, size: 64, align: 64, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "line_buffering", scope: !697, file: !13, line: 699, baseType: !42, size: 8, align: 8, offset: 704)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "write_through", scope: !697, file: !13, line: 700, baseType: !42, size: 8, align: 8, offset: 712)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "readuniversal", scope: !697, file: !13, line: 701, baseType: !42, size: 8, align: 8, offset: 720)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "readtranslate", scope: !697, file: !13, line: 702, baseType: !42, size: 8, align: 8, offset: 728)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "writetranslate", scope: !697, file: !13, line: 703, baseType: !42, size: 8, align: 8, offset: 736)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !697, file: !13, line: 704, baseType: !42, size: 8, align: 8, offset: 744)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "has_read1", scope: !697, file: !13, line: 705, baseType: !42, size: 8, align: 8, offset: 752)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "telling", scope: !697, file: !13, line: 706, baseType: !42, size: 8, align: 8, offset: 760)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !697, file: !13, line: 707, baseType: !42, size: 8, align: 8, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "encodefunc", scope: !697, file: !13, line: 709, baseType: !720, size: 64, align: 64, offset: 832)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "encodefunc_t", file: !13, line: 684, baseType: !138)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_start_of_stream", scope: !697, file: !13, line: 711, baseType: !42, size: 8, align: 8, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "decoded_chars", scope: !697, file: !13, line: 722, baseType: !50, size: 64, align: 64, offset: 960)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "decoded_chars_used", scope: !697, file: !13, line: 723, baseType: !22, size: 64, align: 64, offset: 1024)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pending_bytes", scope: !697, file: !13, line: 724, baseType: !50, size: 64, align: 64, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pending_bytes_count", scope: !697, file: !13, line: 726, baseType: !22, size: 64, align: 64, offset: 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "snapshot", scope: !697, file: !13, line: 733, baseType: !50, size: 64, align: 64, offset: 1216)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b2cratio", scope: !697, file: !13, line: 736, baseType: !432, size: 64, align: 64, offset: 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !697, file: !13, line: 739, baseType: !50, size: 64, align: 64, offset: 1344)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !697, file: !13, line: 741, baseType: !50, size: 64, align: 64, offset: 1408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !697, file: !13, line: 742, baseType: !50, size: 64, align: 64, offset: 1472)
!731 = !{!732, !733, !735, !737}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !692, file: !13, line: 1150, type: !695)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !734, file: !13, line: 1156, type: !419)
!734 = distinct !DILexicalBlock(scope: !692, file: !13, line: 1156, column: 8)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !736, file: !13, line: 1159, type: !50)
!736 = distinct !DILexicalBlock(scope: !692, file: !13, line: 1159, column: 8)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !13, line: 1159, type: !50)
!738 = distinct !DILexicalBlock(scope: !739, file: !13, line: 1159, column: 115)
!739 = distinct !DILexicalBlock(scope: !740, file: !13, line: 1159, column: 83)
!740 = distinct !DILexicalBlock(scope: !736, file: !13, line: 1159, column: 60)
!741 = !DISubprogram(name: "_textiowrapper_clear", scope: !13, file: !13, line: 1133, type: !742, isLocal: true, isDefinition: true, scopeLine: 1134, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.textio*)* @_textiowrapper_clear, variables: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{!56, !695}
!744 = !{!745, !746, !748, !752, !754, !758, !760, !764, !766, !770, !772, !776, !778, !782, !784, !788, !790, !794, !796, !800, !802}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !741, file: !13, line: 1133, type: !695)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !747, file: !13, line: 1136, type: !50)
!747 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1136, column: 8)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !749, file: !13, line: 1136, type: !50)
!749 = distinct !DILexicalBlock(scope: !750, file: !13, line: 1136, column: 119)
!750 = distinct !DILexicalBlock(scope: !751, file: !13, line: 1136, column: 85)
!751 = distinct !DILexicalBlock(scope: !747, file: !13, line: 1136, column: 62)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !753, file: !13, line: 1137, type: !50)
!753 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1137, column: 8)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !13, line: 1137, type: !50)
!755 = distinct !DILexicalBlock(scope: !756, file: !13, line: 1137, column: 123)
!756 = distinct !DILexicalBlock(scope: !757, file: !13, line: 1137, column: 87)
!757 = distinct !DILexicalBlock(scope: !753, file: !13, line: 1137, column: 64)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !759, file: !13, line: 1138, type: !50)
!759 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1138, column: 8)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !13, line: 1138, type: !50)
!761 = distinct !DILexicalBlock(scope: !762, file: !13, line: 1138, column: 121)
!762 = distinct !DILexicalBlock(scope: !763, file: !13, line: 1138, column: 86)
!763 = distinct !DILexicalBlock(scope: !759, file: !13, line: 1138, column: 63)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !765, file: !13, line: 1139, type: !50)
!765 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1139, column: 8)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !767, file: !13, line: 1139, type: !50)
!767 = distinct !DILexicalBlock(scope: !768, file: !13, line: 1139, column: 121)
!768 = distinct !DILexicalBlock(scope: !769, file: !13, line: 1139, column: 86)
!769 = distinct !DILexicalBlock(scope: !765, file: !13, line: 1139, column: 63)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !771, file: !13, line: 1140, type: !50)
!771 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1140, column: 8)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !773, file: !13, line: 1140, type: !50)
!773 = distinct !DILexicalBlock(scope: !774, file: !13, line: 1140, column: 119)
!774 = distinct !DILexicalBlock(scope: !775, file: !13, line: 1140, column: 85)
!775 = distinct !DILexicalBlock(scope: !771, file: !13, line: 1140, column: 62)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !777, file: !13, line: 1141, type: !50)
!777 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1141, column: 8)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !13, line: 1141, type: !50)
!779 = distinct !DILexicalBlock(scope: !780, file: !13, line: 1141, column: 133)
!780 = distinct !DILexicalBlock(scope: !781, file: !13, line: 1141, column: 92)
!781 = distinct !DILexicalBlock(scope: !777, file: !13, line: 1141, column: 69)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !783, file: !13, line: 1142, type: !50)
!783 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1142, column: 8)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !785, file: !13, line: 1142, type: !50)
!785 = distinct !DILexicalBlock(scope: !786, file: !13, line: 1142, column: 133)
!786 = distinct !DILexicalBlock(scope: !787, file: !13, line: 1142, column: 92)
!787 = distinct !DILexicalBlock(scope: !783, file: !13, line: 1142, column: 69)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !789, file: !13, line: 1143, type: !50)
!789 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1143, column: 8)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !791, file: !13, line: 1143, type: !50)
!791 = distinct !DILexicalBlock(scope: !792, file: !13, line: 1143, column: 123)
!792 = distinct !DILexicalBlock(scope: !793, file: !13, line: 1143, column: 87)
!793 = distinct !DILexicalBlock(scope: !789, file: !13, line: 1143, column: 64)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !795, file: !13, line: 1144, type: !50)
!795 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1144, column: 8)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !13, line: 1144, type: !50)
!797 = distinct !DILexicalBlock(scope: !798, file: !13, line: 1144, column: 119)
!798 = distinct !DILexicalBlock(scope: !799, file: !13, line: 1144, column: 85)
!799 = distinct !DILexicalBlock(scope: !795, file: !13, line: 1144, column: 62)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !801, file: !13, line: 1145, type: !50)
!801 = distinct !DILexicalBlock(scope: !741, file: !13, line: 1145, column: 8)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !13, line: 1145, type: !50)
!803 = distinct !DILexicalBlock(scope: !804, file: !13, line: 1145, column: 113)
!804 = distinct !DILexicalBlock(scope: !805, file: !13, line: 1145, column: 82)
!805 = distinct !DILexicalBlock(scope: !801, file: !13, line: 1145, column: 59)
!806 = !DISubprogram(name: "textiowrapper_repr", scope: !13, file: !13, line: 2469, type: !807, isLocal: true, isDefinition: true, scopeLine: 2470, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.textio*)* @textiowrapper_repr, variables: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!50, !695}
!809 = !{!810, !811, !812, !813, !814, !815, !819, !823, !825, !827}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !806, file: !13, line: 2469, type: !695)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !806, file: !13, line: 2471, type: !50)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modeobj", scope: !806, file: !13, line: 2471, type: !50)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !806, file: !13, line: 2471, type: !50)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !806, file: !13, line: 2471, type: !50)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !816, file: !13, line: 2487, type: !50)
!816 = distinct !DILexicalBlock(scope: !817, file: !13, line: 2487, column: 12)
!817 = distinct !DILexicalBlock(scope: !818, file: !13, line: 2485, column: 10)
!818 = distinct !DILexicalBlock(scope: !806, file: !13, line: 2479, column: 9)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !820, file: !13, line: 2503, type: !50)
!820 = distinct !DILexicalBlock(scope: !821, file: !13, line: 2503, column: 12)
!821 = distinct !DILexicalBlock(scope: !822, file: !13, line: 2501, column: 10)
!822 = distinct !DILexicalBlock(scope: !806, file: !13, line: 2495, column: 9)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !13, line: 2512, type: !50)
!824 = distinct !DILexicalBlock(scope: !806, file: !13, line: 2512, column: 8)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !826, file: !13, line: 2515, type: !50)
!826 = distinct !DILexicalBlock(scope: !806, file: !13, line: 2515, column: 8)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !828, file: !13, line: 2515, type: !50)
!828 = distinct !DILexicalBlock(scope: !829, file: !13, line: 2515, column: 95)
!829 = distinct !DILexicalBlock(scope: !826, file: !13, line: 2515, column: 61)
!830 = !DISubprogram(name: "textiowrapper_traverse", scope: !13, file: !13, line: 1164, type: !831, isLocal: true, isDefinition: true, scopeLine: 1165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.textio*, i32 (%struct._object*, i8*)*, i8*)* @textiowrapper_traverse, variables: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!56, !695, !276, !102}
!833 = !{!834, !835, !836, !837, !841, !845, !849, !853, !857, !861, !865, !869, !873, !877}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !830, file: !13, line: 1164, type: !695)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !830, file: !13, line: 1164, type: !276)
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !830, file: !13, line: 1164, type: !102)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !838, file: !13, line: 1166, type: !56)
!838 = distinct !DILexicalBlock(scope: !839, file: !13, line: 1166, column: 28)
!839 = distinct !DILexicalBlock(scope: !840, file: !13, line: 1166, column: 14)
!840 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1166, column: 8)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !842, file: !13, line: 1167, type: !56)
!842 = distinct !DILexicalBlock(scope: !843, file: !13, line: 1167, column: 30)
!843 = distinct !DILexicalBlock(scope: !844, file: !13, line: 1167, column: 14)
!844 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1167, column: 8)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !846, file: !13, line: 1168, type: !56)
!846 = distinct !DILexicalBlock(scope: !847, file: !13, line: 1168, column: 29)
!847 = distinct !DILexicalBlock(scope: !848, file: !13, line: 1168, column: 14)
!848 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1168, column: 8)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !850, file: !13, line: 1169, type: !56)
!850 = distinct !DILexicalBlock(scope: !851, file: !13, line: 1169, column: 29)
!851 = distinct !DILexicalBlock(scope: !852, file: !13, line: 1169, column: 14)
!852 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1169, column: 8)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !854, file: !13, line: 1170, type: !56)
!854 = distinct !DILexicalBlock(scope: !855, file: !13, line: 1170, column: 28)
!855 = distinct !DILexicalBlock(scope: !856, file: !13, line: 1170, column: 14)
!856 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1170, column: 8)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !858, file: !13, line: 1171, type: !56)
!858 = distinct !DILexicalBlock(scope: !859, file: !13, line: 1171, column: 35)
!859 = distinct !DILexicalBlock(scope: !860, file: !13, line: 1171, column: 14)
!860 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1171, column: 8)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !862, file: !13, line: 1172, type: !56)
!862 = distinct !DILexicalBlock(scope: !863, file: !13, line: 1172, column: 35)
!863 = distinct !DILexicalBlock(scope: !864, file: !13, line: 1172, column: 14)
!864 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1172, column: 8)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !866, file: !13, line: 1173, type: !56)
!866 = distinct !DILexicalBlock(scope: !867, file: !13, line: 1173, column: 30)
!867 = distinct !DILexicalBlock(scope: !868, file: !13, line: 1173, column: 14)
!868 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1173, column: 8)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !870, file: !13, line: 1174, type: !56)
!870 = distinct !DILexicalBlock(scope: !871, file: !13, line: 1174, column: 28)
!871 = distinct !DILexicalBlock(scope: !872, file: !13, line: 1174, column: 14)
!872 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1174, column: 8)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !874, file: !13, line: 1175, type: !56)
!874 = distinct !DILexicalBlock(scope: !875, file: !13, line: 1175, column: 25)
!875 = distinct !DILexicalBlock(scope: !876, file: !13, line: 1175, column: 14)
!876 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1175, column: 8)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !878, file: !13, line: 1177, type: !56)
!878 = distinct !DILexicalBlock(scope: !879, file: !13, line: 1177, column: 26)
!879 = distinct !DILexicalBlock(scope: !880, file: !13, line: 1177, column: 14)
!880 = distinct !DILexicalBlock(scope: !830, file: !13, line: 1177, column: 8)
!881 = !DISubprogram(name: "textiowrapper_clear", scope: !13, file: !13, line: 1182, type: !742, isLocal: true, isDefinition: true, scopeLine: 1183, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.textio*)* @textiowrapper_clear, variables: !882)
!882 = !{!883, !884, !886}
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !881, file: !13, line: 1182, type: !695)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !885, file: !13, line: 1186, type: !50)
!885 = distinct !DILexicalBlock(scope: !881, file: !13, line: 1186, column: 8)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !13, line: 1186, type: !50)
!887 = distinct !DILexicalBlock(scope: !888, file: !13, line: 1186, column: 115)
!888 = distinct !DILexicalBlock(scope: !889, file: !13, line: 1186, column: 83)
!889 = distinct !DILexicalBlock(scope: !885, file: !13, line: 1186, column: 60)
!890 = !DISubprogram(name: "textiowrapper_iternext", scope: !13, file: !13, line: 2630, type: !807, isLocal: true, isDefinition: true, scopeLine: 2631, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.textio*)* @textiowrapper_iternext, variables: !891)
!891 = !{!892, !893, !894, !900, !904, !906}
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !890, file: !13, line: 2630, type: !695)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !890, file: !13, line: 2632, type: !50)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !13, line: 2648, type: !50)
!895 = distinct !DILexicalBlock(scope: !896, file: !13, line: 2648, column: 16)
!896 = distinct !DILexicalBlock(scope: !897, file: !13, line: 2644, column: 91)
!897 = distinct !DILexicalBlock(scope: !898, file: !13, line: 2644, column: 13)
!898 = distinct !DILexicalBlock(scope: !899, file: !13, line: 2641, column: 10)
!899 = distinct !DILexicalBlock(scope: !890, file: !13, line: 2637, column: 9)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !13, line: 2658, type: !50)
!901 = distinct !DILexicalBlock(scope: !902, file: !13, line: 2658, column: 12)
!902 = distinct !DILexicalBlock(scope: !903, file: !13, line: 2656, column: 79)
!903 = distinct !DILexicalBlock(scope: !890, file: !13, line: 2656, column: 9)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !905, file: !13, line: 2659, type: !50)
!905 = distinct !DILexicalBlock(scope: !902, file: !13, line: 2659, column: 12)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !907, file: !13, line: 2659, type: !50)
!907 = distinct !DILexicalBlock(scope: !908, file: !13, line: 2659, column: 127)
!908 = distinct !DILexicalBlock(scope: !909, file: !13, line: 2659, column: 91)
!909 = distinct !DILexicalBlock(scope: !905, file: !13, line: 2659, column: 68)
!910 = !DISubprogram(name: "_textiowrapper_readline", scope: !13, file: !13, line: 1767, type: !911, isLocal: true, isDefinition: true, scopeLine: 1768, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.textio*, i64)* @_textiowrapper_readline, variables: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{!50, !695, !22}
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !926, !927, !933, !935, !936, !937, !938, !942, !946, !950, !954, !957, !961, !963, !965, !969, !974, !976, !980, !984, !988, !994, !996, !1000, !1002, !1005, !1007, !1010, !1012}
!914 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !910, file: !13, line: 1767, type: !695)
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 2, scope: !910, file: !13, line: 1767, type: !22)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !910, file: !13, line: 1769, type: !50)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunks", scope: !910, file: !13, line: 1769, type: !50)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "remaining", scope: !910, file: !13, line: 1769, type: !50)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !910, file: !13, line: 1770, type: !22)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endpos", scope: !910, file: !13, line: 1770, type: !22)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunked", scope: !910, file: !13, line: 1770, type: !22)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset_to_buffer", scope: !910, file: !13, line: 1770, type: !22)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !910, file: !13, line: 1771, type: !56)
!924 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !925, file: !13, line: 1773, type: !56)
!925 = distinct !DILexicalBlock(scope: !910, file: !13, line: 1773, column: 8)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_res", scope: !925, file: !13, line: 1773, type: !50)
!927 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !928, file: !13, line: 1773, type: !50)
!928 = distinct !DILexicalBlock(scope: !929, file: !13, line: 1773, column: 289)
!929 = distinct !DILexicalBlock(scope: !930, file: !13, line: 1773, column: 163)
