; ModuleID = 'programs_new/Python-new/timemodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!158 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!159 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!160 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!161 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!162 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!163 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!164 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!165 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!166 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!167 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!168 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!169 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!170 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!171 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!172 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!173 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!174 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!175 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!176 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!177 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!178 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!179 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!180 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!181 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!182 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!183 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!184 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!185 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!186 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!187 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!188 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!189 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!190 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!191 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!192 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!193 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!194 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!195 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!196 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!197 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!198 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!199 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!200 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!201 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!202 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!203 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!204 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!205 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!206 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!207 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!208 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!209 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!210 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!211 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!212 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!213 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!214 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!215 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!216 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!217 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!218 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!219 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!220 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!221 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!222 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!223 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!224 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!225 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!226 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!227 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!228 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!229 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!230 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!231 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!232 = !{!233, !234, !572, !573, !576, !246, !578, !588, !596, !598, !323, !600, !602, !258, !605}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !236, line: 109, baseType: !237)
!236 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !236, line: 105, size: 128, align: 64, elements: !238)
!238 = !{!239, !247}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !237, file: !236, line: 107, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !241, line: 177, baseType: !242)
!241 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !243, line: 102, baseType: !244)
!243 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !245, line: 181, baseType: !246)
!245 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!246 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !237, file: !236, line: 108, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !236, line: 334, size: 3200, align: 64, elements: !250)
!250 = !{!251, !257, !261, !262, !263, !268, !331, !336, !341, !342, !347, !399, !430, !442, !448, !449, !450, !452, !454, !485, !486, !487, !496, !497, !502, !503, !505, !507, !517, !520, !538, !539, !540, !542, !544, !545, !547, !552, !557, !562, !563, !564, !565, !566, !567, !568, !569, !571}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !249, file: !236, line: 335, baseType: !252, size: 192, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !236, line: 114, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 111, size: 192, align: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !253, file: !236, line: 112, baseType: !235, size: 128, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !253, file: !236, line: 113, baseType: !240, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !249, file: !236, line: 336, baseType: !258, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !249, file: !236, line: 337, baseType: !240, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !249, file: !236, line: 337, baseType: !240, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !249, file: !236, line: 341, baseType: !264, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !236, line: 308, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !234}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !249, file: !236, line: 342, baseType: !269, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !236, line: 314, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !234, !274, !273}
!273 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !243, line: 48, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !277, line: 246, size: 1728, align: 64, elements: !278)
!277 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!278 = !{!279, !280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !300, !301, !302, !303, !305, !307, !309, !313, !316, !318, !319, !320, !321, !322, !326, !327}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !276, file: !277, line: 247, baseType: !273, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !276, file: !277, line: 252, baseType: !281, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !276, file: !277, line: 253, baseType: !281, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !276, file: !277, line: 254, baseType: !281, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !276, file: !277, line: 255, baseType: !281, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !276, file: !277, line: 256, baseType: !281, size: 64, align: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !276, file: !277, line: 257, baseType: !281, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !276, file: !277, line: 258, baseType: !281, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !276, file: !277, line: 259, baseType: !281, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !276, file: !277, line: 261, baseType: !281, size: 64, align: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !276, file: !277, line: 262, baseType: !281, size: 64, align: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !276, file: !277, line: 263, baseType: !281, size: 64, align: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !276, file: !277, line: 265, baseType: !293, size: 64, align: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !277, line: 161, size: 192, align: 64, elements: !295)
!295 = !{!296, !297, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !294, file: !277, line: 162, baseType: !293, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !294, file: !277, line: 163, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !294, file: !277, line: 167, baseType: !273, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !276, file: !277, line: 267, baseType: !298, size: 64, align: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !276, file: !277, line: 269, baseType: !273, size: 32, align: 32, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !276, file: !277, line: 273, baseType: !273, size: 32, align: 32, offset: 928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !276, file: !277, line: 275, baseType: !304, size: 64, align: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !245, line: 140, baseType: !246)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !276, file: !277, line: 279, baseType: !306, size: 16, align: 16, offset: 1024)
!306 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !276, file: !277, line: 280, baseType: !308, size: 8, align: 8, offset: 1040)
!308 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !276, file: !277, line: 281, baseType: !310, size: 8, align: 8, offset: 1048)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 8, align: 8, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !276, file: !277, line: 285, baseType: !314, size: 64, align: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !277, line: 155, baseType: null)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !276, file: !277, line: 294, baseType: !317, size: 64, align: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !245, line: 141, baseType: !246)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !276, file: !277, line: 303, baseType: !233, size: 64, align: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !276, file: !277, line: 304, baseType: !233, size: 64, align: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !276, file: !277, line: 305, baseType: !233, size: 64, align: 64, offset: 1344)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !276, file: !277, line: 306, baseType: !233, size: 64, align: 64, offset: 1408)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !276, file: !277, line: 307, baseType: !323, size: 64, align: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !324, line: 62, baseType: !325)
!324 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!325 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !276, file: !277, line: 309, baseType: !273, size: 32, align: 32, offset: 1536)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !276, file: !277, line: 311, baseType: !328, size: 160, align: 8, offset: 1568)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 160, align: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 20)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !249, file: !236, line: 343, baseType: !332, size: 64, align: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !236, line: 316, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!234, !234, !281}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !249, file: !236, line: 344, baseType: !337, size: 64, align: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !236, line: 318, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!273, !234, !281, !234}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !249, file: !236, line: 345, baseType: !233, size: 64, align: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !249, file: !236, line: 346, baseType: !343, size: 64, align: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !236, line: 320, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!234, !234}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !249, file: !236, line: 350, baseType: !348, size: 64, align: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !236, line: 278, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 236, size: 2176, align: 64, elements: !351)
!351 = !{!352, !357, !358, !359, !360, !361, !366, !368, !369, !370, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !350, file: !236, line: 241, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !236, line: 166, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!234, !234, !234}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !350, file: !236, line: 242, baseType: !353, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !350, file: !236, line: 243, baseType: !353, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !350, file: !236, line: 244, baseType: !353, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !350, file: !236, line: 245, baseType: !353, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !350, file: !236, line: 246, baseType: !362, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !236, line: 167, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!234, !234, !234, !234}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !350, file: !236, line: 247, baseType: !367, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !236, line: 165, baseType: !344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !350, file: !236, line: 248, baseType: !367, size: 64, align: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !350, file: !236, line: 249, baseType: !367, size: 64, align: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !350, file: !236, line: 250, baseType: !371, size: 64, align: 64, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !236, line: 168, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!273, !234}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !350, file: !236, line: 251, baseType: !367, size: 64, align: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !350, file: !236, line: 252, baseType: !353, size: 64, align: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !350, file: !236, line: 253, baseType: !353, size: 64, align: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !350, file: !236, line: 254, baseType: !353, size: 64, align: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !350, file: !236, line: 255, baseType: !353, size: 64, align: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !350, file: !236, line: 256, baseType: !353, size: 64, align: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !350, file: !236, line: 257, baseType: !367, size: 64, align: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !350, file: !236, line: 258, baseType: !233, size: 64, align: 64, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !350, file: !236, line: 259, baseType: !367, size: 64, align: 64, offset: 1152)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !350, file: !236, line: 261, baseType: !353, size: 64, align: 64, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !350, file: !236, line: 262, baseType: !353, size: 64, align: 64, offset: 1280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !350, file: !236, line: 263, baseType: !353, size: 64, align: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !350, file: !236, line: 264, baseType: !353, size: 64, align: 64, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !350, file: !236, line: 265, baseType: !362, size: 64, align: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !350, file: !236, line: 266, baseType: !353, size: 64, align: 64, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !350, file: !236, line: 267, baseType: !353, size: 64, align: 64, offset: 1600)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !350, file: !236, line: 268, baseType: !353, size: 64, align: 64, offset: 1664)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !350, file: !236, line: 269, baseType: !353, size: 64, align: 64, offset: 1728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !350, file: !236, line: 270, baseType: !353, size: 64, align: 64, offset: 1792)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !350, file: !236, line: 272, baseType: !353, size: 64, align: 64, offset: 1856)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !350, file: !236, line: 273, baseType: !353, size: 64, align: 64, offset: 1920)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !350, file: !236, line: 274, baseType: !353, size: 64, align: 64, offset: 1984)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !350, file: !236, line: 275, baseType: !353, size: 64, align: 64, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !350, file: !236, line: 277, baseType: !367, size: 64, align: 64, offset: 2112)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !249, file: !236, line: 351, baseType: !400, size: 64, align: 64, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !236, line: 292, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 280, size: 640, align: 64, elements: !403)
!403 = !{!404, !409, !410, !415, !416, !417, !422, !423, !428, !429}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !402, file: !236, line: 281, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !236, line: 169, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!240, !234}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !402, file: !236, line: 282, baseType: !353, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !402, file: !236, line: 283, baseType: !411, size: 64, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !236, line: 170, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!234, !234, !240}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !402, file: !236, line: 284, baseType: !411, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !402, file: !236, line: 285, baseType: !233, size: 64, align: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !402, file: !236, line: 286, baseType: !418, size: 64, align: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !236, line: 172, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!273, !234, !240, !234}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !402, file: !236, line: 287, baseType: !233, size: 64, align: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !402, file: !236, line: 288, baseType: !424, size: 64, align: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !236, line: 231, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!273, !234, !234}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !402, file: !236, line: 290, baseType: !353, size: 64, align: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !402, file: !236, line: 291, baseType: !411, size: 64, align: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !249, file: !236, line: 352, baseType: !431, size: 64, align: 64, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !236, line: 298, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 294, size: 192, align: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !433, file: !236, line: 295, baseType: !405, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !433, file: !236, line: 296, baseType: !353, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !433, file: !236, line: 297, baseType: !438, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !236, line: 174, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!273, !234, !234, !234}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !249, file: !236, line: 356, baseType: !443, size: 64, align: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !236, line: 321, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !234}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !241, line: 186, baseType: !240)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !249, file: !236, line: 357, baseType: !362, size: 64, align: 64, offset: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !249, file: !236, line: 358, baseType: !343, size: 64, align: 64, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !249, file: !236, line: 359, baseType: !451, size: 64, align: 64, offset: 1152)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !236, line: 317, baseType: !354)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !249, file: !236, line: 360, baseType: !453, size: 64, align: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !236, line: 319, baseType: !439)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !249, file: !236, line: 363, baseType: !455, size: 64, align: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !236, line: 304, baseType: !457)
!457 = !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 301, size: 128, align: 64, elements: !458)
!458 = !{!459, !480}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !457, file: !236, line: 302, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !236, line: 193, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!273, !234, !464, !273}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !236, line: 191, baseType: !466)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !236, line: 178, size: 640, align: 64, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !477, !478, !479}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !466, file: !236, line: 179, baseType: !233, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !466, file: !236, line: 180, baseType: !234, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !466, file: !236, line: 181, baseType: !240, size: 64, align: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !466, file: !236, line: 182, baseType: !240, size: 64, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !466, file: !236, line: 184, baseType: !273, size: 32, align: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !466, file: !236, line: 185, baseType: !273, size: 32, align: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !466, file: !236, line: 186, baseType: !281, size: 64, align: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !466, file: !236, line: 187, baseType: !476, size: 64, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !466, file: !236, line: 188, baseType: !476, size: 64, align: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !466, file: !236, line: 189, baseType: !476, size: 64, align: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !466, file: !236, line: 190, baseType: !233, size: 64, align: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !457, file: !236, line: 303, baseType: !481, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !236, line: 194, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !234, !464}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !249, file: !236, line: 366, baseType: !325, size: 64, align: 64, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !249, file: !236, line: 368, baseType: !258, size: 64, align: 64, offset: 1408)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !249, file: !236, line: 372, baseType: !488, size: 64, align: 64, offset: 1472)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !236, line: 233, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!273, !234, !492, !233}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !236, line: 232, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!273, !234, !233}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !249, file: !236, line: 375, baseType: !371, size: 64, align: 64, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !249, file: !236, line: 379, baseType: !498, size: 64, align: 64, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !236, line: 322, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!234, !234, !234, !273}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !249, file: !236, line: 382, baseType: !240, size: 64, align: 64, offset: 1664)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !249, file: !236, line: 385, baseType: !504, size: 64, align: 64, offset: 1728)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !236, line: 323, baseType: !344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !249, file: !236, line: 386, baseType: !506, size: 64, align: 64, offset: 1792)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !236, line: 324, baseType: !344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !249, file: !236, line: 389, baseType: !508, size: 64, align: 64, offset: 1856)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !510, line: 40, size: 256, align: 64, elements: !511)
!510 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!511 = !{!512, !513, !515, !516}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !509, file: !510, line: 41, baseType: !258, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !509, file: !510, line: 42, baseType: !514, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !510, line: 18, baseType: !354)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !509, file: !510, line: 43, baseType: !273, size: 32, align: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !509, file: !510, line: 45, baseType: !258, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !249, file: !236, line: 390, baseType: !518, size: 64, align: 64, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !236, line: 390, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !249, file: !236, line: 391, baseType: !521, size: 64, align: 64, offset: 1984)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !523, line: 11, size: 320, align: 64, elements: !524)
!523 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!524 = !{!525, !526, !531, !536, !537}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !523, line: 12, baseType: !281, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !522, file: !523, line: 13, baseType: !527, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !523, line: 8, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!234, !234, !233}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !522, file: !523, line: 14, baseType: !532, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !523, line: 9, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!273, !234, !234, !233}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !522, file: !523, line: 15, baseType: !281, size: 64, align: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !522, file: !523, line: 16, baseType: !233, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !249, file: !236, line: 392, baseType: !248, size: 64, align: 64, offset: 2048)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !249, file: !236, line: 393, baseType: !234, size: 64, align: 64, offset: 2112)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !249, file: !236, line: 394, baseType: !541, size: 64, align: 64, offset: 2176)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !236, line: 325, baseType: !363)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !249, file: !236, line: 395, baseType: !543, size: 64, align: 64, offset: 2240)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !236, line: 326, baseType: !439)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !249, file: !236, line: 396, baseType: !240, size: 64, align: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !249, file: !236, line: 397, baseType: !546, size: 64, align: 64, offset: 2368)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !236, line: 327, baseType: !439)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !249, file: !236, line: 398, baseType: !548, size: 64, align: 64, offset: 2432)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !236, line: 329, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!234, !248, !240}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !249, file: !236, line: 399, baseType: !553, size: 64, align: 64, offset: 2496)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !236, line: 328, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!234, !248, !234, !234}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !249, file: !236, line: 400, baseType: !558, size: 64, align: 64, offset: 2560)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !236, line: 307, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !233}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !249, file: !236, line: 401, baseType: !371, size: 64, align: 64, offset: 2624)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !249, file: !236, line: 402, baseType: !234, size: 64, align: 64, offset: 2688)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !249, file: !236, line: 403, baseType: !234, size: 64, align: 64, offset: 2752)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !249, file: !236, line: 404, baseType: !234, size: 64, align: 64, offset: 2816)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !249, file: !236, line: 405, baseType: !234, size: 64, align: 64, offset: 2880)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !249, file: !236, line: 406, baseType: !234, size: 64, align: 64, offset: 2944)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !249, file: !236, line: 407, baseType: !264, size: 64, align: 64, offset: 3008)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !249, file: !236, line: 410, baseType: !570, size: 32, align: 32, offset: 3072)
!570 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !249, file: !236, line: 412, baseType: !264, size: 64, align: 64, offset: 3136)
!572 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !574, line: 59, baseType: !575)
!574 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !245, line: 144, baseType: !246)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !574, line: 91, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clockid_t", file: !245, line: 156, baseType: !273)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !580, line: 75, baseType: !581)
!580 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!581 = !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 64, size: 1024, align: 64, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !581, file: !580, line: 69, baseType: !584, size: 1024, align: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1024, align: 64, elements: !586)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !580, line: 54, baseType: !246)
!586 = !{!587}
!587 = !DISubrange(count: 16)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !590, line: 33, baseType: !591)
!590 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!591 = !DICompositeType(tag: DW_TAG_structure_type, file: !590, line: 25, size: 256, align: 64, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !591, file: !590, line: 26, baseType: !252, size: 192, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !591, file: !590, line: 27, baseType: !595, size: 64, align: 64, offset: 192)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 64, align: 64, elements: !311)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !574, line: 75, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !245, line: 148, baseType: !246)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !324, line: 90, baseType: !273)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!606 = !{!607, !613, !617, !650, !654, !657, !661, !668, !678, !685, !690, !758, !779, !788, !801, !807, !814, !823, !833, !838, !841, !847, !853, !872, !880, !887, !891, !901, !905, !1005, !1009, !1013, !1092}
!607 = !DISubprogram(name: "PyInit_time", scope: !608, file: !608, line: 1499, type: !609, isLocal: false, isDefinition: true, scopeLine: 1500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_time, variables: !611)
!608 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/timemodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!609 = !DISubroutineType(types: !610)
!610 = !{!234}
!611 = !{!612}
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !607, file: !608, line: 1501, type: !234)
!613 = !DISubprogram(name: "time_time", scope: !608, file: !608, line: 53, type: !355, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_time, variables: !614)
!614 = !{!615, !616}
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !613, file: !608, line: 53, type: !234)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !613, file: !608, line: 53, type: !234)
!617 = !DISubprogram(name: "floattime", scope: !608, file: !608, line: 1535, type: !618, isLocal: true, isDefinition: true, scopeLine: 1536, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_clock_info_t*)* @floattime, variables: !628)
!618 = !DISubroutineType(types: !619)
!619 = !{!234, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_clock_info_t", file: !4, line: 31, baseType: !622)
!622 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 26, size: 192, align: 64, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !622, file: !4, line: 27, baseType: !258, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "monotonic", scope: !622, file: !4, line: 28, baseType: !273, size: 32, align: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "adjustable", scope: !622, file: !4, line: 29, baseType: !273, size: 32, align: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !622, file: !4, line: 30, baseType: !572, size: 64, align: 64, offset: 128)
!628 = !{!629, !630, !638, !644, !645}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !617, file: !608, line: 1535, type: !620)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !617, file: !608, line: 1537, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyTime_timeval", file: !4, line: 17, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !633, line: 30, size: 128, align: 64, elements: !634)
!633 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !632, file: !633, line: 32, baseType: !597, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !632, file: !633, line: 33, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !245, line: 150, baseType: !246)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !617, file: !608, line: 1539, type: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !574, line: 120, size: 128, align: 64, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !639, file: !574, line: 122, baseType: !597, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !639, file: !574, line: 123, baseType: !643, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !245, line: 184, baseType: !246)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !617, file: !608, line: 1540, type: !273)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !646, file: !608, line: 1548, type: !639)
!646 = distinct !DILexicalBlock(scope: !647, file: !608, line: 1547, column: 19)
!647 = distinct !DILexicalBlock(scope: !648, file: !608, line: 1547, column: 13)
!648 = distinct !DILexicalBlock(scope: !649, file: !608, line: 1546, column: 19)
!649 = distinct !DILexicalBlock(scope: !617, file: !608, line: 1546, column: 9)
!650 = !DISubprogram(name: "time_clock", scope: !608, file: !608, line: 146, type: !355, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_clock, variables: !651)
!651 = !{!652, !653}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !650, file: !608, line: 146, type: !234)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !650, file: !608, line: 146, type: !234)
!654 = !DISubprogram(name: "pyclock", scope: !608, file: !608, line: 135, type: !618, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_clock_info_t*)* @pyclock, variables: !655)
!655 = !{!656}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !654, file: !608, line: 135, type: !620)
!657 = !DISubprogram(name: "floatclock", scope: !608, file: !608, line: 75, type: !618, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_clock_info_t*)* @floatclock, variables: !658)
!658 = !{!659, !660}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !657, file: !608, line: 75, type: !620)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !657, file: !608, line: 77, type: !573)
!661 = !DISubprogram(name: "time_clock_gettime", scope: !608, file: !608, line: 161, type: !355, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_clock_gettime, variables: !662)
!662 = !{!663, !664, !665, !666, !667}
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !661, file: !608, line: 161, type: !234)
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !661, file: !608, line: 161, type: !234)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !661, file: !608, line: 163, type: !273)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clk_id", scope: !661, file: !608, line: 164, type: !273)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !661, file: !608, line: 165, type: !639)
!668 = !DISubprogram(name: "time_clock_settime", scope: !608, file: !608, line: 184, type: !355, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_clock_settime, variables: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !668, file: !608, line: 184, type: !234)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !668, file: !608, line: 184, type: !234)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clk_id", scope: !668, file: !608, line: 186, type: !273)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !668, file: !608, line: 187, type: !234)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tv_sec", scope: !668, file: !608, line: 188, type: !596)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tv_nsec", scope: !668, file: !608, line: 189, type: !246)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !668, file: !608, line: 190, type: !639)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !668, file: !608, line: 191, type: !273)
!678 = !DISubprogram(name: "time_clock_getres", scope: !608, file: !608, line: 215, type: !355, isLocal: true, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_clock_getres, variables: !679)
!679 = !{!680, !681, !682, !683, !684}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !678, file: !608, line: 215, type: !234)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !678, file: !608, line: 215, type: !234)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !678, file: !608, line: 217, type: !273)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clk_id", scope: !678, file: !608, line: 218, type: !273)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !678, file: !608, line: 219, type: !639)
!685 = !DISubprogram(name: "time_sleep", scope: !608, file: !608, line: 240, type: !355, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_sleep, variables: !686)
!686 = !{!687, !688, !689}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !685, file: !608, line: 240, type: !234)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !685, file: !608, line: 240, type: !234)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "secs", scope: !685, file: !608, line: 242, type: !572)
!690 = !DISubprogram(name: "floatsleep", scope: !608, file: !608, line: 1570, type: !691, isLocal: true, isDefinition: true, scopeLine: 1571, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @floatsleep, variables: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{!273, !572}
!693 = !{!694, !695, !696, !697, !698}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "secs", arg: 1, scope: !690, file: !608, line: 1570, type: !572)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !690, file: !608, line: 1574, type: !632)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frac", scope: !690, file: !608, line: 1575, type: !572)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !690, file: !608, line: 1576, type: !273)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !699, file: !608, line: 1582, type: !700)
!699 = distinct !DILexicalBlock(scope: !690, file: !608, line: 1582, column: 5)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !702, line: 139, baseType: !703)
!702 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !702, line: 69, size: 1536, align: 64, elements: !704)
!704 = !{!705, !707, !708, !728, !731, !732, !733, !734, !735, !736, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !703, file: !702, line: 72, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !702, line: 73, baseType: !706, size: 64, align: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !703, file: !702, line: 74, baseType: !709, size: 64, align: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !702, line: 44, baseType: !711)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !702, line: 19, size: 832, align: 64, elements: !712)
!712 = !{!713, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !702, line: 21, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !711, file: !702, line: 22, baseType: !706, size: 64, align: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !711, file: !702, line: 24, baseType: !234, size: 64, align: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !711, file: !702, line: 25, baseType: !234, size: 64, align: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !711, file: !702, line: 26, baseType: !234, size: 64, align: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !711, file: !702, line: 27, baseType: !234, size: 64, align: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !711, file: !702, line: 28, baseType: !234, size: 64, align: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !711, file: !702, line: 30, baseType: !234, size: 64, align: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !711, file: !702, line: 31, baseType: !234, size: 64, align: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !711, file: !702, line: 32, baseType: !234, size: 64, align: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !711, file: !702, line: 33, baseType: !273, size: 32, align: 32, offset: 640)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !711, file: !702, line: 34, baseType: !273, size: 32, align: 32, offset: 672)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !711, file: !702, line: 37, baseType: !273, size: 32, align: 32, offset: 704)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !711, file: !702, line: 43, baseType: !234, size: 64, align: 64, offset: 768)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !703, file: !702, line: 76, baseType: !729, size: 64, align: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !702, line: 50, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !703, file: !702, line: 77, baseType: !273, size: 32, align: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !703, file: !702, line: 78, baseType: !260, size: 8, align: 8, offset: 288)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !703, file: !702, line: 80, baseType: !260, size: 8, align: 8, offset: 296)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !703, file: !702, line: 85, baseType: !273, size: 32, align: 32, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !703, file: !702, line: 86, baseType: !273, size: 32, align: 32, offset: 352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !703, file: !702, line: 88, baseType: !737, size: 64, align: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !702, line: 54, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!273, !234, !729, !273, !234}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !703, file: !702, line: 89, baseType: !737, size: 64, align: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !703, file: !702, line: 90, baseType: !234, size: 64, align: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !703, file: !702, line: 91, baseType: !234, size: 64, align: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !703, file: !702, line: 93, baseType: !234, size: 64, align: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !703, file: !702, line: 94, baseType: !234, size: 64, align: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !703, file: !702, line: 95, baseType: !234, size: 64, align: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !703, file: !702, line: 97, baseType: !234, size: 64, align: 64, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !703, file: !702, line: 98, baseType: !234, size: 64, align: 64, offset: 896)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !703, file: !702, line: 99, baseType: !234, size: 64, align: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !703, file: !702, line: 101, baseType: !234, size: 64, align: 64, offset: 1024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !703, file: !702, line: 103, baseType: !273, size: 32, align: 32, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !703, file: !702, line: 105, baseType: !234, size: 64, align: 64, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !703, file: !702, line: 106, baseType: !246, size: 64, align: 64, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !703, file: !702, line: 108, baseType: !273, size: 32, align: 32, offset: 1280)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !703, file: !702, line: 109, baseType: !234, size: 64, align: 64, offset: 1344)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !703, file: !702, line: 134, baseType: !559, size: 64, align: 64, offset: 1408)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !703, file: !702, line: 135, baseType: !233, size: 64, align: 64, offset: 1472)
!758 = !DISubprogram(name: "time_gmtime", scope: !608, file: !608, line: 352, type: !355, isLocal: true, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_gmtime, variables: !759)
!759 = !{!760, !761, !762, !763, !777}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !758, file: !608, line: 352, type: !234)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !758, file: !608, line: 352, type: !234)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "when", scope: !758, file: !608, line: 354, type: !596)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !758, file: !608, line: 355, type: !764)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !574, line: 133, size: 448, align: 64, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !764, file: !574, line: 135, baseType: !273, size: 32, align: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !764, file: !574, line: 136, baseType: !273, size: 32, align: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !764, file: !574, line: 137, baseType: !273, size: 32, align: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !764, file: !574, line: 138, baseType: !273, size: 32, align: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !764, file: !574, line: 139, baseType: !273, size: 32, align: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !764, file: !574, line: 140, baseType: !273, size: 32, align: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !764, file: !574, line: 141, baseType: !273, size: 32, align: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !764, file: !574, line: 142, baseType: !273, size: 32, align: 32, offset: 224)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !764, file: !574, line: 143, baseType: !273, size: 32, align: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !764, file: !574, line: 146, baseType: !246, size: 64, align: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !764, file: !574, line: 147, baseType: !258, size: 64, align: 64, offset: 384)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local", scope: !758, file: !608, line: 355, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!779 = !DISubprogram(name: "parse_time_t_args", scope: !608, file: !608, line: 333, type: !780, isLocal: true, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, i64*)* @parse_time_t_args, variables: !782)
!780 = !DISubroutineType(types: !781)
!781 = !{!273, !234, !281, !605}
!782 = !{!783, !784, !785, !786, !787}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !779, file: !608, line: 333, type: !234)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !779, file: !608, line: 333, type: !281)
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pwhen", arg: 3, scope: !779, file: !608, line: 333, type: !605)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ot", scope: !779, file: !608, line: 335, type: !234)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whent", scope: !779, file: !608, line: 336, type: !596)
!788 = !DISubprogram(name: "tmtotuple", scope: !608, file: !608, line: 297, type: !789, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.tm*)* @tmtotuple, variables: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!234, !778}
!791 = !{!792, !793, !794, !798}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !788, file: !608, line: 297, type: !778)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !788, file: !608, line: 299, type: !234)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !795, file: !608, line: 321, type: !234)
!795 = distinct !DILexicalBlock(scope: !796, file: !608, line: 321, column: 12)
!796 = distinct !DILexicalBlock(scope: !797, file: !608, line: 320, column: 27)
!797 = distinct !DILexicalBlock(scope: !788, file: !608, line: 320, column: 9)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !608, line: 321, type: !234)
!799 = distinct !DILexicalBlock(scope: !800, file: !608, line: 321, column: 97)
!800 = distinct !DILexicalBlock(scope: !795, file: !608, line: 321, column: 63)
!801 = !DISubprogram(name: "time_localtime", scope: !608, file: !608, line: 404, type: !355, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_localtime, variables: !802)
!802 = !{!803, !804, !805, !806}
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !801, file: !608, line: 404, type: !234)
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !801, file: !608, line: 404, type: !234)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "when", scope: !801, file: !608, line: 406, type: !596)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !801, file: !608, line: 407, type: !764)
!807 = !DISubprogram(name: "pylocaltime", scope: !608, file: !608, line: 384, type: !808, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64*, %struct.tm*)* @pylocaltime, variables: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!273, !605, !778}
!810 = !{!811, !812, !813}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timep", arg: 1, scope: !807, file: !608, line: 384, type: !605)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 2, scope: !807, file: !608, line: 384, type: !778)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local", scope: !807, file: !608, line: 386, type: !778)
!814 = !DISubprogram(name: "time_asctime", scope: !608, file: !608, line: 775, type: !355, isLocal: true, isDefinition: true, scopeLine: 776, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_asctime, variables: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !814, file: !608, line: 775, type: !234)
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !814, file: !608, line: 775, type: !234)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !814, file: !608, line: 777, type: !234)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !814, file: !608, line: 778, type: !764)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tt", scope: !821, file: !608, line: 783, type: !596)
!821 = distinct !DILexicalBlock(scope: !822, file: !608, line: 782, column: 28)
!822 = distinct !DILexicalBlock(scope: !814, file: !608, line: 782, column: 9)
!823 = !DISubprogram(name: "gettmarg", scope: !608, file: !608, line: 427, type: !824, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.tm*)* @gettmarg, variables: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!273, !234, !778}
!826 = !{!827, !828, !829, !830}
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !823, file: !608, line: 427, type: !234)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !823, file: !608, line: 427, type: !778)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !823, file: !608, line: 429, type: !273)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !831, file: !608, line: 450, type: !234)
!831 = distinct !DILexicalBlock(scope: !832, file: !608, line: 449, column: 60)
!832 = distinct !DILexicalBlock(scope: !823, file: !608, line: 449, column: 9)
!833 = !DISubprogram(name: "checktm", scope: !608, file: !608, line: 467, type: !834, isLocal: true, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tm*)* @checktm, variables: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{!273, !778}
!836 = !{!837}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !833, file: !608, line: 467, type: !778)
!838 = !DISubprogram(name: "_asctime", scope: !608, file: !608, line: 754, type: !789, isLocal: true, isDefinition: true, scopeLine: 755, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.tm*)* @_asctime, variables: !839)
!839 = !{!840}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timeptr", arg: 1, scope: !838, file: !608, line: 754, type: !778)
!841 = !DISubprogram(name: "time_ctime", scope: !608, file: !608, line: 800, type: !355, isLocal: true, isDefinition: true, scopeLine: 801, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_ctime, variables: !842)
!842 = !{!843, !844, !845, !846}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !841, file: !608, line: 800, type: !234)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !841, file: !608, line: 800, type: !234)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tt", scope: !841, file: !608, line: 802, type: !596)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !841, file: !608, line: 803, type: !764)
!847 = !DISubprogram(name: "time_mktime", scope: !608, file: !608, line: 820, type: !355, isLocal: true, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_mktime, variables: !848)
!848 = !{!849, !850, !851, !852}
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !847, file: !608, line: 820, type: !234)
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tup", arg: 2, scope: !847, file: !608, line: 820, type: !234)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !847, file: !608, line: 822, type: !764)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tt", scope: !847, file: !608, line: 823, type: !596)
!853 = !DISubprogram(name: "time_strftime", scope: !608, file: !608, line: 569, type: !355, isLocal: true, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_strftime, variables: !854)
!854 = !{!855, !856, !857, !858, !859, !862, !863, !864, !865, !866, !867, !868, !869}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !853, file: !608, line: 569, type: !234)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !853, file: !608, line: 569, type: !234)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !853, file: !608, line: 571, type: !234)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !853, file: !608, line: 572, type: !764)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !853, file: !608, line: 573, type: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !853, file: !608, line: 575, type: !598)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_arg", scope: !853, file: !608, line: 579, type: !234)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmtlen", scope: !853, file: !608, line: 580, type: !323)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !853, file: !608, line: 580, type: !323)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outbuf", scope: !853, file: !608, line: 581, type: !598)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !853, file: !608, line: 582, type: !323)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !853, file: !608, line: 583, type: !234)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tt", scope: !870, file: !608, line: 594, type: !596)
!870 = distinct !DILexicalBlock(scope: !871, file: !608, line: 593, column: 28)
!871 = distinct !DILexicalBlock(scope: !853, file: !608, line: 593, column: 9)
!872 = !DISubprogram(name: "time_strptime", scope: !608, file: !608, line: 730, type: !355, isLocal: true, isDefinition: true, scopeLine: 731, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_strptime, variables: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !872, file: !608, line: 730, type: !234)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !872, file: !608, line: 730, type: !234)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strptime_module", scope: !872, file: !608, line: 732, type: !234)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strptime_result", scope: !872, file: !608, line: 733, type: !234)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !879, file: !608, line: 740, type: !234)
!879 = distinct !DILexicalBlock(scope: !872, file: !608, line: 740, column: 8)
!880 = !DISubprogram(name: "time_tzset", scope: !608, file: !608, line: 871, type: !355, isLocal: true, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_tzset, variables: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !880, file: !608, line: 871, type: !234)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !880, file: !608, line: 871, type: !234)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !880, file: !608, line: 873, type: !234)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !608, line: 884, type: !234)
!886 = distinct !DILexicalBlock(scope: !880, file: !608, line: 884, column: 8)
!887 = !DISubprogram(name: "time_monotonic", scope: !608, file: !608, line: 1025, type: !355, isLocal: true, isDefinition: true, scopeLine: 1026, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_monotonic, variables: !888)
!888 = !{!889, !890}
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !887, file: !608, line: 1025, type: !234)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !887, file: !608, line: 1025, type: !234)
!891 = !DISubprogram(name: "pymonotonic", scope: !608, file: !608, line: 914, type: !618, isLocal: true, isDefinition: true, scopeLine: 915, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_clock_info_t*)* @pymonotonic, variables: !892)
!892 = !{!893, !894, !895, !897, !898}
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !891, file: !608, line: 914, type: !620)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !891, file: !608, line: 996, type: !639)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clk_id", scope: !891, file: !608, line: 1001, type: !896)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "function", scope: !891, file: !608, line: 1002, type: !258)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !899, file: !608, line: 1011, type: !639)
!899 = distinct !DILexicalBlock(scope: !900, file: !608, line: 1010, column: 15)
!900 = distinct !DILexicalBlock(scope: !891, file: !608, line: 1010, column: 9)
!901 = !DISubprogram(name: "time_process_time", scope: !608, file: !608, line: 1195, type: !355, isLocal: true, isDefinition: true, scopeLine: 1196, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_process_time, variables: !902)
!902 = !{!903, !904}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !901, file: !608, line: 1195, type: !234)
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !901, file: !608, line: 1195, type: !234)
!905 = !DISubprogram(name: "py_process_time", scope: !608, file: !608, line: 1082, type: !618, isLocal: true, isDefinition: true, scopeLine: 1083, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_clock_info_t*)* @py_process_time, variables: !906)
!906 = !{!907, !908, !983, !991, !992, !993, !994, !999, !1002}
!907 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !905, file: !608, line: 1082, type: !620)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ru", scope: !905, file: !608, line: 1112, type: !909)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !9, line: 187, size: 1152, align: 64, elements: !910)
!910 = !{!911, !912, !913, !918, !923, !928, !933, !938, !943, !948, !953, !958, !963, !968, !973, !978}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !909, file: !9, line: 190, baseType: !632, size: 128, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !909, file: !9, line: 192, baseType: !632, size: 128, align: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 194, baseType: !914, size: 64, align: 64, offset: 256)
!914 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 194, size: 64, align: 64, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !914, file: !9, line: 196, baseType: !246, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_maxrss_word", scope: !914, file: !9, line: 197, baseType: !643, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 202, baseType: !919, size: 64, align: 64, offset: 320)
!919 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 202, size: 64, align: 64, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !919, file: !9, line: 204, baseType: !246, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_ixrss_word", scope: !919, file: !9, line: 205, baseType: !643, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 208, baseType: !924, size: 64, align: 64, offset: 384)
!924 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 208, size: 64, align: 64, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !924, file: !9, line: 210, baseType: !246, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_idrss_word", scope: !924, file: !9, line: 211, baseType: !643, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 214, baseType: !929, size: 64, align: 64, offset: 448)
!929 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 214, size: 64, align: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !929, file: !9, line: 216, baseType: !246, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_isrss_word", scope: !929, file: !9, line: 217, baseType: !643, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 221, baseType: !934, size: 64, align: 64, offset: 512)
!934 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 221, size: 64, align: 64, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !934, file: !9, line: 223, baseType: !246, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_minflt_word", scope: !934, file: !9, line: 224, baseType: !643, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 227, baseType: !939, size: 64, align: 64, offset: 576)
!939 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 227, size: 64, align: 64, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !939, file: !9, line: 229, baseType: !246, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_majflt_word", scope: !939, file: !9, line: 230, baseType: !643, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 233, baseType: !944, size: 64, align: 64, offset: 640)
!944 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 233, size: 64, align: 64, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !944, file: !9, line: 235, baseType: !246, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nswap_word", scope: !944, file: !9, line: 236, baseType: !643, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 240, baseType: !949, size: 64, align: 64, offset: 704)
!949 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 240, size: 64, align: 64, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !949, file: !9, line: 242, baseType: !246, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_inblock_word", scope: !949, file: !9, line: 243, baseType: !643, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 246, baseType: !954, size: 64, align: 64, offset: 768)
!954 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 246, size: 64, align: 64, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !954, file: !9, line: 248, baseType: !246, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_oublock_word", scope: !954, file: !9, line: 249, baseType: !643, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 252, baseType: !959, size: 64, align: 64, offset: 832)
!959 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 252, size: 64, align: 64, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !959, file: !9, line: 254, baseType: !246, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgsnd_word", scope: !959, file: !9, line: 255, baseType: !643, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 258, baseType: !964, size: 64, align: 64, offset: 896)
!964 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 258, size: 64, align: 64, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !964, file: !9, line: 260, baseType: !246, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgrcv_word", scope: !964, file: !9, line: 261, baseType: !643, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 264, baseType: !969, size: 64, align: 64, offset: 960)
!969 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 264, size: 64, align: 64, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !969, file: !9, line: 266, baseType: !246, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nsignals_word", scope: !969, file: !9, line: 267, baseType: !643, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 272, baseType: !974, size: 64, align: 64, offset: 1024)
!974 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 272, size: 64, align: 64, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !974, file: !9, line: 274, baseType: !246, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nvcsw_word", scope: !974, file: !9, line: 275, baseType: !643, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !9, line: 279, baseType: !979, size: 64, align: 64, offset: 1088)
!979 = !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !9, line: 279, size: 64, align: 64, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !979, file: !9, line: 281, baseType: !246, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nivcsw_word", scope: !979, file: !9, line: 282, baseType: !643, size: 64, align: 64)
!983 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !905, file: !608, line: 1115, type: !984)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", file: !985, line: 34, size: 256, align: 64, elements: !986)
!985 = !DIFile(filename: "/usr/include/sys/times.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!986 = !{!987, !988, !989, !990}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !984, file: !985, line: 36, baseType: !573, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !984, file: !985, line: 37, baseType: !573, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !984, file: !985, line: 39, baseType: !573, size: 64, align: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !984, file: !985, line: 40, baseType: !573, size: 64, align: 64, offset: 192)
!991 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !905, file: !608, line: 1121, type: !639)
!992 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clk_id", scope: !905, file: !608, line: 1126, type: !896)
!993 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "function", scope: !905, file: !608, line: 1127, type: !258)
!994 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !995, file: !608, line: 1132, type: !639)
!995 = distinct !DILexicalBlock(scope: !996, file: !608, line: 1131, column: 19)
!996 = distinct !DILexicalBlock(scope: !997, file: !608, line: 1131, column: 13)
!997 = distinct !DILexicalBlock(scope: !998, file: !608, line: 1130, column: 42)
!998 = distinct !DILexicalBlock(scope: !905, file: !608, line: 1130, column: 9)
!999 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !1000, file: !608, line: 1147, type: !572)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !608, line: 1146, column: 43)
!1001 = distinct !DILexicalBlock(scope: !905, file: !608, line: 1146, column: 9)
!1002 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !1003, file: !608, line: 1162, type: !572)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !608, line: 1161, column: 35)
!1004 = distinct !DILexicalBlock(scope: !905, file: !608, line: 1161, column: 9)
!1005 = !DISubprogram(name: "time_perf_counter", scope: !608, file: !608, line: 1071, type: !355, isLocal: true, isDefinition: true, scopeLine: 1072, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_perf_counter, variables: !1006)
!1006 = !{!1007, !1008}
!1007 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !1005, file: !608, line: 1071, type: !234)
!1008 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !1005, file: !608, line: 1071, type: !234)
!1009 = !DISubprogram(name: "perf_counter", scope: !608, file: !608, line: 1037, type: !618, isLocal: true, isDefinition: true, scopeLine: 1038, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_clock_info_t*)* @perf_counter, variables: !1010)
!1010 = !{!1011, !1012}
!1011 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !1009, file: !608, line: 1037, type: !620)
!1012 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !1009, file: !608, line: 1040, type: !234)
!1013 = !DISubprogram(name: "time_get_clock_info", scope: !608, file: !608, line: 1207, type: !355, isLocal: true, isDefinition: true, scopeLine: 1208, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @time_get_clock_info, variables: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1025, !1026, !1028, !1029, !1032, !1033, !1035, !1036, !1039, !1040, !1042, !1043, !1046, !1047, !1049, !1050, !1053, !1054, !1056, !1057, !1059, !1061, !1065, !1067, !1071, !1073, !1077, !1079, !1083, !1085, !1087, !1089}
!1015 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !1013, file: !608, line: 1207, type: !234)
!1016 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1013, file: !608, line: 1207, type: !234)
!1017 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !1013, file: !608, line: 1209, type: !281)
!1018 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !1013, file: !608, line: 1210, type: !621)
!1019 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !1013, file: !608, line: 1211, type: !234)
!1020 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !1013, file: !608, line: 1211, type: !234)
!1021 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns", scope: !1013, file: !608, line: 1211, type: !234)
!1022 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !1023, file: !608, line: 1228, type: !323)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !608, line: 1228, column: 24)
!1024 = distinct !DILexicalBlock(scope: !1013, file: !608, line: 1228, column: 9)
!1025 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !1023, file: !608, line: 1228, type: !323)
!1026 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !1027, file: !608, line: 1228, type: !602)
!1027 = distinct !DILexicalBlock(scope: !1023, file: !608, line: 1228, column: 1555)
!1028 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !1027, file: !608, line: 1228, type: !273)
!1029 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !1030, file: !608, line: 1231, type: !323)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !608, line: 1231, column: 29)
!1031 = distinct !DILexicalBlock(scope: !1024, file: !608, line: 1231, column: 14)
!1032 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !1030, file: !608, line: 1231, type: !323)
!1033 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !1034, file: !608, line: 1231, type: !602)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !608, line: 1231, column: 1575)
!1035 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !1034, file: !608, line: 1231, type: !273)
!1036 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !1037, file: !608, line: 1235, type: !323)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !608, line: 1235, column: 29)
!1038 = distinct !DILexicalBlock(scope: !1031, file: !608, line: 1235, column: 14)
!1039 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !1037, file: !608, line: 1235, type: !323)
!1040 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !1041, file: !608, line: 1235, type: !602)
!1041 = distinct !DILexicalBlock(scope: !1037, file: !608, line: 1235, column: 1635)
!1042 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !1041, file: !608, line: 1235, type: !273)
!1043 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !1044, file: !608, line: 1238, type: !323)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !608, line: 1238, column: 29)
!1045 = distinct !DILexicalBlock(scope: !1038, file: !608, line: 1238, column: 14)
!1046 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !1044, file: !608, line: 1238, type: !323)
!1047 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !1048, file: !608, line: 1238, type: !602)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !608, line: 1238, column: 1680)
!1049 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !1048, file: !608, line: 1238, type: !273)
!1050 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !1051, file: !608, line: 1240, type: !323)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !608, line: 1240, column: 29)
!1052 = distinct !DILexicalBlock(scope: !1045, file: !608, line: 1240, column: 14)
!1053 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !1051, file: !608, line: 1240, type: !323)
!1054 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !1055, file: !608, line: 1240, type: !602)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !608, line: 1240, column: 1680)
!1056 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !1055, file: !608, line: 1240, type: !273)
!1057 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1058, file: !608, line: 1248, type: !234)
!1058 = distinct !DILexicalBlock(scope: !1013, file: !608, line: 1248, column: 8)
!1059 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !1060, file: !608, line: 1260, type: !234)
!1060 = distinct !DILexicalBlock(scope: !1013, file: !608, line: 1260, column: 8)
!1061 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1062, file: !608, line: 1260, type: !234)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !608, line: 1260, column: 101)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !608, line: 1260, column: 76)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !608, line: 1260, column: 53)
!1065 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !1066, file: !608, line: 1268, type: !234)
!1066 = distinct !DILexicalBlock(scope: !1013, file: !608, line: 1268, column: 8)
!1067 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1068, file: !608, line: 1268, type: !234)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !608, line: 1268, column: 101)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !608, line: 1268, column: 76)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !608, line: 1268, column: 53)
!1071 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !1072, file: !608, line: 1276, type: !234)
!1072 = distinct !DILexicalBlock(scope: !1013, file: !608, line: 1276, column: 8)
