; ModuleID = 'irs-onlybc/traceback.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !550, globals: !922)
!1 = !DIFile(filename: "traceback.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !479, !121, !36, !490, !491, !509, !517, !534, !535, !537, !539, !75, !541, !549, !42, !62, !128}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !21, line: 139, baseType: !22)
!21 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !21, line: 69, size: 1536, align: 64, elements: !23)
!23 = !{!24, !26, !27, !393, !452, !453, !454, !455, !456, !457, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !22, file: !21, line: 72, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !21, line: 73, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !22, file: !21, line: 74, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !21, line: 44, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !21, line: 19, size: 832, align: 64, elements: !31)
!31 = !{!32, !34, !35, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !21, line: 21, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !30, file: !21, line: 22, baseType: !25, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !30, file: !21, line: 24, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !38, line: 109, baseType: !39)
!38 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !38, line: 105, size: 128, align: 64, elements: !40)
!40 = !{!41, !49}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !39, file: !38, line: 107, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !43, line: 177, baseType: !44)
!43 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !45, line: 102, baseType: !46)
!45 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !47, line: 181, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !39, file: !38, line: 108, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !38, line: 334, size: 3200, align: 64, elements: !52)
!52 = !{!53, !59, !63, !64, !65, !70, !134, !139, !144, !145, !150, !202, !233, !245, !251, !252, !253, !255, !257, !288, !289, !290, !299, !300, !305, !306, !308, !310, !320, !330, !348, !349, !350, !352, !354, !355, !357, !362, !367, !372, !373, !374, !375, !376, !377, !378, !379, !381}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !51, file: !38, line: 335, baseType: !54, size: 192, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !38, line: 114, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 111, size: 192, align: 64, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !55, file: !38, line: 112, baseType: !37, size: 128, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !55, file: !38, line: 113, baseType: !42, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !51, file: !38, line: 336, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !51, file: !38, line: 337, baseType: !42, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !51, file: !38, line: 337, baseType: !42, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !51, file: !38, line: 341, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !38, line: 308, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !36}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !51, file: !38, line: 342, baseType: !71, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !38, line: 314, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !36, !76, !75}
!75 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 48, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 246, size: 1728, align: 64, elements: !80)
!79 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!80 = !{!81, !82, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !102, !103, !104, !105, !107, !109, !111, !115, !118, !120, !122, !123, !124, !125, !129, !130}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 247, baseType: !75, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 252, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 253, baseType: !83, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 254, baseType: !83, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 255, baseType: !83, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 256, baseType: !83, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 257, baseType: !83, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 258, baseType: !83, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 259, baseType: !83, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 261, baseType: !83, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 262, baseType: !83, size: 64, align: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 263, baseType: !83, size: 64, align: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 265, baseType: !95, size: 64, align: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 161, size: 192, align: 64, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !96, file: !79, line: 162, baseType: !95, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !96, file: !79, line: 163, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !96, file: !79, line: 167, baseType: !75, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 267, baseType: !100, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 269, baseType: !75, size: 32, align: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 273, baseType: !75, size: 32, align: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 275, baseType: !106, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 140, baseType: !48)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 279, baseType: !108, size: 16, align: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 280, baseType: !110, size: 8, align: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 281, baseType: !112, size: 8, align: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 285, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 155, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 294, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 141, baseType: !48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !78, file: !79, line: 303, baseType: !121, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !78, file: !79, line: 304, baseType: !121, size: 64, align: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !78, file: !79, line: 305, baseType: !121, size: 64, align: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !78, file: !79, line: 306, baseType: !121, size: 64, align: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 307, baseType: !126, size: 64, align: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 62, baseType: !128)
!127 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!128 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 309, baseType: !75, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 311, baseType: !131, size: 160, align: 8, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !51, file: !38, line: 343, baseType: !135, size: 64, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !38, line: 316, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!36, !36, !83}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !51, file: !38, line: 344, baseType: !140, size: 64, align: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !38, line: 318, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!75, !36, !83, !36}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !51, file: !38, line: 345, baseType: !121, size: 64, align: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !51, file: !38, line: 346, baseType: !146, size: 64, align: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !38, line: 320, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!36, !36}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !51, file: !38, line: 350, baseType: !151, size: 64, align: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !38, line: 278, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 236, size: 2176, align: 64, elements: !154)
!154 = !{!155, !160, !161, !162, !163, !164, !169, !171, !172, !173, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !153, file: !38, line: 241, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !38, line: 166, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!36, !36, !36}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !153, file: !38, line: 242, baseType: !156, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !153, file: !38, line: 243, baseType: !156, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !153, file: !38, line: 244, baseType: !156, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !153, file: !38, line: 245, baseType: !156, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !153, file: !38, line: 246, baseType: !165, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !38, line: 167, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!36, !36, !36, !36}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !153, file: !38, line: 247, baseType: !170, size: 64, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !38, line: 165, baseType: !147)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !153, file: !38, line: 248, baseType: !170, size: 64, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !153, file: !38, line: 249, baseType: !170, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !153, file: !38, line: 250, baseType: !174, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !38, line: 168, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!75, !36}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !153, file: !38, line: 251, baseType: !170, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !153, file: !38, line: 252, baseType: !156, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !153, file: !38, line: 253, baseType: !156, size: 64, align: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !153, file: !38, line: 254, baseType: !156, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !153, file: !38, line: 255, baseType: !156, size: 64, align: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !153, file: !38, line: 256, baseType: !156, size: 64, align: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !153, file: !38, line: 257, baseType: !170, size: 64, align: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !153, file: !38, line: 258, baseType: !121, size: 64, align: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !153, file: !38, line: 259, baseType: !170, size: 64, align: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !153, file: !38, line: 261, baseType: !156, size: 64, align: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !153, file: !38, line: 262, baseType: !156, size: 64, align: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !153, file: !38, line: 263, baseType: !156, size: 64, align: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !153, file: !38, line: 264, baseType: !156, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !153, file: !38, line: 265, baseType: !165, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !153, file: !38, line: 266, baseType: !156, size: 64, align: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !153, file: !38, line: 267, baseType: !156, size: 64, align: 64, offset: 1600)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !153, file: !38, line: 268, baseType: !156, size: 64, align: 64, offset: 1664)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !153, file: !38, line: 269, baseType: !156, size: 64, align: 64, offset: 1728)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !153, file: !38, line: 270, baseType: !156, size: 64, align: 64, offset: 1792)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !153, file: !38, line: 272, baseType: !156, size: 64, align: 64, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !153, file: !38, line: 273, baseType: !156, size: 64, align: 64, offset: 1920)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !153, file: !38, line: 274, baseType: !156, size: 64, align: 64, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !153, file: !38, line: 275, baseType: !156, size: 64, align: 64, offset: 2048)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !153, file: !38, line: 277, baseType: !170, size: 64, align: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !51, file: !38, line: 351, baseType: !203, size: 64, align: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !38, line: 292, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 280, size: 640, align: 64, elements: !206)
!206 = !{!207, !212, !213, !218, !219, !220, !225, !226, !231, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !205, file: !38, line: 281, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !38, line: 169, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!42, !36}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !205, file: !38, line: 282, baseType: !156, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !205, file: !38, line: 283, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !38, line: 170, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!36, !36, !42}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !205, file: !38, line: 284, baseType: !214, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !205, file: !38, line: 285, baseType: !121, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !205, file: !38, line: 286, baseType: !221, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !38, line: 172, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!75, !36, !42, !36}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !205, file: !38, line: 287, baseType: !121, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !205, file: !38, line: 288, baseType: !227, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !38, line: 231, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!75, !36, !36}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !205, file: !38, line: 290, baseType: !156, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !205, file: !38, line: 291, baseType: !214, size: 64, align: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !51, file: !38, line: 352, baseType: !234, size: 64, align: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !38, line: 298, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 294, size: 192, align: 64, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !236, file: !38, line: 295, baseType: !208, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !236, file: !38, line: 296, baseType: !156, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !236, file: !38, line: 297, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !38, line: 174, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!75, !36, !36, !36}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !51, file: !38, line: 356, baseType: !246, size: 64, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !38, line: 321, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !36}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !43, line: 186, baseType: !42)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !51, file: !38, line: 357, baseType: !165, size: 64, align: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !51, file: !38, line: 358, baseType: !146, size: 64, align: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !51, file: !38, line: 359, baseType: !254, size: 64, align: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !38, line: 317, baseType: !157)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !51, file: !38, line: 360, baseType: !256, size: 64, align: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !38, line: 319, baseType: !242)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !51, file: !38, line: 363, baseType: !258, size: 64, align: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !38, line: 304, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 301, size: 128, align: 64, elements: !261)
!261 = !{!262, !283}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !260, file: !38, line: 302, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !38, line: 193, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!75, !36, !267, !75}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !38, line: 191, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !38, line: 178, size: 640, align: 64, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !280, !281, !282}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !269, file: !38, line: 179, baseType: !121, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !269, file: !38, line: 180, baseType: !36, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !38, line: 181, baseType: !42, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !269, file: !38, line: 182, baseType: !42, size: 64, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !269, file: !38, line: 184, baseType: !75, size: 32, align: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !269, file: !38, line: 185, baseType: !75, size: 32, align: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !269, file: !38, line: 186, baseType: !83, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !269, file: !38, line: 187, baseType: !279, size: 64, align: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !269, file: !38, line: 188, baseType: !279, size: 64, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !269, file: !38, line: 189, baseType: !279, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !269, file: !38, line: 190, baseType: !121, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !260, file: !38, line: 303, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !38, line: 194, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !36, !267}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !51, file: !38, line: 366, baseType: !128, size: 64, align: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !51, file: !38, line: 368, baseType: !60, size: 64, align: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !51, file: !38, line: 372, baseType: !291, size: 64, align: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !38, line: 233, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!75, !36, !295, !121}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !38, line: 232, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!75, !36, !121}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !51, file: !38, line: 375, baseType: !174, size: 64, align: 64, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !51, file: !38, line: 379, baseType: !301, size: 64, align: 64, offset: 1600)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !38, line: 322, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!36, !36, !36, !75}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !51, file: !38, line: 382, baseType: !42, size: 64, align: 64, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !51, file: !38, line: 385, baseType: !307, size: 64, align: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !38, line: 323, baseType: !147)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !51, file: !38, line: 386, baseType: !309, size: 64, align: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !38, line: 324, baseType: !147)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !51, file: !38, line: 389, baseType: !311, size: 64, align: 64, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !313, line: 40, size: 256, align: 64, elements: !314)
!313 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!314 = !{!315, !316, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !312, file: !313, line: 41, baseType: !60, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !312, file: !313, line: 42, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !313, line: 18, baseType: !157)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !312, file: !313, line: 43, baseType: !75, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !312, file: !313, line: 45, baseType: !60, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !51, file: !38, line: 390, baseType: !321, size: 64, align: 64, offset: 1920)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !323, line: 18, size: 320, align: 64, elements: !324)
!323 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!324 = !{!325, !326, !327, !328, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !323, line: 19, baseType: !83, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !323, line: 20, baseType: !75, size: 32, align: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !322, file: !323, line: 21, baseType: !42, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !322, file: !323, line: 22, baseType: !75, size: 32, align: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !322, file: !323, line: 23, baseType: !83, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !51, file: !38, line: 391, baseType: !331, size: 64, align: 64, offset: 1984)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !333, line: 11, size: 320, align: 64, elements: !334)
!333 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!334 = !{!335, !336, !341, !346, !347}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !333, line: 12, baseType: !83, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !332, file: !333, line: 13, baseType: !337, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !333, line: 8, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!36, !36, !121}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !333, line: 14, baseType: !342, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !333, line: 9, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!75, !36, !36, !121}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !332, file: !333, line: 15, baseType: !83, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !332, file: !333, line: 16, baseType: !121, size: 64, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !51, file: !38, line: 392, baseType: !50, size: 64, align: 64, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !51, file: !38, line: 393, baseType: !36, size: 64, align: 64, offset: 2112)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !51, file: !38, line: 394, baseType: !351, size: 64, align: 64, offset: 2176)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !38, line: 325, baseType: !166)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !51, file: !38, line: 395, baseType: !353, size: 64, align: 64, offset: 2240)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !38, line: 326, baseType: !242)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !51, file: !38, line: 396, baseType: !42, size: 64, align: 64, offset: 2304)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !51, file: !38, line: 397, baseType: !356, size: 64, align: 64, offset: 2368)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !38, line: 327, baseType: !242)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !51, file: !38, line: 398, baseType: !358, size: 64, align: 64, offset: 2432)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !38, line: 329, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!36, !50, !42}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !51, file: !38, line: 399, baseType: !363, size: 64, align: 64, offset: 2496)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !38, line: 328, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!36, !50, !36, !36}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !51, file: !38, line: 400, baseType: !368, size: 64, align: 64, offset: 2560)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !38, line: 307, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !121}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !51, file: !38, line: 401, baseType: !174, size: 64, align: 64, offset: 2624)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !51, file: !38, line: 402, baseType: !36, size: 64, align: 64, offset: 2688)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !51, file: !38, line: 403, baseType: !36, size: 64, align: 64, offset: 2752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !51, file: !38, line: 404, baseType: !36, size: 64, align: 64, offset: 2816)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !51, file: !38, line: 405, baseType: !36, size: 64, align: 64, offset: 2880)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !51, file: !38, line: 406, baseType: !36, size: 64, align: 64, offset: 2944)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !51, file: !38, line: 407, baseType: !66, size: 64, align: 64, offset: 3008)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !51, file: !38, line: 410, baseType: !380, size: 32, align: 32, offset: 3072)
!380 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !51, file: !38, line: 412, baseType: !66, size: 64, align: 64, offset: 3136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !30, file: !21, line: 25, baseType: !36, size: 64, align: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !30, file: !21, line: 26, baseType: !36, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !30, file: !21, line: 27, baseType: !36, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !30, file: !21, line: 28, baseType: !36, size: 64, align: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !30, file: !21, line: 30, baseType: !36, size: 64, align: 64, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !30, file: !21, line: 31, baseType: !36, size: 64, align: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !30, file: !21, line: 32, baseType: !36, size: 64, align: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !30, file: !21, line: 33, baseType: !75, size: 32, align: 32, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !30, file: !21, line: 34, baseType: !75, size: 32, align: 32, offset: 672)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !30, file: !21, line: 37, baseType: !75, size: 32, align: 32, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !30, file: !21, line: 43, baseType: !36, size: 64, align: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !22, file: !21, line: 76, baseType: !394, size: 64, align: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !396, line: 17, size: 3072, align: 64, elements: !397)
!396 = !DIFile(filename: "Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!397 = !{!398, !399, !400, !427, !428, !429, !430, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !450}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !395, file: !396, line: 18, baseType: !54, size: 192, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !395, file: !396, line: 19, baseType: !394, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !395, file: !396, line: 20, baseType: !401, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !403, line: 33, baseType: !404)
!403 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 11, size: 1152, align: 64, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !421, !422, !423, !424, !425, !426}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 12, baseType: !37, size: 128, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !404, file: !403, line: 13, baseType: !75, size: 32, align: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !404, file: !403, line: 14, baseType: !75, size: 32, align: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !404, file: !403, line: 15, baseType: !75, size: 32, align: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !404, file: !403, line: 16, baseType: !75, size: 32, align: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !404, file: !403, line: 17, baseType: !75, size: 32, align: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !404, file: !403, line: 18, baseType: !36, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !404, file: !403, line: 19, baseType: !36, size: 64, align: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !404, file: !403, line: 20, baseType: !36, size: 64, align: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !404, file: !403, line: 21, baseType: !36, size: 64, align: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !404, file: !403, line: 22, baseType: !36, size: 64, align: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !404, file: !403, line: 23, baseType: !36, size: 64, align: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !404, file: !403, line: 25, baseType: !419, size: 64, align: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !404, file: !403, line: 26, baseType: !36, size: 64, align: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !404, file: !403, line: 27, baseType: !36, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !404, file: !403, line: 28, baseType: !75, size: 32, align: 32, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !404, file: !403, line: 29, baseType: !36, size: 64, align: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !404, file: !403, line: 31, baseType: !121, size: 64, align: 64, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !404, file: !403, line: 32, baseType: !36, size: 64, align: 64, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !395, file: !396, line: 21, baseType: !36, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !395, file: !396, line: 22, baseType: !36, size: 64, align: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !395, file: !396, line: 23, baseType: !36, size: 64, align: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !395, file: !396, line: 24, baseType: !431, size: 64, align: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !395, file: !396, line: 28, baseType: !431, size: 64, align: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !395, file: !396, line: 29, baseType: !36, size: 64, align: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !395, file: !396, line: 38, baseType: !36, size: 64, align: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !395, file: !396, line: 38, baseType: !36, size: 64, align: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !395, file: !396, line: 38, baseType: !36, size: 64, align: 64, offset: 832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !395, file: !396, line: 40, baseType: !36, size: 64, align: 64, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !395, file: !396, line: 42, baseType: !75, size: 32, align: 32, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !395, file: !396, line: 48, baseType: !75, size: 32, align: 32, offset: 992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !395, file: !396, line: 49, baseType: !75, size: 32, align: 32, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !395, file: !396, line: 50, baseType: !62, size: 8, align: 8, offset: 1056)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !395, file: !396, line: 51, baseType: !443, size: 1920, align: 32, offset: 1088)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1920, align: 32, elements: !132)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !396, line: 15, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 11, size: 96, align: 32, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !445, file: !396, line: 12, baseType: !75, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !445, file: !396, line: 13, baseType: !75, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !445, file: !396, line: 14, baseType: !75, size: 32, align: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !395, file: !396, line: 52, baseType: !451, size: 64, align: 64, offset: 3008)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, align: 64, elements: !113)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !22, file: !21, line: 77, baseType: !75, size: 32, align: 32, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !22, file: !21, line: 78, baseType: !62, size: 8, align: 8, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !22, file: !21, line: 80, baseType: !62, size: 8, align: 8, offset: 296)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !22, file: !21, line: 85, baseType: !75, size: 32, align: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !22, file: !21, line: 86, baseType: !75, size: 32, align: 32, offset: 352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !22, file: !21, line: 88, baseType: !458, size: 64, align: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !21, line: 54, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!75, !36, !394, !75, !36}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !22, file: !21, line: 89, baseType: !458, size: 64, align: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !22, file: !21, line: 90, baseType: !36, size: 64, align: 64, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !22, file: !21, line: 91, baseType: !36, size: 64, align: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !22, file: !21, line: 93, baseType: !36, size: 64, align: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !22, file: !21, line: 94, baseType: !36, size: 64, align: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !22, file: !21, line: 95, baseType: !36, size: 64, align: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !22, file: !21, line: 97, baseType: !36, size: 64, align: 64, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !22, file: !21, line: 98, baseType: !36, size: 64, align: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !22, file: !21, line: 99, baseType: !36, size: 64, align: 64, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !22, file: !21, line: 101, baseType: !36, size: 64, align: 64, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !22, file: !21, line: 103, baseType: !75, size: 32, align: 32, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !22, file: !21, line: 105, baseType: !36, size: 64, align: 64, offset: 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !22, file: !21, line: 106, baseType: !48, size: 64, align: 64, offset: 1216)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !22, file: !21, line: 108, baseType: !75, size: 32, align: 32, offset: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !22, file: !21, line: 109, baseType: !36, size: 64, align: 64, offset: 1344)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !22, file: !21, line: 134, baseType: !369, size: 64, align: 64, offset: 1408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !22, file: !21, line: 135, baseType: !121, size: 64, align: 64, offset: 1472)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTracebackObject", file: !481, line: 20, baseType: !482)
!481 = !DIFile(filename: "Include/traceback.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "_traceback", file: !481, line: 14, size: 320, align: 64, elements: !483)
!483 = !{!484, !485, !487, !488, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !482, file: !481, line: 15, baseType: !37, size: 128, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tb_next", scope: !482, file: !481, line: 16, baseType: !486, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tb_frame", scope: !482, file: !481, line: 17, baseType: !394, size: 64, align: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tb_lasti", scope: !482, file: !481, line: 18, baseType: !75, size: 32, align: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tb_lineno", scope: !482, file: !481, line: 19, baseType: !75, size: 32, align: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !45, line: 92, baseType: !119)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !12, line: 351, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 217, size: 384, align: 64, elements: !494)
!494 = !{!495, !496, !497, !498, !506}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !493, file: !12, line: 291, baseType: !37, size: 128, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !493, file: !12, line: 292, baseType: !42, size: 64, align: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !493, file: !12, line: 293, baseType: !250, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !493, file: !12, line: 349, baseType: !499, size: 32, align: 32, offset: 256)
!499 = !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !12, line: 294, size: 32, align: 32, elements: !500)
!500 = !{!501, !502, !503, !504, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !499, file: !12, line: 303, baseType: !380, size: 2, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !499, file: !12, line: 331, baseType: !380, size: 3, align: 32, offset: 2)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !499, file: !12, line: 336, baseType: !380, size: 1, align: 32, offset: 5)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !499, file: !12, line: 340, baseType: !380, size: 1, align: 32, offset: 6)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !499, file: !12, line: 345, baseType: !380, size: 1, align: 32, offset: 7)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !493, file: !12, line: 350, baseType: !507, size: 64, align: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !127, line: 90, baseType: !75)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !12, line: 363, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 356, size: 576, align: 64, elements: !512)
!512 = !{!513, !514, !515, !516}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !511, file: !12, line: 357, baseType: !492, size: 384, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !511, file: !12, line: 358, baseType: !42, size: 64, align: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !511, file: !12, line: 360, baseType: !83, size: 64, align: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !511, file: !12, line: 361, baseType: !42, size: 64, align: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !12, line: 376, baseType: !519)
!519 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 368, size: 640, align: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !519, file: !12, line: 369, baseType: !510, size: 576, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !519, file: !12, line: 375, baseType: !523, size: 64, align: 64, offset: 576)
!523 = !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !12, line: 370, size: 64, align: 64, elements: !524)
!524 = !{!525, !526, !529, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !523, file: !12, line: 371, baseType: !121, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !523, file: !12, line: 372, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !12, line: 134, baseType: !420)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !523, file: !12, line: 373, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !12, line: 129, baseType: !108)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !523, file: !12, line: 374, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !12, line: 121, baseType: !380)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !543, line: 41, baseType: !544)
!543 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!544 = !DICompositeType(tag: DW_TAG_structure_type, file: !543, line: 31, size: 320, align: 64, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !544, file: !543, line: 32, baseType: !54, size: 192, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !544, file: !543, line: 33, baseType: !250, size: 64, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !544, file: !543, line: 34, baseType: !112, size: 8, align: 8, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!550 = !{!551, !580, !659, !690, !696, !705, !729, !744, !759, !764, !773, !778, !781, !794, !825, !835, !847, !856, !864, !884, !896, !906, !917}
!551 = !DISubprogram(name: "PyTraceBack_Here", scope: !552, file: !552, line: 133, type: !553, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._frame*)* @PyTraceBack_Here, variables: !557)
!552 = !DIFile(filename: "Python/traceback.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!553 = !DISubroutineType(types: !554)
!554 = !{!75, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !396, line: 53, baseType: !395)
!557 = !{!558, !559, !560, !567, !568, !571, !573, !574, !575, !577}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 1, scope: !551, file: !552, line: 133, type: !555)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !551, file: !552, line: 135, type: !19)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !561, file: !552, line: 135, type: !562)
!561 = distinct !DILexicalBlock(scope: !551, file: !552, line: 135, column: 61)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !564)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !564, file: !4, line: 32, baseType: !121, size: 64, align: 64)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !561, file: !552, line: 135, type: !121)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !561, file: !552, line: 135, type: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !561, file: !552, line: 135, type: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtb", scope: !551, file: !552, line: 136, type: !479)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !551, file: !552, line: 137, type: !479)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !576, file: !552, line: 141, type: !36)
!576 = distinct !DILexicalBlock(scope: !551, file: !552, line: 141, column: 8)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !552, line: 141, type: !36)
!578 = distinct !DILexicalBlock(scope: !579, file: !552, line: 141, column: 97)
!579 = distinct !DILexicalBlock(scope: !576, file: !552, line: 141, column: 63)
!580 = !DISubprogram(name: "_Py_DisplaySourceLine", scope: !552, file: !552, line: 224, type: !581, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32, i32)* @_Py_DisplaySourceLine, variables: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!75, !36, !36, !75, !75}
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !602, !603, !604, !610, !614, !616, !620, !622, !624, !626, !631, !634, !637, !639, !643, !646, !650, !653, !657}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !580, file: !552, line: 224, type: !36)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !580, file: !552, line: 224, type: !36)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 3, scope: !580, file: !552, line: 224, type: !75)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indent", arg: 4, scope: !580, file: !552, line: 224, type: !75)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !580, file: !552, line: 226, type: !75)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !580, file: !552, line: 227, type: !75)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !580, file: !552, line: 228, type: !75)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found_encoding", scope: !580, file: !552, line: 229, type: !83)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !580, file: !552, line: 230, type: !83)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "io", scope: !580, file: !552, line: 231, type: !36)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binary", scope: !580, file: !552, line: 232, type: !36)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fob", scope: !580, file: !552, line: 233, type: !36)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineobj", scope: !580, file: !552, line: 234, type: !36)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !580, file: !552, line: 235, type: !36)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !580, file: !552, line: 236, type: !599)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32776, align: 8, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 4097)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !580, file: !552, line: 237, type: !75)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !580, file: !552, line: 238, type: !121)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !552, line: 254, type: !36)
!605 = distinct !DILexicalBlock(scope: !606, file: !552, line: 254, column: 16)
!606 = distinct !DILexicalBlock(scope: !607, file: !552, line: 253, column: 35)
!607 = distinct !DILexicalBlock(scope: !608, file: !552, line: 253, column: 13)
!608 = distinct !DILexicalBlock(scope: !609, file: !552, line: 249, column: 31)
!609 = distinct !DILexicalBlock(scope: !580, file: !552, line: 249, column: 9)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !552, line: 262, type: !36)
!611 = distinct !DILexicalBlock(scope: !612, file: !552, line: 262, column: 12)
!612 = distinct !DILexicalBlock(scope: !613, file: !552, line: 261, column: 17)
!613 = distinct !DILexicalBlock(scope: !580, file: !552, line: 261, column: 9)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !615, file: !552, line: 263, type: !36)
!615 = distinct !DILexicalBlock(scope: !612, file: !552, line: 263, column: 12)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !552, line: 272, type: !36)
!617 = distinct !DILexicalBlock(scope: !618, file: !552, line: 272, column: 12)
!618 = distinct !DILexicalBlock(scope: !619, file: !552, line: 271, column: 39)
!619 = distinct !DILexicalBlock(scope: !580, file: !552, line: 271, column: 9)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !621, file: !552, line: 273, type: !36)
!621 = distinct !DILexicalBlock(scope: !618, file: !552, line: 273, column: 12)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !623, file: !552, line: 278, type: !36)
!623 = distinct !DILexicalBlock(scope: !580, file: !552, line: 278, column: 8)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !625, file: !552, line: 279, type: !36)
!625 = distinct !DILexicalBlock(scope: !580, file: !552, line: 279, column: 8)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !627, file: !552, line: 289, type: !36)
!627 = distinct !DILexicalBlock(scope: !628, file: !552, line: 289, column: 12)
!628 = distinct !DILexicalBlock(scope: !629, file: !552, line: 288, column: 34)
!629 = distinct !DILexicalBlock(scope: !630, file: !552, line: 288, column: 5)
!630 = distinct !DILexicalBlock(scope: !580, file: !552, line: 288, column: 5)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !552, line: 289, type: !36)
!632 = distinct !DILexicalBlock(scope: !633, file: !552, line: 289, column: 103)
!633 = distinct !DILexicalBlock(scope: !627, file: !552, line: 289, column: 69)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !635, file: !552, line: 298, type: !36)
!635 = distinct !DILexicalBlock(scope: !636, file: !552, line: 298, column: 12)
!636 = distinct !DILexicalBlock(scope: !580, file: !552, line: 297, column: 9)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !638, file: !552, line: 301, type: !36)
!638 = distinct !DILexicalBlock(scope: !580, file: !552, line: 301, column: 8)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !640, file: !552, line: 303, type: !36)
!640 = distinct !DILexicalBlock(scope: !641, file: !552, line: 303, column: 12)
!641 = distinct !DILexicalBlock(scope: !642, file: !552, line: 302, column: 94)
!642 = distinct !DILexicalBlock(scope: !580, file: !552, line: 302, column: 9)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !644, file: !552, line: 303, type: !36)
!644 = distinct !DILexicalBlock(scope: !645, file: !552, line: 303, column: 103)
!645 = distinct !DILexicalBlock(scope: !640, file: !552, line: 303, column: 69)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !647, file: !552, line: 311, type: !534)
!647 = distinct !DILexicalBlock(scope: !648, file: !552, line: 310, column: 92)
!648 = distinct !DILexicalBlock(scope: !649, file: !552, line: 310, column: 5)
!649 = distinct !DILexicalBlock(scope: !580, file: !552, line: 310, column: 5)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "truncated", scope: !651, file: !552, line: 316, type: !36)
!651 = distinct !DILexicalBlock(scope: !652, file: !552, line: 315, column: 12)
!652 = distinct !DILexicalBlock(scope: !580, file: !552, line: 315, column: 9)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !654, file: !552, line: 319, type: !36)
!654 = distinct !DILexicalBlock(scope: !655, file: !552, line: 319, column: 16)
!655 = distinct !DILexicalBlock(scope: !656, file: !552, line: 318, column: 24)
!656 = distinct !DILexicalBlock(scope: !651, file: !552, line: 318, column: 13)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !658, file: !552, line: 341, type: !36)
!658 = distinct !DILexicalBlock(scope: !580, file: !552, line: 341, column: 8)
!659 = !DISubprogram(name: "PyTraceBack_Print", scope: !552, file: !552, line: 397, type: !229, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyTraceBack_Print, variables: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !669, !670, !671, !677, !680, !682, !685, !687}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !659, file: !552, line: 397, type: !36)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !659, file: !552, line: 397, type: !36)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !659, file: !552, line: 399, type: !75)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limitv", scope: !659, file: !552, line: 400, type: !36)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !659, file: !552, line: 401, type: !48)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_type", scope: !667, file: !552, line: 411, type: !36)
!667 = distinct !DILexicalBlock(scope: !668, file: !552, line: 410, column: 17)
!668 = distinct !DILexicalBlock(scope: !659, file: !552, line: 410, column: 9)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_value", scope: !667, file: !552, line: 411, type: !36)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_tb", scope: !667, file: !552, line: 411, type: !36)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !672, file: !552, line: 420, type: !36)
!672 = distinct !DILexicalBlock(scope: !673, file: !552, line: 420, column: 20)
!673 = distinct !DILexicalBlock(scope: !674, file: !552, line: 419, column: 18)
!674 = distinct !DILexicalBlock(scope: !675, file: !552, line: 416, column: 17)
!675 = distinct !DILexicalBlock(scope: !676, file: !552, line: 415, column: 46)
!676 = distinct !DILexicalBlock(scope: !667, file: !552, line: 415, column: 13)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !552, line: 420, type: !36)
!678 = distinct !DILexicalBlock(scope: !679, file: !552, line: 420, column: 112)
!679 = distinct !DILexicalBlock(scope: !672, file: !552, line: 420, column: 78)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !681, file: !552, line: 421, type: !36)
!681 = distinct !DILexicalBlock(scope: !673, file: !552, line: 421, column: 20)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !683, file: !552, line: 421, type: !36)
!683 = distinct !DILexicalBlock(scope: !684, file: !552, line: 421, column: 113)
!684 = distinct !DILexicalBlock(scope: !681, file: !552, line: 421, column: 79)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !686, file: !552, line: 422, type: !36)
!686 = distinct !DILexicalBlock(scope: !673, file: !552, line: 422, column: 20)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !688, file: !552, line: 422, type: !36)
!688 = distinct !DILexicalBlock(scope: !689, file: !552, line: 422, column: 110)
!689 = distinct !DILexicalBlock(scope: !686, file: !552, line: 422, column: 76)
!690 = !DISubprogram(name: "_Py_DumpTraceback", scope: !552, file: !552, line: 630, type: !691, isLocal: false, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct._ts*)* @_Py_DumpTraceback, variables: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !75, !19}
!693 = !{!694, !695}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !690, file: !552, line: 630, type: !75)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tstate", arg: 2, scope: !690, file: !552, line: 630, type: !19)
!696 = !DISubprogram(name: "_Py_DumpTracebackThreads", scope: !552, file: !552, line: 652, type: !697, isLocal: false, isDefinition: true, scopeLine: 654, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, %struct._is*, %struct._ts*)* @_Py_DumpTracebackThreads, variables: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{!60, !75, !28, !19}
!699 = !{!700, !701, !702, !703, !704}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !696, file: !552, line: 652, type: !75)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "interp", arg: 2, scope: !696, file: !552, line: 652, type: !28)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "current_thread", arg: 3, scope: !696, file: !552, line: 653, type: !19)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !696, file: !552, line: 655, type: !19)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nthreads", scope: !696, file: !552, line: 656, type: !380)
!705 = !DISubprogram(name: "tb_dealloc", scope: !552, file: !552, line: 50, type: !706, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._traceback*)* @tb_dealloc, variables: !708)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !479}
!708 = !{!709, !710, !712, !714, !715, !716, !717, !721, !724, !726}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 1, scope: !705, file: !552, line: 50, type: !479)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_tstate", scope: !711, file: !552, line: 53, type: !19)
!711 = distinct !DILexicalBlock(scope: !705, file: !552, line: 53, column: 8)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !713, file: !552, line: 53, type: !562)
!713 = distinct !DILexicalBlock(scope: !711, file: !552, line: 53, column: 67)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !713, file: !552, line: 53, type: !121)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !713, file: !552, line: 53, type: !569)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !713, file: !552, line: 53, type: !572)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !718, file: !552, line: 54, type: !36)
!718 = distinct !DILexicalBlock(scope: !719, file: !552, line: 54, column: 8)
!719 = distinct !DILexicalBlock(scope: !720, file: !552, line: 53, column: 797)
!720 = distinct !DILexicalBlock(scope: !711, file: !552, line: 53, column: 761)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !552, line: 54, type: !36)
!722 = distinct !DILexicalBlock(scope: !723, file: !552, line: 54, column: 103)
!723 = distinct !DILexicalBlock(scope: !718, file: !552, line: 54, column: 69)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !725, file: !552, line: 55, type: !36)
!725 = distinct !DILexicalBlock(scope: !719, file: !552, line: 55, column: 8)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !727, file: !552, line: 55, type: !36)
!727 = distinct !DILexicalBlock(scope: !728, file: !552, line: 55, column: 104)
!728 = distinct !DILexicalBlock(scope: !725, file: !552, line: 55, column: 70)
!729 = !DISubprogram(name: "tb_traverse", scope: !552, file: !552, line: 61, type: !730, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._traceback*, i32 (%struct._object*, i8*)*, i8*)* @tb_traverse, variables: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{!75, !479, !295, !121}
!732 = !{!733, !734, !735, !736, !740}
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 1, scope: !729, file: !552, line: 61, type: !479)
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !729, file: !552, line: 61, type: !295)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !729, file: !552, line: 61, type: !121)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !737, file: !552, line: 63, type: !75)
!737 = distinct !DILexicalBlock(scope: !738, file: !552, line: 63, column: 27)
!738 = distinct !DILexicalBlock(scope: !739, file: !552, line: 63, column: 14)
!739 = distinct !DILexicalBlock(scope: !729, file: !552, line: 63, column: 8)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !741, file: !552, line: 64, type: !75)
!741 = distinct !DILexicalBlock(scope: !742, file: !552, line: 64, column: 28)
!742 = distinct !DILexicalBlock(scope: !743, file: !552, line: 64, column: 14)
!743 = distinct !DILexicalBlock(scope: !729, file: !552, line: 64, column: 8)
!744 = !DISubprogram(name: "tb_clear", scope: !552, file: !552, line: 69, type: !706, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._traceback*)* @tb_clear, variables: !745)
!745 = !{!746, !747, !749, !753, !755}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 1, scope: !744, file: !552, line: 69, type: !479)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !748, file: !552, line: 71, type: !36)
!748 = distinct !DILexicalBlock(scope: !744, file: !552, line: 71, column: 8)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !750, file: !552, line: 71, type: !36)
!750 = distinct !DILexicalBlock(scope: !751, file: !552, line: 71, column: 117)
!751 = distinct !DILexicalBlock(scope: !752, file: !552, line: 71, column: 84)
!752 = distinct !DILexicalBlock(scope: !748, file: !552, line: 71, column: 61)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !754, file: !552, line: 72, type: !36)
!754 = distinct !DILexicalBlock(scope: !744, file: !552, line: 72, column: 8)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !552, line: 72, type: !36)
!756 = distinct !DILexicalBlock(scope: !757, file: !552, line: 72, column: 119)
!757 = distinct !DILexicalBlock(scope: !758, file: !552, line: 72, column: 85)
!758 = distinct !DILexicalBlock(scope: !754, file: !552, line: 72, column: 62)
!759 = !DISubprogram(name: "tb_dir", scope: !552, file: !552, line: 30, type: !760, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._traceback*)* @tb_dir, variables: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!36, !479}
!762 = !{!763}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !759, file: !552, line: 30, type: !479)
!764 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !765, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !770)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !767, !572}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!770 = !{!771, !772}
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !764, file: !4, line: 59, type: !767)
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !764, file: !4, line: 59, type: !572)
!773 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !774, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !572}
!776 = !{!777}
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !773, file: !4, line: 51, type: !572)
!778 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !774, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !779)
!779 = !{!780}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !778, file: !4, line: 44, type: !572)
!781 = !DISubprogram(name: "newtracebackobject", scope: !552, file: !552, line: 111, type: !782, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: %struct._traceback* (%struct._traceback*, %struct._frame*)* @newtracebackobject, variables: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{!479, !479, !555}
!784 = !{!785, !786, !787, !788, !792}
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "next", arg: 1, scope: !781, file: !552, line: 111, type: !479)
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 2, scope: !781, file: !552, line: 111, type: !555)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !781, file: !552, line: 113, type: !479)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !789, file: !552, line: 121, type: !36)
!789 = distinct !DILexicalBlock(scope: !790, file: !552, line: 121, column: 12)
!790 = distinct !DILexicalBlock(scope: !791, file: !552, line: 120, column: 27)
!791 = distinct !DILexicalBlock(scope: !781, file: !552, line: 120, column: 9)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !793, file: !552, line: 123, type: !36)
!793 = distinct !DILexicalBlock(scope: !790, file: !552, line: 123, column: 12)
!794 = !DISubprogram(name: "_Py_FindSourceFile", scope: !552, file: !552, line: 146, type: !795, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i64, %struct._object*)* @_Py_FindSourceFile, variables: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!36, !36, !83, !126, !36}
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !821, !823}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !794, file: !552, line: 146, type: !36)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "namebuf", arg: 2, scope: !794, file: !552, line: 146, type: !83)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "namelen", arg: 3, scope: !794, file: !552, line: 146, type: !126)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "io", arg: 4, scope: !794, file: !552, line: 146, type: !36)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !794, file: !552, line: 148, type: !42)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binary", scope: !794, file: !552, line: 149, type: !36)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !794, file: !552, line: 150, type: !36)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "npath", scope: !794, file: !552, line: 151, type: !42)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "taillen", scope: !794, file: !552, line: 152, type: !126)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "syspath", scope: !794, file: !552, line: 153, type: !36)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !794, file: !552, line: 154, type: !36)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !794, file: !552, line: 155, type: !60)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filebytes", scope: !794, file: !552, line: 156, type: !36)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filepath", scope: !794, file: !552, line: 157, type: !60)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !794, file: !552, line: 158, type: !42)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !794, file: !552, line: 159, type: !36)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !552, line: 196, type: !36)
!815 = distinct !DILexicalBlock(scope: !816, file: !552, line: 196, column: 16)
!816 = distinct !DILexicalBlock(scope: !817, file: !552, line: 195, column: 71)
!817 = distinct !DILexicalBlock(scope: !818, file: !552, line: 195, column: 13)
!818 = distinct !DILexicalBlock(scope: !819, file: !552, line: 181, column: 33)
!819 = distinct !DILexicalBlock(scope: !820, file: !552, line: 181, column: 5)
!820 = distinct !DILexicalBlock(scope: !794, file: !552, line: 181, column: 5)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !822, file: !552, line: 200, type: !36)
!822 = distinct !DILexicalBlock(scope: !818, file: !552, line: 200, column: 12)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !552, line: 219, type: !36)
!824 = distinct !DILexicalBlock(scope: !794, file: !552, line: 219, column: 8)
!825 = !DISubprogram(name: "tb_printinternal", scope: !552, file: !552, line: 370, type: !826, isLocal: true, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._traceback*, %struct._object*, i64)* @tb_printinternal, variables: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{!75, !479, !36, !48}
!828 = !{!829, !830, !831, !832, !833, !834}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 1, scope: !825, file: !552, line: 370, type: !479)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !825, file: !552, line: 370, type: !36)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 3, scope: !825, file: !552, line: 370, type: !48)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !825, file: !552, line: 372, type: !75)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !825, file: !552, line: 373, type: !48)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb1", scope: !825, file: !552, line: 374, type: !479)
!835 = !DISubprogram(name: "tb_displayline", scope: !552, file: !552, line: 348, type: !836, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32, %struct._object*)* @tb_displayline, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!75, !36, !36, !75, !36}
!838 = !{!839, !840, !841, !842, !843, !844, !845}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !835, file: !552, line: 348, type: !36)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !835, file: !552, line: 348, type: !36)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 3, scope: !835, file: !552, line: 348, type: !75)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 4, scope: !835, file: !552, line: 348, type: !36)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !835, file: !552, line: 350, type: !75)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !835, file: !552, line: 351, type: !36)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !846, file: !552, line: 360, type: !36)
!846 = distinct !DILexicalBlock(scope: !835, file: !552, line: 360, column: 8)
!847 = !DISubprogram(name: "dump_traceback", scope: !552, file: !552, line: 603, type: !848, isLocal: true, isDefinition: true, scopeLine: 604, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct._ts*, i32)* @dump_traceback, variables: !850)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !75, !19, !75}
!850 = !{!851, !852, !853, !854, !855}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !847, file: !552, line: 603, type: !75)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tstate", arg: 2, scope: !847, file: !552, line: 603, type: !19)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "write_header", arg: 3, scope: !847, file: !552, line: 603, type: !75)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame", scope: !847, file: !552, line: 605, type: !555)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !847, file: !552, line: 606, type: !380)
!856 = !DISubprogram(name: "dump_frame", scope: !552, file: !552, line: 570, type: !857, isLocal: true, isDefinition: true, scopeLine: 571, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct._frame*)* @dump_frame, variables: !859)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !75, !555}
!859 = !{!860, !861, !862, !863}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !856, file: !552, line: 570, type: !75)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 2, scope: !856, file: !552, line: 570, type: !555)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !856, file: !552, line: 572, type: !401)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineno", scope: !856, file: !552, line: 573, type: !75)
!864 = !DISubprogram(name: "dump_ascii", scope: !552, file: !552, line: 502, type: !865, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct._object*)* @dump_ascii, variables: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !75, !36}
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !864, file: !552, line: 502, type: !75)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 2, scope: !864, file: !552, line: 502, type: !36)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ascii", scope: !864, file: !552, line: 504, type: !491)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !864, file: !552, line: 505, type: !42)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !864, file: !552, line: 505, type: !42)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "truncated", scope: !864, file: !552, line: 506, type: !75)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !864, file: !552, line: 507, type: !75)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !864, file: !552, line: 508, type: !121)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wstr", scope: !864, file: !552, line: 509, type: !507)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !864, file: !552, line: 510, type: !534)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !879, file: !552, line: 545, type: !62)
!879 = distinct !DILexicalBlock(scope: !880, file: !552, line: 544, column: 23)
!880 = distinct !DILexicalBlock(scope: !881, file: !552, line: 544, column: 13)
!881 = distinct !DILexicalBlock(scope: !882, file: !552, line: 539, column: 30)
!882 = distinct !DILexicalBlock(scope: !883, file: !552, line: 539, column: 5)
!883 = distinct !DILexicalBlock(scope: !864, file: !552, line: 539, column: 5)
!884 = !DISubprogram(name: "dump_hexadecimal", scope: !552, file: !552, line: 483, type: !885, isLocal: true, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i64, i32)* @dump_hexadecimal, variables: !887)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !75, !128, !75}
!887 = !{!888, !889, !890, !891, !892}
!888 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !884, file: !552, line: 483, type: !75)
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !884, file: !552, line: 483, type: !128)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "width", arg: 3, scope: !884, file: !552, line: 483, type: !75)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !884, file: !552, line: 485, type: !75)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !884, file: !552, line: 486, type: !893)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 136, align: 8, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 17)
!896 = !DISubprogram(name: "reverse_string", scope: !552, file: !552, line: 442, type: !897, isLocal: true, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i64)* @reverse_string, variables: !900)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !83, !899}
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!900 = !{!901, !902, !903, !904, !905}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !896, file: !552, line: 442, type: !83)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !896, file: !552, line: 442, type: !899)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !896, file: !552, line: 444, type: !62)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !896, file: !552, line: 445, type: !126)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !896, file: !552, line: 445, type: !126)
!906 = !DISubprogram(name: "dump_decimal", scope: !552, file: !552, line: 461, type: !907, isLocal: true, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32)* @dump_decimal, variables: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !75, !75}
!909 = !{!910, !911, !912, !916}
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !906, file: !552, line: 461, type: !75)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !906, file: !552, line: 461, type: !75)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !906, file: !552, line: 463, type: !913)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 56, align: 8, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 7)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !906, file: !552, line: 464, type: !75)
!917 = !DISubprogram(name: "write_thread_id", scope: !552, file: !552, line: 641, type: !848, isLocal: true, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct._ts*, i32)* @write_thread_id, variables: !918)
!918 = !{!919, !920, !921}
!919 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !917, file: !552, line: 641, type: !75)
!920 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tstate", arg: 2, scope: !917, file: !552, line: 641, type: !19)
!921 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_current", arg: 3, scope: !917, file: !552, line: 641, type: !75)
!922 = !{!923, !925, !930, !935, !943, !944, !945}
!923 = !DIGlobalVariable(name: "PyTraceBack_Type", scope: !0, file: !552, line: 75, type: !924, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyTraceBack_Type)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !38, line: 422, baseType: !51)
