; ModuleID = 'programs_new/Python-new/tupleobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !448, globals: !926)
!1 = !DIFile(filename: "tupleobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !22, !107, !358, !28, !366, !380, !381, !233, !439, !440}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 62, baseType: !21)
!20 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !24, line: 109, baseType: !25)
!24 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !24, line: 105, size: 128, align: 64, elements: !26)
!26 = !{!27, !35}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !25, file: !24, line: 107, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !29, line: 177, baseType: !30)
!29 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !31, line: 102, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !33, line: 181, baseType: !34)
!33 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !25, file: !24, line: 108, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !24, line: 334, size: 3200, align: 64, elements: !38)
!38 = !{!39, !45, !49, !50, !51, !56, !117, !122, !127, !128, !133, !185, !216, !228, !234, !235, !236, !238, !240, !271, !272, !273, !282, !283, !288, !289, !291, !293, !303, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !37, file: !24, line: 335, baseType: !40, size: 192, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !24, line: 114, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 111, size: 192, align: 64, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !41, file: !24, line: 112, baseType: !23, size: 128, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !41, file: !24, line: 113, baseType: !28, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !37, file: !24, line: 336, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !37, file: !24, line: 337, baseType: !28, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !37, file: !24, line: 337, baseType: !28, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !37, file: !24, line: 341, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !24, line: 308, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !22}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !37, file: !24, line: 342, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !24, line: 314, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !22, !62, !61}
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 48, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 246, size: 1728, align: 64, elements: !66)
!65 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!66 = !{!67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !93, !95, !97, !101, !104, !106, !108, !109, !110, !111, !112, !113}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 247, baseType: !61, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 252, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 253, baseType: !69, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 254, baseType: !69, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 255, baseType: !69, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 256, baseType: !69, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 257, baseType: !69, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 258, baseType: !69, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 259, baseType: !69, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 261, baseType: !69, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 262, baseType: !69, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 263, baseType: !69, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 265, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 161, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !65, line: 162, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !65, line: 163, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !65, line: 167, baseType: !61, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 267, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 269, baseType: !61, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 273, baseType: !61, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 275, baseType: !92, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !33, line: 140, baseType: !34)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 279, baseType: !94, size: 16, align: 16, offset: 1024)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 280, baseType: !96, size: 8, align: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 281, baseType: !98, size: 8, align: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 285, baseType: !102, size: 64, align: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 155, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 294, baseType: !105, size: 64, align: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !33, line: 141, baseType: !34)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !64, file: !65, line: 303, baseType: !107, size: 64, align: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !64, file: !65, line: 304, baseType: !107, size: 64, align: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !64, file: !65, line: 305, baseType: !107, size: 64, align: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !64, file: !65, line: 306, baseType: !107, size: 64, align: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 307, baseType: !19, size: 64, align: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 309, baseType: !61, size: 32, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 311, baseType: !114, size: 160, align: 8, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !37, file: !24, line: 343, baseType: !118, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !24, line: 316, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!22, !22, !69}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !37, file: !24, line: 344, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !24, line: 318, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!61, !22, !69, !22}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !37, file: !24, line: 345, baseType: !107, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !37, file: !24, line: 346, baseType: !129, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !24, line: 320, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!22, !22}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !37, file: !24, line: 350, baseType: !134, size: 64, align: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !24, line: 278, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 236, size: 2176, align: 64, elements: !137)
!137 = !{!138, !143, !144, !145, !146, !147, !152, !154, !155, !156, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !136, file: !24, line: 241, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !24, line: 166, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!22, !22, !22}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !136, file: !24, line: 242, baseType: !139, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !136, file: !24, line: 243, baseType: !139, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !136, file: !24, line: 244, baseType: !139, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !136, file: !24, line: 245, baseType: !139, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !136, file: !24, line: 246, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !24, line: 167, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!22, !22, !22, !22}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !136, file: !24, line: 247, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !24, line: 165, baseType: !130)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !136, file: !24, line: 248, baseType: !153, size: 64, align: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !136, file: !24, line: 249, baseType: !153, size: 64, align: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !136, file: !24, line: 250, baseType: !157, size: 64, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !24, line: 168, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!61, !22}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !136, file: !24, line: 251, baseType: !153, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !136, file: !24, line: 252, baseType: !139, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !136, file: !24, line: 253, baseType: !139, size: 64, align: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !136, file: !24, line: 254, baseType: !139, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !136, file: !24, line: 255, baseType: !139, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !136, file: !24, line: 256, baseType: !139, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !136, file: !24, line: 257, baseType: !153, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !136, file: !24, line: 258, baseType: !107, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !136, file: !24, line: 259, baseType: !153, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !136, file: !24, line: 261, baseType: !139, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !136, file: !24, line: 262, baseType: !139, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !136, file: !24, line: 263, baseType: !139, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !136, file: !24, line: 264, baseType: !139, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !136, file: !24, line: 265, baseType: !148, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !136, file: !24, line: 266, baseType: !139, size: 64, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !136, file: !24, line: 267, baseType: !139, size: 64, align: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !136, file: !24, line: 268, baseType: !139, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !136, file: !24, line: 269, baseType: !139, size: 64, align: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !136, file: !24, line: 270, baseType: !139, size: 64, align: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !136, file: !24, line: 272, baseType: !139, size: 64, align: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !136, file: !24, line: 273, baseType: !139, size: 64, align: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !136, file: !24, line: 274, baseType: !139, size: 64, align: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !136, file: !24, line: 275, baseType: !139, size: 64, align: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !136, file: !24, line: 277, baseType: !153, size: 64, align: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !37, file: !24, line: 351, baseType: !186, size: 64, align: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !24, line: 292, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 280, size: 640, align: 64, elements: !189)
!189 = !{!190, !195, !196, !201, !202, !203, !208, !209, !214, !215}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !188, file: !24, line: 281, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !24, line: 169, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!28, !22}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !188, file: !24, line: 282, baseType: !139, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !188, file: !24, line: 283, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !24, line: 170, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!22, !22, !28}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !188, file: !24, line: 284, baseType: !197, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !188, file: !24, line: 285, baseType: !107, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !188, file: !24, line: 286, baseType: !204, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !24, line: 172, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!61, !22, !28, !22}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !188, file: !24, line: 287, baseType: !107, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !188, file: !24, line: 288, baseType: !210, size: 64, align: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !24, line: 231, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!61, !22, !22}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !188, file: !24, line: 290, baseType: !139, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !188, file: !24, line: 291, baseType: !197, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !37, file: !24, line: 352, baseType: !217, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !24, line: 298, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 294, size: 192, align: 64, elements: !220)
!220 = !{!221, !222, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !219, file: !24, line: 295, baseType: !191, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !219, file: !24, line: 296, baseType: !139, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !219, file: !24, line: 297, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !24, line: 174, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!61, !22, !22, !22}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !37, file: !24, line: 356, baseType: !229, size: 64, align: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !24, line: 321, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !22}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !29, line: 186, baseType: !28)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !37, file: !24, line: 357, baseType: !148, size: 64, align: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !37, file: !24, line: 358, baseType: !129, size: 64, align: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !37, file: !24, line: 359, baseType: !237, size: 64, align: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !24, line: 317, baseType: !140)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !37, file: !24, line: 360, baseType: !239, size: 64, align: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !24, line: 319, baseType: !225)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !37, file: !24, line: 363, baseType: !241, size: 64, align: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !24, line: 304, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 301, size: 128, align: 64, elements: !244)
!244 = !{!245, !266}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !243, file: !24, line: 302, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !24, line: 193, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!61, !22, !250, !61}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !24, line: 191, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !24, line: 178, size: 640, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !263, !264, !265}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !252, file: !24, line: 179, baseType: !107, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !252, file: !24, line: 180, baseType: !22, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !24, line: 181, baseType: !28, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !252, file: !24, line: 182, baseType: !28, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !252, file: !24, line: 184, baseType: !61, size: 32, align: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !252, file: !24, line: 185, baseType: !61, size: 32, align: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !252, file: !24, line: 186, baseType: !69, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !252, file: !24, line: 187, baseType: !262, size: 64, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !252, file: !24, line: 188, baseType: !262, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !252, file: !24, line: 189, baseType: !262, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !252, file: !24, line: 190, baseType: !107, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !243, file: !24, line: 303, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !24, line: 194, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !22, !250}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !37, file: !24, line: 366, baseType: !21, size: 64, align: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !37, file: !24, line: 368, baseType: !46, size: 64, align: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !37, file: !24, line: 372, baseType: !274, size: 64, align: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !24, line: 233, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!61, !22, !278, !107}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !24, line: 232, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!61, !22, !107}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !37, file: !24, line: 375, baseType: !157, size: 64, align: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !37, file: !24, line: 379, baseType: !284, size: 64, align: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !24, line: 322, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!22, !22, !22, !61}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !37, file: !24, line: 382, baseType: !28, size: 64, align: 64, offset: 1664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !37, file: !24, line: 385, baseType: !290, size: 64, align: 64, offset: 1728)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !24, line: 323, baseType: !130)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !37, file: !24, line: 386, baseType: !292, size: 64, align: 64, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !24, line: 324, baseType: !130)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !37, file: !24, line: 389, baseType: !294, size: 64, align: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !296, line: 40, size: 256, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!297 = !{!298, !299, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !295, file: !296, line: 41, baseType: !46, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !295, file: !296, line: 42, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !296, line: 18, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !295, file: !296, line: 43, baseType: !61, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !295, file: !296, line: 45, baseType: !46, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !37, file: !24, line: 390, baseType: !304, size: 64, align: 64, offset: 1920)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !24, line: 390, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !37, file: !24, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !69, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!22, !22, !107}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!61, !22, !22, !107}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !69, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !107, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !37, file: !24, line: 392, baseType: !36, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !37, file: !24, line: 393, baseType: !22, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !37, file: !24, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !24, line: 325, baseType: !149)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !37, file: !24, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !24, line: 326, baseType: !225)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !37, file: !24, line: 396, baseType: !28, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !37, file: !24, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !24, line: 327, baseType: !225)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !37, file: !24, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !24, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!22, !36, !28}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !37, file: !24, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !24, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!22, !36, !22, !22}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !37, file: !24, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !24, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !107}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !37, file: !24, line: 401, baseType: !157, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !37, file: !24, line: 402, baseType: !22, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !37, file: !24, line: 403, baseType: !22, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !37, file: !24, line: 404, baseType: !22, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !37, file: !24, line: 405, baseType: !22, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !37, file: !24, line: 406, baseType: !22, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !37, file: !24, line: 407, baseType: !52, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !37, file: !24, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !37, file: !24, line: 412, baseType: !52, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !360, line: 33, baseType: !361)
!360 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 25, size: 256, align: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 26, baseType: !40, size: 192, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !361, file: !360, line: 27, baseType: !365, size: 64, align: 64, offset: 192)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, align: 64, elements: !99)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !368, line: 253, baseType: !369)
!368 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !368, line: 246, size: 192, align: 64, elements: !370)
!370 = !{!371, !378}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !369, file: !368, line: 251, baseType: !372, size: 192, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !368, line: 247, size: 192, align: 64, elements: !373)
!373 = !{!374, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !372, file: !368, line: 248, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !372, file: !368, line: 249, baseType: !375, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !372, file: !368, line: 250, baseType: !28, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !369, file: !368, line: 252, baseType: !379, size: 64, align: 64)
!379 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !383, line: 139, baseType: !384)
!383 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !383, line: 69, size: 1536, align: 64, elements: !385)
!385 = !{!386, !388, !389, !409, !412, !413, !414, !415, !416, !417, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !383, line: 72, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !383, line: 73, baseType: !387, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !384, file: !383, line: 74, baseType: !390, size: 64, align: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !383, line: 44, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !383, line: 19, size: 832, align: 64, elements: !393)
!393 = !{!394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !383, line: 21, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !392, file: !383, line: 22, baseType: !387, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !392, file: !383, line: 24, baseType: !22, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !392, file: !383, line: 25, baseType: !22, size: 64, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !392, file: !383, line: 26, baseType: !22, size: 64, align: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !392, file: !383, line: 27, baseType: !22, size: 64, align: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !392, file: !383, line: 28, baseType: !22, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !392, file: !383, line: 30, baseType: !22, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !392, file: !383, line: 31, baseType: !22, size: 64, align: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !392, file: !383, line: 32, baseType: !22, size: 64, align: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !392, file: !383, line: 33, baseType: !61, size: 32, align: 32, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !392, file: !383, line: 34, baseType: !61, size: 32, align: 32, offset: 672)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !392, file: !383, line: 37, baseType: !61, size: 32, align: 32, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !392, file: !383, line: 43, baseType: !22, size: 64, align: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !384, file: !383, line: 76, baseType: !410, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !383, line: 50, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !384, file: !383, line: 77, baseType: !61, size: 32, align: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !384, file: !383, line: 78, baseType: !48, size: 8, align: 8, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !384, file: !383, line: 80, baseType: !48, size: 8, align: 8, offset: 296)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !384, file: !383, line: 85, baseType: !61, size: 32, align: 32, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !384, file: !383, line: 86, baseType: !61, size: 32, align: 32, offset: 352)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !384, file: !383, line: 88, baseType: !418, size: 64, align: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !383, line: 54, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!61, !22, !410, !61, !22}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !384, file: !383, line: 89, baseType: !418, size: 64, align: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !384, file: !383, line: 90, baseType: !22, size: 64, align: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !384, file: !383, line: 91, baseType: !22, size: 64, align: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !384, file: !383, line: 93, baseType: !22, size: 64, align: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !384, file: !383, line: 94, baseType: !22, size: 64, align: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !384, file: !383, line: 95, baseType: !22, size: 64, align: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !384, file: !383, line: 97, baseType: !22, size: 64, align: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !384, file: !383, line: 98, baseType: !22, size: 64, align: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !384, file: !383, line: 99, baseType: !22, size: 64, align: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !384, file: !383, line: 101, baseType: !22, size: 64, align: 64, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !384, file: !383, line: 103, baseType: !61, size: 32, align: 32, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !384, file: !383, line: 105, baseType: !22, size: 64, align: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !384, file: !383, line: 106, baseType: !34, size: 64, align: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !384, file: !383, line: 108, baseType: !61, size: 32, align: 32, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !384, file: !383, line: 109, baseType: !22, size: 64, align: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !384, file: !383, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !384, file: !383, line: 135, baseType: !107, size: 64, align: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !29, line: 189, baseType: !19)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "tupleiterobject", file: !442, line: 943, baseType: !443)
!442 = !DIFile(filename: "Objects/tupleobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 939, size: 256, align: 64, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !443, file: !442, line: 940, baseType: !23, size: 128, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "it_index", scope: !443, file: !442, line: 941, baseType: !28, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "it_seq", scope: !443, file: !442, line: 942, baseType: !358, size: 64, align: 64, offset: 192)
!448 = !{!449, !459, !468, !471, !475, !502, !514, !536, !543, !578, !589, !599, !615, !646, !655, !660, !663, !714, !719, !738, !750, !754, !762, !781, !791, !805, !823, !826, !830, !842, !852, !862, !874, !886, !897, !906, !910, !913, !920}
!449 = !DISubprogram(name: "_PyTuple_DebugMallocStats", scope: !442, file: !442, line: 50, type: !450, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyTuple_DebugMallocStats, variables: !452)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !62}
!452 = !{!453, !454, !455}
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !449, file: !442, line: 50, type: !62)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !449, file: !442, line: 53, type: !61)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !449, file: !442, line: 54, type: !456)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 1024, align: 8, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 128)
!459 = !DISubprogram(name: "PyTuple_New", scope: !442, file: !442, line: 66, type: !460, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyTuple_New, variables: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!22, !28}
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !459, file: !442, line: 66, type: !28)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !459, file: !442, line: 68, type: !358)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !459, file: !442, line: 69, type: !28)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !467, file: !442, line: 120, type: !366)
!467 = distinct !DILexicalBlock(scope: !459, file: !442, line: 120, column: 8)
!468 = !DISubprogram(name: "PyTuple_Size", scope: !442, file: !442, line: 125, type: !193, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyTuple_Size, variables: !469)
!469 = !{!470}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !468, file: !442, line: 125, type: !22)
!471 = !DISubprogram(name: "PyTuple_GetItem", scope: !442, file: !442, line: 136, type: !199, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @PyTuple_GetItem, variables: !472)
!472 = !{!473, !474}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !471, file: !442, line: 136, type: !22)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !471, file: !442, line: 136, type: !28)
!475 = !DISubprogram(name: "PyTuple_SetItem", scope: !442, file: !442, line: 150, type: !206, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, %struct._object*)* @PyTuple_SetItem, variables: !476)
!476 = !{!477, !478, !479, !480, !481, !483, !487, !490, !494, !497, !499}
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !475, file: !442, line: 150, type: !22)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !475, file: !442, line: 150, type: !28)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newitem", arg: 3, scope: !475, file: !442, line: 150, type: !22)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "olditem", scope: !475, file: !442, line: 152, type: !22)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !475, file: !442, line: 153, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !484, file: !442, line: 155, type: !22)
!484 = distinct !DILexicalBlock(scope: !485, file: !442, line: 155, column: 12)
!485 = distinct !DILexicalBlock(scope: !486, file: !442, line: 154, column: 99)
!486 = distinct !DILexicalBlock(scope: !475, file: !442, line: 154, column: 9)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !488, file: !442, line: 155, type: !22)
!488 = distinct !DILexicalBlock(scope: !489, file: !442, line: 155, column: 103)
!489 = distinct !DILexicalBlock(scope: !484, file: !442, line: 155, column: 69)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !491, file: !442, line: 160, type: !22)
!491 = distinct !DILexicalBlock(scope: !492, file: !442, line: 160, column: 12)
!492 = distinct !DILexicalBlock(scope: !493, file: !442, line: 159, column: 56)
!493 = distinct !DILexicalBlock(scope: !475, file: !442, line: 159, column: 9)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !495, file: !442, line: 160, type: !22)
!495 = distinct !DILexicalBlock(scope: !496, file: !442, line: 160, column: 103)
!496 = distinct !DILexicalBlock(scope: !491, file: !442, line: 160, column: 69)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !498, file: !442, line: 168, type: !22)
!498 = distinct !DILexicalBlock(scope: !475, file: !442, line: 168, column: 8)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !500, file: !442, line: 168, type: !22)
!500 = distinct !DILexicalBlock(scope: !501, file: !442, line: 168, column: 99)
!501 = distinct !DILexicalBlock(scope: !498, file: !442, line: 168, column: 65)
!502 = !DISubprogram(name: "_PyTuple_MaybeUntrack", scope: !442, file: !442, line: 173, type: !54, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyTuple_MaybeUntrack, variables: !503)
!503 = !{!504, !505, !506, !507, !508, !512}
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !502, file: !442, line: 173, type: !22)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !502, file: !442, line: 175, type: !358)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !502, file: !442, line: 176, type: !28)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !502, file: !442, line: 176, type: !28)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elt", scope: !509, file: !442, line: 183, type: !22)
!509 = distinct !DILexicalBlock(scope: !510, file: !442, line: 182, column: 29)
!510 = distinct !DILexicalBlock(scope: !511, file: !442, line: 182, column: 5)
!511 = distinct !DILexicalBlock(scope: !502, file: !442, line: 182, column: 5)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !513, file: !442, line: 195, type: !366)
!513 = distinct !DILexicalBlock(scope: !502, file: !442, line: 195, column: 8)
!514 = !DISubprogram(name: "PyTuple_Pack", scope: !442, file: !442, line: 199, type: !515, isLocal: false, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64, ...)* @PyTuple_Pack, variables: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{!22, !28, null}
!517 = !{!518, !519, !520, !521, !522, !523}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !514, file: !442, line: 199, type: !28)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !514, file: !442, line: 201, type: !28)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !514, file: !442, line: 202, type: !22)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !514, file: !442, line: 203, type: !22)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !514, file: !442, line: 204, type: !482)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !514, file: !442, line: 205, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !31, line: 79, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !526, line: 50, baseType: !527)
!526 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 205, baseType: !528)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 192, align: 64, elements: !99)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 205, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 205, size: 192, align: 64, elements: !531)
!531 = !{!532, !533, !534, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !530, file: !1, line: 205, baseType: !356, size: 32, align: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !530, file: !1, line: 205, baseType: !356, size: 32, align: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !530, file: !1, line: 205, baseType: !107, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !530, file: !1, line: 205, baseType: !107, size: 64, align: 64, offset: 128)
!536 = !DISubprogram(name: "PyTuple_GetSlice", scope: !442, file: !442, line: 426, type: !537, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64, i64)* @PyTuple_GetSlice, variables: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!22, !22, !28, !28}
!539 = !{!540, !541, !542}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !536, file: !442, line: 426, type: !22)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !536, file: !442, line: 426, type: !28)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "j", arg: 3, scope: !536, file: !442, line: 426, type: !28)
!543 = !DISubprogram(name: "_PyTuple_Resize", scope: !442, file: !442, line: 847, type: !544, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**, i64)* @_PyTuple_Resize, variables: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!61, !482, !28}
!546 = !{!547, !548, !549, !550, !551, !552, !553, !557, !560, !564, !567, !572, !576}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !543, file: !442, line: 847, type: !482)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newsize", arg: 2, scope: !543, file: !442, line: 847, type: !28)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !543, file: !442, line: 849, type: !358)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sv", scope: !543, file: !442, line: 850, type: !358)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !543, file: !442, line: 851, type: !28)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldsize", scope: !543, file: !442, line: 852, type: !28)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !554, file: !442, line: 858, type: !22)
!554 = distinct !DILexicalBlock(scope: !555, file: !442, line: 858, column: 12)
!555 = distinct !DILexicalBlock(scope: !556, file: !442, line: 856, column: 86)
!556 = distinct !DILexicalBlock(scope: !543, file: !442, line: 855, column: 9)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !558, file: !442, line: 858, type: !22)
!558 = distinct !DILexicalBlock(scope: !559, file: !442, line: 858, column: 97)
!559 = distinct !DILexicalBlock(scope: !554, file: !442, line: 858, column: 63)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !561, file: !442, line: 870, type: !22)
!561 = distinct !DILexicalBlock(scope: !562, file: !442, line: 870, column: 12)
!562 = distinct !DILexicalBlock(scope: !563, file: !442, line: 866, column: 23)
!563 = distinct !DILexicalBlock(scope: !543, file: !442, line: 866, column: 9)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !565, file: !442, line: 878, type: !366)
!565 = distinct !DILexicalBlock(scope: !566, file: !442, line: 878, column: 12)
!566 = distinct !DILexicalBlock(scope: !543, file: !442, line: 877, column: 9)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !568, file: !442, line: 882, type: !22)
!568 = distinct !DILexicalBlock(scope: !569, file: !442, line: 882, column: 12)
!569 = distinct !DILexicalBlock(scope: !570, file: !442, line: 881, column: 41)
!570 = distinct !DILexicalBlock(scope: !571, file: !442, line: 881, column: 5)
!571 = distinct !DILexicalBlock(scope: !543, file: !442, line: 881, column: 5)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !573, file: !442, line: 882, type: !22)
!573 = distinct !DILexicalBlock(scope: !574, file: !442, line: 882, column: 125)
!574 = distinct !DILexicalBlock(scope: !575, file: !442, line: 882, column: 90)
!575 = distinct !DILexicalBlock(scope: !568, file: !442, line: 882, column: 67)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !577, file: !442, line: 896, type: !366)
!577 = distinct !DILexicalBlock(scope: !543, file: !442, line: 896, column: 8)
!578 = !DISubprogram(name: "PyTuple_ClearFreeList", scope: !442, file: !442, line: 901, type: !579, isLocal: false, isDefinition: true, scopeLine: 902, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyTuple_ClearFreeList, variables: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{!61}
!581 = !{!582, !583, !584, !588}
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freelist_size", scope: !578, file: !442, line: 903, type: !61)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !578, file: !442, line: 905, type: !61)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !585, file: !442, line: 907, type: !358)
!585 = distinct !DILexicalBlock(scope: !586, file: !442, line: 906, column: 30)
!586 = distinct !DILexicalBlock(scope: !587, file: !442, line: 906, column: 5)
!587 = distinct !DILexicalBlock(scope: !578, file: !442, line: 906, column: 5)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !585, file: !442, line: 907, type: !358)
!589 = !DISubprogram(name: "PyTuple_Fini", scope: !442, file: !442, line: 923, type: !590, isLocal: false, isDefinition: true, scopeLine: 924, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyTuple_Fini, variables: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{null}
!592 = !{!593, !595}
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !594, file: !442, line: 928, type: !22)
!594 = distinct !DILexicalBlock(scope: !589, file: !442, line: 928, column: 8)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !442, line: 928, type: !22)
!596 = distinct !DILexicalBlock(scope: !597, file: !442, line: 928, column: 119)
!597 = distinct !DILexicalBlock(scope: !598, file: !442, line: 928, column: 85)
!598 = distinct !DILexicalBlock(scope: !594, file: !442, line: 928, column: 62)
!599 = !DISubprogram(name: "tupleslice", scope: !442, file: !442, line: 394, type: !600, isLocal: true, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyTupleObject*, i64, i64)* @tupleslice, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!22, !358, !28, !28}
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !599, file: !442, line: 394, type: !358)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !599, file: !442, line: 394, type: !28)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !599, file: !442, line: 395, type: !28)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !599, file: !442, line: 397, type: !358)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !599, file: !442, line: 398, type: !482)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !599, file: !442, line: 398, type: !482)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !599, file: !442, line: 399, type: !28)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !599, file: !442, line: 400, type: !28)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !612, file: !442, line: 418, type: !22)
!612 = distinct !DILexicalBlock(scope: !613, file: !442, line: 417, column: 31)
!613 = distinct !DILexicalBlock(scope: !614, file: !442, line: 417, column: 5)
!614 = distinct !DILexicalBlock(scope: !599, file: !442, line: 417, column: 5)
!615 = !DISubprogram(name: "tupledealloc", scope: !442, file: !442, line: 227, type: !616, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyTupleObject*)* @tupledealloc, variables: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !358}
!618 = !{!619, !620, !621, !622, !624, !631, !632, !635, !637, !643}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !615, file: !442, line: 227, type: !358)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !615, file: !442, line: 229, type: !28)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !615, file: !442, line: 230, type: !28)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_tstate", scope: !623, file: !442, line: 232, type: !381)
!623 = distinct !DILexicalBlock(scope: !615, file: !442, line: 232, column: 8)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !625, file: !442, line: 232, type: !626)
!625 = distinct !DILexicalBlock(scope: !623, file: !442, line: 232, column: 67)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !628, file: !4, line: 32, baseType: !107, size: 64, align: 64)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !625, file: !442, line: 232, type: !107)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !625, file: !442, line: 232, type: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !625, file: !442, line: 232, type: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !638, file: !442, line: 236, type: !22)
!638 = distinct !DILexicalBlock(scope: !639, file: !442, line: 236, column: 16)
!639 = distinct !DILexicalBlock(scope: !640, file: !442, line: 233, column: 18)
!640 = distinct !DILexicalBlock(scope: !641, file: !442, line: 233, column: 9)
!641 = distinct !DILexicalBlock(scope: !642, file: !442, line: 232, column: 797)
!642 = distinct !DILexicalBlock(scope: !623, file: !442, line: 232, column: 761)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !644, file: !442, line: 236, type: !22)
!644 = distinct !DILexicalBlock(scope: !645, file: !442, line: 236, column: 114)
!645 = distinct !DILexicalBlock(scope: !638, file: !442, line: 236, column: 80)
!646 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !647, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !652)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !649, !636}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!652 = !{!653, !654}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !646, file: !4, line: 59, type: !649)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !646, file: !4, line: 59, type: !636)
!655 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !656, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !636}
!658 = !{!659}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !655, file: !4, line: 51, type: !636)
!660 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !656, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !661)
!661 = !{!662}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !660, file: !4, line: 44, type: !636)
!663 = !DISubprogram(name: "tuplerepr", scope: !442, file: !442, line: 255, type: !664, isLocal: true, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyTupleObject*)* @tuplerepr, variables: !666)
!664 = !DISubroutineType(types: !665)
!665 = !{!22, !358}
!666 = !{!667, !668, !669, !670, !686, !690, !693, !694, !695, !696, !700, !701, !702, !703, !705, !706, !707, !708, !712}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !663, file: !442, line: 255, type: !358)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !663, file: !442, line: 257, type: !28)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !663, file: !442, line: 257, type: !28)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writer", scope: !663, file: !442, line: 258, type: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !12, line: 917, baseType: !672)
!672 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 897, size: 448, align: 64, elements: !673)
!673 = !{!674, !675, !676, !677, !679, !680, !681, !682, !683, !685}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !672, file: !12, line: 898, baseType: !22, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !672, file: !12, line: 899, baseType: !107, size: 64, align: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !672, file: !12, line: 900, baseType: !11, size: 32, align: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !672, file: !12, line: 901, baseType: !678, size: 32, align: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !12, line: 121, baseType: !356)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !672, file: !12, line: 902, baseType: !28, size: 64, align: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !672, file: !12, line: 903, baseType: !28, size: 64, align: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !672, file: !12, line: 906, baseType: !28, size: 64, align: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !672, file: !12, line: 909, baseType: !678, size: 32, align: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !672, file: !12, line: 912, baseType: !684, size: 8, align: 8, offset: 416)
!684 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !672, file: !12, line: 916, baseType: !684, size: 8, align: 8, offset: 424)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !687, file: !442, line: 289, type: !22)
!687 = distinct !DILexicalBlock(scope: !688, file: !442, line: 288, column: 29)
!688 = distinct !DILexicalBlock(scope: !689, file: !442, line: 288, column: 5)
!689 = distinct !DILexicalBlock(scope: !663, file: !442, line: 288, column: 5)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !691, file: !442, line: 296, type: !626)
!691 = distinct !DILexicalBlock(scope: !692, file: !442, line: 296, column: 50)
!692 = distinct !DILexicalBlock(scope: !687, file: !442, line: 296, column: 13)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !691, file: !442, line: 296, type: !107)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !691, file: !442, line: 296, type: !633)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !691, file: !442, line: 296, type: !636)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !697, file: !442, line: 299, type: !626)
!697 = distinct !DILexicalBlock(scope: !698, file: !442, line: 299, column: 52)
!698 = distinct !DILexicalBlock(scope: !699, file: !442, line: 299, column: 16)
!699 = distinct !DILexicalBlock(scope: !687, file: !442, line: 299, column: 11)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !697, file: !442, line: 299, type: !107)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !697, file: !442, line: 299, type: !633)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !697, file: !442, line: 299, type: !636)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !704, file: !442, line: 299, type: !626)
!704 = distinct !DILexicalBlock(scope: !698, file: !442, line: 299, column: 901)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !704, file: !442, line: 299, type: !107)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !704, file: !442, line: 299, type: !633)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !704, file: !442, line: 299, type: !636)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !442, line: 304, type: !22)
!709 = distinct !DILexicalBlock(scope: !710, file: !442, line: 304, column: 16)
!710 = distinct !DILexicalBlock(scope: !711, file: !442, line: 303, column: 56)
!711 = distinct !DILexicalBlock(scope: !687, file: !442, line: 303, column: 13)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !442, line: 307, type: !22)
!713 = distinct !DILexicalBlock(scope: !687, file: !442, line: 307, column: 12)
!714 = !DISubprogram(name: "tuplelength", scope: !442, file: !442, line: 365, type: !715, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyTupleObject*)* @tuplelength, variables: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{!28, !358}
!717 = !{!718}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !714, file: !442, line: 365, type: !358)
!719 = !DISubprogram(name: "tupleconcat", scope: !442, file: !442, line: 436, type: !720, isLocal: true, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyTupleObject*, %struct._object*)* @tupleconcat, variables: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{!22, !358, !22}
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !734}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !719, file: !442, line: 436, type: !358)
