; ModuleID = 'irs-onlybc/unicodedata.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PyUnicode_DatabaseRecord = type { i8, i8, i8, i8, i8, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !439, globals: !864)
!1 = !DIFile(filename: "unicodedata.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !96, !357, !358, !387, !405, !408, !416, !432, !434, !50, !355, !376, !101, !436, !438, !35, !407, !426, !429, !428, !431}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!11, !11, !58}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!50, !11, !58, !11}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !96, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!11, !11}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!11, !11, !11}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!11, !11, !11, !11}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!50, !11}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !96, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !11}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!11, !11, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !96, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!50, !11, !17, !11}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !96, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!50, !11, !11}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!50, !11, !11, !11}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !11}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!50, !11, !242, !50}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !96, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !96, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !11, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !11, !270, !96}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!50, !11, !96}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!11, !11, !11, !50}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !298, line: 18, size: 320, align: 64, elements: !299)
!298 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !298, line: 19, baseType: !58, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !298, line: 20, baseType: !50, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !298, line: 21, baseType: !17, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !298, line: 22, baseType: !50, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !297, file: !298, line: 23, baseType: !58, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !58, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!11, !11, !96}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!50, !11, !11, !96}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !96, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!11, !25, !17}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!11, !25, !11, !11}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !96}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !355)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviousDBVersion", file: !360, line: 72, baseType: !361)
!360 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/unicodedata.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "previous_version", file: !360, line: 67, size: 320, align: 64, elements: !362)
!362 = !{!363, !364, !365, !383}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 68, baseType: !12, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !360, line: 69, baseType: !35, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "getrecord", scope: !361, file: !360, line: 70, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!369, !357}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "change_record", file: !360, line: 47, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "change_record", file: !360, line: 40, size: 128, align: 64, elements: !373)
!373 = !{!374, !377, !378, !379, !380}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_changed", scope: !372, file: !360, line: 42, baseType: !375, size: 8, align: 8)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "category_changed", scope: !372, file: !360, line: 43, baseType: !375, size: 8, align: 8, offset: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_changed", scope: !372, file: !360, line: 44, baseType: !375, size: 8, align: 8, offset: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mirrored_changed", scope: !372, file: !360, line: 45, baseType: !375, size: 8, align: 8, offset: 24)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "numeric_changed", scope: !372, file: !360, line: 46, baseType: !381, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "normalization", scope: !361, file: !360, line: 71, baseType: !384, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!357, !357}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394, !402}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !4, line: 291, baseType: !12, size: 128, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !389, file: !4, line: 292, baseType: !17, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !389, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !389, file: !4, line: 349, baseType: !395, size: 32, align: 32, offset: 256)
!395 = !DICompositeType(tag: DW_TAG_structure_type, scope: !389, file: !4, line: 294, size: 32, align: 32, elements: !396)
!396 = !{!397, !398, !399, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !395, file: !4, line: 303, baseType: !355, size: 2, align: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !395, file: !4, line: 331, baseType: !355, size: 3, align: 32, offset: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !395, file: !4, line: 336, baseType: !355, size: 1, align: 32, offset: 5)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !395, file: !4, line: 340, baseType: !355, size: 1, align: 32, offset: 6)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !395, file: !4, line: 345, baseType: !355, size: 1, align: 32, offset: 7)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !389, file: !4, line: 350, baseType: !403, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !50)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !376)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !410, file: !4, line: 357, baseType: !388, size: 384, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !410, file: !4, line: 358, baseType: !17, size: 64, align: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !410, file: !4, line: 360, baseType: !58, size: 64, align: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !410, file: !4, line: 361, baseType: !17, size: 64, align: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !418)
!418 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !418, file: !4, line: 369, baseType: !409, size: 576, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !4, line: 375, baseType: !422, size: 64, align: 64, offset: 576)
!422 = !DICompositeType(tag: DW_TAG_union_type, scope: !418, file: !4, line: 370, size: 64, align: 64, elements: !423)
!423 = !{!424, !425, !427, !430}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !422, file: !4, line: 371, baseType: !96, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !422, file: !4, line: 372, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !422, file: !4, line: 373, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !83)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !422, file: !4, line: 374, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!439 = !{!440, !446, !455, !468, !473, !481, !493, !503, !520, !530, !540, !550, !560, !578, !586, !609, !614, !622, !643, !659, !669, !679, !686, !720, !739, !775, !798, !840, !849, !857, !861}
!440 = !DISubprogram(name: "PyInit_unicodedata", scope: !360, file: !360, line: 1387, type: !441, isLocal: false, isDefinition: true, scopeLine: 1388, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_unicodedata, variables: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!11}
!443 = !{!444, !445}
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !440, file: !360, line: 1389, type: !11)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !440, file: !360, line: 1389, type: !11)
!446 = !DISubprogram(name: "unicodedata_UCD_decimal", scope: !360, file: !360, line: 148, type: !447, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.previous_version*, %struct._object*)* @unicodedata_UCD_decimal, variables: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{!11, !358, !11}
!449 = !{!450, !451, !452, !453, !454}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !446, file: !360, line: 148, type: !358)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !446, file: !360, line: 148, type: !11)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !446, file: !360, line: 150, type: !11)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unichr", scope: !446, file: !360, line: 151, type: !416)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_value", scope: !446, file: !360, line: 152, type: !11)
!455 = !DISubprogram(name: "unicodedata_UCD_decimal_impl", scope: !360, file: !360, line: 165, type: !456, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.previous_version*, %struct.PyUnicodeObject*, %struct._object*)* @unicodedata_UCD_decimal_impl, variables: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!11, !358, !416, !11}
!458 = !{!459, !460, !461, !462, !463, !464, !465}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !455, file: !360, line: 165, type: !358)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unichr", arg: 2, scope: !455, file: !360, line: 165, type: !416)
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "default_value", arg: 3, scope: !455, file: !360, line: 165, type: !11)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "have_old", scope: !455, file: !360, line: 168, type: !50)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !455, file: !360, line: 169, type: !23)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !455, file: !360, line: 170, type: !357)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !466, file: !360, line: 177, type: !369)
!466 = distinct !DILexicalBlock(scope: !467, file: !360, line: 176, column: 62)
!467 = distinct !DILexicalBlock(scope: !455, file: !360, line: 176, column: 9)
!468 = !DISubprogram(name: "getuchar", scope: !360, file: !360, line: 100, type: !469, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyUnicodeObject*)* @getuchar, variables: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{!357, !416}
!471 = !{!472}
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !468, file: !360, line: 100, type: !416)
!473 = !DISubprogram(name: "unicodedata_digit", scope: !360, file: !360, line: 213, type: !133, isLocal: true, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_digit, variables: !474)
!474 = !{!475, !476, !477, !478, !479, !480}
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !473, file: !360, line: 213, type: !11)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !473, file: !360, line: 213, type: !11)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !473, file: !360, line: 215, type: !416)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defobj", scope: !473, file: !360, line: 216, type: !11)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !473, file: !360, line: 217, type: !23)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !473, file: !360, line: 218, type: !357)
!481 = !DISubprogram(name: "unicodedata_numeric", scope: !360, file: !360, line: 247, type: !133, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_numeric, variables: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !481, file: !360, line: 247, type: !11)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !481, file: !360, line: 247, type: !11)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !481, file: !360, line: 249, type: !416)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defobj", scope: !481, file: !360, line: 250, type: !11)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "have_old", scope: !481, file: !360, line: 251, type: !50)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !481, file: !360, line: 252, type: !382)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !481, file: !360, line: 253, type: !357)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !491, file: !360, line: 262, type: !369)
!491 = distinct !DILexicalBlock(scope: !492, file: !360, line: 261, column: 62)
!492 = distinct !DILexicalBlock(scope: !481, file: !360, line: 261, column: 9)
!493 = !DISubprogram(name: "unicodedata_category", scope: !360, file: !360, line: 296, type: !133, isLocal: true, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_category, variables: !494)
!494 = !{!495, !496, !497, !498, !499, !500}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !493, file: !360, line: 296, type: !11)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !493, file: !360, line: 296, type: !11)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !493, file: !360, line: 298, type: !416)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !493, file: !360, line: 299, type: !50)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !493, file: !360, line: 300, type: !357)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !501, file: !360, line: 310, type: !369)
!501 = distinct !DILexicalBlock(scope: !502, file: !360, line: 309, column: 62)
!502 = distinct !DILexicalBlock(scope: !493, file: !360, line: 309, column: 9)
!503 = !DISubprogram(name: "_getrecord_ex", scope: !360, file: !360, line: 53, type: !504, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: %struct._PyUnicode_DatabaseRecord* (i32)* @_getrecord_ex, variables: !517)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !357}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicode_DatabaseRecord", file: !360, line: 38, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 28, size: 48, align: 8, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !509, file: !360, line: 29, baseType: !375, size: 8, align: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "combining", scope: !509, file: !360, line: 31, baseType: !375, size: 8, align: 8, offset: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bidirectional", scope: !509, file: !360, line: 32, baseType: !375, size: 8, align: 8, offset: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mirrored", scope: !509, file: !360, line: 34, baseType: !375, size: 8, align: 8, offset: 24)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "east_asian_width", scope: !509, file: !360, line: 35, baseType: !375, size: 8, align: 8, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "normalization_quick_check", scope: !509, file: !360, line: 37, baseType: !375, size: 8, align: 8, offset: 40)
!517 = !{!518, !519}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 1, scope: !503, file: !360, line: 53, type: !357)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !503, file: !360, line: 55, type: !50)
!520 = !DISubprogram(name: "unicodedata_bidirectional", scope: !360, file: !360, line: 325, type: !133, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_bidirectional, variables: !521)
!521 = !{!522, !523, !524, !525, !526, !527}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !520, file: !360, line: 325, type: !11)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !520, file: !360, line: 325, type: !11)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !520, file: !360, line: 327, type: !416)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !520, file: !360, line: 328, type: !50)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !520, file: !360, line: 329, type: !357)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !528, file: !360, line: 339, type: !369)
!528 = distinct !DILexicalBlock(scope: !529, file: !360, line: 338, column: 62)
!529 = distinct !DILexicalBlock(scope: !520, file: !360, line: 338, column: 9)
!530 = !DISubprogram(name: "unicodedata_combining", scope: !360, file: !360, line: 356, type: !133, isLocal: true, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_combining, variables: !531)
!531 = !{!532, !533, !534, !535, !536, !537}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !530, file: !360, line: 356, type: !11)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !530, file: !360, line: 356, type: !11)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !530, file: !360, line: 358, type: !416)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !530, file: !360, line: 359, type: !50)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !530, file: !360, line: 360, type: !357)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !538, file: !360, line: 370, type: !369)
!538 = distinct !DILexicalBlock(scope: !539, file: !360, line: 369, column: 62)
!539 = distinct !DILexicalBlock(scope: !530, file: !360, line: 369, column: 9)
!540 = !DISubprogram(name: "unicodedata_mirrored", scope: !360, file: !360, line: 385, type: !133, isLocal: true, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_mirrored, variables: !541)
!541 = !{!542, !543, !544, !545, !546, !547}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !540, file: !360, line: 385, type: !11)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !540, file: !360, line: 385, type: !11)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !540, file: !360, line: 387, type: !416)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !540, file: !360, line: 388, type: !50)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !540, file: !360, line: 389, type: !357)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !548, file: !360, line: 399, type: !369)
!548 = distinct !DILexicalBlock(scope: !549, file: !360, line: 398, column: 62)
!549 = distinct !DILexicalBlock(scope: !540, file: !360, line: 398, column: 9)
!550 = !DISubprogram(name: "unicodedata_east_asian_width", scope: !360, file: !360, line: 415, type: !133, isLocal: true, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_east_asian_width, variables: !551)
!551 = !{!552, !553, !554, !555, !556, !557}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !550, file: !360, line: 415, type: !11)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !550, file: !360, line: 415, type: !11)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !550, file: !360, line: 417, type: !416)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !550, file: !360, line: 418, type: !50)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !550, file: !360, line: 419, type: !357)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !558, file: !360, line: 429, type: !369)
!558 = distinct !DILexicalBlock(scope: !559, file: !360, line: 428, column: 62)
!559 = distinct !DILexicalBlock(scope: !550, file: !360, line: 428, column: 9)
!560 = !DISubprogram(name: "unicodedata_decomposition", scope: !360, file: !360, line: 444, type: !133, isLocal: true, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_decomposition, variables: !561)
!561 = !{!562, !563, !564, !565, !569, !570, !571, !572, !573, !574, !575}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !560, file: !360, line: 444, type: !11)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !560, file: !360, line: 444, type: !11)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !560, file: !360, line: 446, type: !416)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decomp", scope: !560, file: !360, line: 447, type: !566)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, align: 8, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 256)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !560, file: !360, line: 448, type: !50)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !560, file: !360, line: 448, type: !50)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !560, file: !360, line: 448, type: !50)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !560, file: !360, line: 449, type: !101)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prefix_index", scope: !560, file: !360, line: 450, type: !355)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !560, file: !360, line: 451, type: !357)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !576, file: !360, line: 463, type: !369)
!576 = distinct !DILexicalBlock(scope: !577, file: !360, line: 462, column: 62)
!577 = distinct !DILexicalBlock(scope: !560, file: !360, line: 462, column: 9)
!578 = !DISubprogram(name: "unicodedata_name", scope: !360, file: !360, line: 1233, type: !133, isLocal: true, isDefinition: true, scopeLine: 1234, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_name, variables: !579)
!579 = !{!580, !581, !582, !583, !584, !585}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !578, file: !360, line: 1233, type: !11)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !578, file: !360, line: 1233, type: !11)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !578, file: !360, line: 1235, type: !566)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !578, file: !360, line: 1236, type: !357)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !578, file: !360, line: 1238, type: !416)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defobj", scope: !578, file: !360, line: 1239, type: !11)
!586 = !DISubprogram(name: "_getucname", scope: !360, file: !360, line: 984, type: !587, isLocal: true, isDefinition: true, scopeLine: 986, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32, i8*, i32, i32)* @_getucname, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!50, !11, !357, !58, !50, !50}
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !603, !606, !607, !608}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !586, file: !360, line: 984, type: !11)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 2, scope: !586, file: !360, line: 984, type: !357)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 3, scope: !586, file: !360, line: 984, type: !58)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buflen", arg: 4, scope: !586, file: !360, line: 984, type: !50)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "with_alias_and_seq", arg: 5, scope: !586, file: !360, line: 985, type: !50)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !586, file: !360, line: 990, type: !50)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !586, file: !360, line: 991, type: !50)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "word", scope: !586, file: !360, line: 992, type: !50)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !586, file: !360, line: 993, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !601, file: !360, line: 1004, type: !369)
!601 = distinct !DILexicalBlock(scope: !602, file: !360, line: 1002, column: 62)
!602 = distinct !DILexicalBlock(scope: !586, file: !360, line: 1002, column: 9)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SIndex", scope: !604, file: !360, line: 1016, type: !50)
!604 = distinct !DILexicalBlock(scope: !605, file: !360, line: 1014, column: 56)
!605 = distinct !DILexicalBlock(scope: !586, file: !360, line: 1014, column: 9)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !604, file: !360, line: 1017, type: !50)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !604, file: !360, line: 1018, type: !50)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !604, file: !360, line: 1019, type: !50)
!609 = !DISubprogram(name: "is_unified_ideograph", scope: !360, file: !360, line: 967, type: !610, isLocal: true, isDefinition: true, scopeLine: 968, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @is_unified_ideograph, variables: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!50, !357}
!612 = !{!613}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 1, scope: !609, file: !360, line: 967, type: !357)
!614 = !DISubprogram(name: "unicodedata_lookup", scope: !360, file: !360, line: 1269, type: !133, isLocal: true, isDefinition: true, scopeLine: 1270, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_lookup, variables: !615)
!615 = !{!616, !617, !618, !619, !620, !621}
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !614, file: !360, line: 1269, type: !11)
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !614, file: !360, line: 1269, type: !11)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !614, file: !360, line: 1271, type: !357)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !614, file: !360, line: 1273, type: !58)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namelen", scope: !614, file: !360, line: 1274, type: !50)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !614, file: !360, line: 1275, type: !355)
!622 = !DISubprogram(name: "_getcode", scope: !360, file: !360, line: 1136, type: !623, isLocal: true, isDefinition: true, scopeLine: 1138, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, i32, i32*, i32)* @_getcode, variables: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{!50, !11, !35, !50, !431, !50}
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !639, !640, !641, !642}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !622, file: !360, line: 1136, type: !11)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !622, file: !360, line: 1136, type: !35)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "namelen", arg: 3, scope: !622, file: !360, line: 1136, type: !50)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 4, scope: !622, file: !360, line: 1136, type: !431)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "with_named_seq", arg: 5, scope: !622, file: !360, line: 1137, type: !50)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !622, file: !360, line: 1143, type: !355)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !622, file: !360, line: 1143, type: !355)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !622, file: !360, line: 1144, type: !355)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !622, file: !360, line: 1145, type: !355)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !622, file: !360, line: 1145, type: !355)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !637, file: !360, line: 1149, type: !50)
!637 = distinct !DILexicalBlock(scope: !638, file: !360, line: 1148, column: 2619)
!638 = distinct !DILexicalBlock(scope: !622, file: !360, line: 1148, column: 9)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !637, file: !360, line: 1149, type: !50)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !637, file: !360, line: 1149, type: !50)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !637, file: !360, line: 1149, type: !50)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !637, file: !360, line: 1150, type: !35)
!643 = !DISubprogram(name: "find_syllable", scope: !360, file: !360, line: 1101, type: !644, isLocal: true, isDefinition: true, scopeLine: 1102, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32*, i32*, i32, i32)* @find_syllable, variables: !647)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !35, !646, !646, !50, !50}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !643, file: !360, line: 1101, type: !35)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !643, file: !360, line: 1101, type: !646)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 3, scope: !643, file: !360, line: 1101, type: !646)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "count", arg: 4, scope: !643, file: !360, line: 1101, type: !50)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "column", arg: 5, scope: !643, file: !360, line: 1101, type: !50)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !643, file: !360, line: 1103, type: !50)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len1", scope: !643, file: !360, line: 1103, type: !50)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !656, file: !360, line: 1106, type: !58)
!656 = distinct !DILexicalBlock(scope: !657, file: !360, line: 1105, column: 33)
!657 = distinct !DILexicalBlock(scope: !658, file: !360, line: 1105, column: 5)
!658 = distinct !DILexicalBlock(scope: !643, file: !360, line: 1105, column: 5)
!659 = !DISubprogram(name: "_gethash", scope: !360, file: !360, line: 920, type: !660, isLocal: true, isDefinition: true, scopeLine: 921, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i32, i32)* @_gethash, variables: !662)
!660 = !DISubroutineType(types: !661)
!661 = !{!103, !35, !50, !50}
!662 = !{!663, !664, !665, !666, !667, !668}
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !659, file: !360, line: 920, type: !35)
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !659, file: !360, line: 920, type: !50)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "scale", arg: 3, scope: !659, file: !360, line: 920, type: !50)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !659, file: !360, line: 922, type: !50)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !659, file: !360, line: 923, type: !103)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !659, file: !360, line: 924, type: !103)
!669 = !DISubprogram(name: "_cmpname", scope: !360, file: !360, line: 1086, type: !670, isLocal: true, isDefinition: true, scopeLine: 1087, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32, i8*, i32)* @_cmpname, variables: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!50, !11, !50, !35, !50}
!672 = !{!673, !674, !675, !676, !677, !678}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !669, file: !360, line: 1086, type: !11)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 2, scope: !669, file: !360, line: 1086, type: !50)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !669, file: !360, line: 1086, type: !35)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "namelen", arg: 4, scope: !669, file: !360, line: 1086, type: !50)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !669, file: !360, line: 1089, type: !50)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !669, file: !360, line: 1090, type: !566)
!679 = !DISubprogram(name: "_check_alias_and_seq", scope: !360, file: !360, line: 1121, type: !680, isLocal: true, isDefinition: true, scopeLine: 1122, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32*, i32)* @_check_alias_and_seq, variables: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{!50, !355, !431, !50}
!682 = !{!683, !684, !685}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cp", arg: 1, scope: !679, file: !360, line: 1121, type: !355)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 2, scope: !679, file: !360, line: 1121, type: !431)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "with_named_seq", arg: 3, scope: !679, file: !360, line: 1121, type: !50)
!686 = !DISubprogram(name: "unicodedata_normalize", scope: !360, file: !360, line: 859, type: !133, isLocal: true, isDefinition: true, scopeLine: 860, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicodedata_normalize, variables: !687)
!687 = !{!688, !689, !690, !691, !692, !695, !696, !698, !699, !702, !703, !705, !706, !709, !710, !712, !713, !716, !717, !719}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !686, file: !360, line: 859, type: !11)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !686, file: !360, line: 859, type: !11)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "form", scope: !686, file: !360, line: 861, type: !58)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !686, file: !360, line: 862, type: !11)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !693, file: !360, line: 878, type: !101)
!693 = distinct !DILexicalBlock(scope: !694, file: !360, line: 878, column: 24)
!694 = distinct !DILexicalBlock(scope: !686, file: !360, line: 878, column: 9)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !693, file: !360, line: 878, type: !101)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !697, file: !360, line: 878, type: !438)
!697 = distinct !DILexicalBlock(scope: !693, file: !360, line: 878, column: 1540)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !697, file: !360, line: 878, type: !50)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !700, file: !360, line: 885, type: !101)
!700 = distinct !DILexicalBlock(scope: !701, file: !360, line: 885, column: 24)
!701 = distinct !DILexicalBlock(scope: !686, file: !360, line: 885, column: 9)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !700, file: !360, line: 885, type: !101)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !704, file: !360, line: 885, type: !438)
!704 = distinct !DILexicalBlock(scope: !700, file: !360, line: 885, column: 1555)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !704, file: !360, line: 885, type: !50)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !707, file: !360, line: 892, type: !101)
!707 = distinct !DILexicalBlock(scope: !708, file: !360, line: 892, column: 24)
!708 = distinct !DILexicalBlock(scope: !686, file: !360, line: 892, column: 9)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !707, file: !360, line: 892, type: !101)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !711, file: !360, line: 892, type: !438)
!711 = distinct !DILexicalBlock(scope: !707, file: !360, line: 892, column: 1540)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !711, file: !360, line: 892, type: !50)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !714, file: !360, line: 899, type: !101)
!714 = distinct !DILexicalBlock(scope: !715, file: !360, line: 899, column: 24)
!715 = distinct !DILexicalBlock(scope: !686, file: !360, line: 899, column: 9)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !714, file: !360, line: 899, type: !101)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !718, file: !360, line: 899, type: !438)
!718 = distinct !DILexicalBlock(scope: !714, file: !360, line: 899, column: 1555)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !718, file: !360, line: 899, type: !50)
!720 = !DISubprogram(name: "is_normalized", scope: !360, file: !360, line: 817, type: !721, isLocal: true, isDefinition: true, scopeLine: 818, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32, i32)* @is_normalized, variables: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{!50, !11, !11, !50, !50}
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !736, !737, !738}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !720, file: !360, line: 817, type: !11)
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !720, file: !360, line: 817, type: !11)
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfc", arg: 3, scope: !720, file: !360, line: 817, type: !50)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 4, scope: !720, file: !360, line: 817, type: !50)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !720, file: !360, line: 819, type: !17)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !720, file: !360, line: 819, type: !17)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !720, file: !360, line: 820, type: !50)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !720, file: !360, line: 821, type: !96)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev_combining", scope: !720, file: !360, line: 822, type: !376)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quickcheck_mask", scope: !720, file: !360, line: 822, type: !376)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !735, file: !360, line: 838, type: !357)
!735 = distinct !DILexicalBlock(scope: !720, file: !360, line: 837, column: 21)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "record", scope: !735, file: !360, line: 839, type: !506)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "combining", scope: !735, file: !360, line: 840, type: !376)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quickcheck", scope: !735, file: !360, line: 841, type: !376)
!739 = !DISubprogram(name: "nfc_nfkc", scope: !360, file: !360, line: 681, type: !278, isLocal: true, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @nfc_nfkc, variables: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !761, !765, !769, !770, !772, !773}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !739, file: !360, line: 681, type: !11)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !739, file: !360, line: 681, type: !11)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 3, scope: !739, file: !360, line: 681, type: !50)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !739, file: !360, line: 683, type: !11)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !739, file: !360, line: 684, type: !50)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !739, file: !360, line: 685, type: !96)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !739, file: !360, line: 686, type: !431)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !739, file: !360, line: 687, type: !17)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i1", scope: !739, file: !360, line: 687, type: !17)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !739, file: !360, line: 687, type: !17)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !739, file: !360, line: 687, type: !17)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !739, file: !360, line: 688, type: !50)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !739, file: !360, line: 688, type: !50)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !739, file: !360, line: 688, type: !50)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index1", scope: !739, file: !360, line: 688, type: !50)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comb", scope: !739, file: !360, line: 688, type: !50)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !739, file: !360, line: 689, type: !357)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skipped", scope: !739, file: !360, line: 690, type: !759)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1280, align: 64, elements: !107)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cskipped", scope: !739, file: !360, line: 691, type: !50)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !360, line: 707, type: !11)
!762 = distinct !DILexicalBlock(scope: !763, file: !360, line: 707, column: 12)
!763 = distinct !DILexicalBlock(scope: !764, file: !360, line: 705, column: 18)
!764 = distinct !DILexicalBlock(scope: !739, file: !360, line: 705, column: 9)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "LIndex", scope: !766, file: !360, line: 731, type: !50)
!766 = distinct !DILexicalBlock(scope: !767, file: !360, line: 730, column: 215)
!767 = distinct !DILexicalBlock(scope: !768, file: !360, line: 727, column: 11)
!768 = distinct !DILexicalBlock(scope: !739, file: !360, line: 713, column: 21)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "VIndex", scope: !766, file: !360, line: 731, type: !50)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code1", scope: !771, file: !360, line: 759, type: !357)
!771 = distinct !DILexicalBlock(scope: !768, file: !360, line: 758, column: 24)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "comb1", scope: !771, file: !360, line: 760, type: !50)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !360, line: 808, type: !11)
!774 = distinct !DILexicalBlock(scope: !739, file: !360, line: 808, column: 8)
!775 = !DISubprogram(name: "find_nfc_index", scope: !360, file: !360, line: 665, type: !776, isLocal: true, isDefinition: true, scopeLine: 666, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.reindex*, i32)* @find_nfc_index, variables: !786)
!776 = !DISubroutineType(types: !777)
!777 = !{!50, !11, !778, !357}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "reindex", file: !780, line: 340, size: 64, align: 32, elements: !781)
!780 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/unicodedata_db.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!781 = !{!782, !783, !785}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !779, file: !780, line: 340, baseType: !50, size: 32, align: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !779, file: !780, line: 340, baseType: !784, size: 16, align: 16, offset: 32)
!784 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !779, file: !780, line: 340, baseType: !784, size: 16, align: 16, offset: 48)
!786 = !{!787, !788, !789, !790, !791, !795}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !775, file: !360, line: 665, type: !11)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nfc", arg: 2, scope: !775, file: !360, line: 665, type: !778)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 3, scope: !775, file: !360, line: 665, type: !357)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !775, file: !360, line: 667, type: !355)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !792, file: !360, line: 669, type: !355)
!792 = distinct !DILexicalBlock(scope: !793, file: !360, line: 668, column: 48)
!793 = distinct !DILexicalBlock(scope: !794, file: !360, line: 668, column: 5)
!794 = distinct !DILexicalBlock(scope: !775, file: !360, line: 668, column: 5)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !796, file: !360, line: 673, type: !355)
!796 = distinct !DILexicalBlock(scope: !797, file: !360, line: 672, column: 47)
!797 = distinct !DILexicalBlock(scope: !792, file: !360, line: 672, column: 13)
!798 = !DISubprogram(name: "nfd_nfkd", scope: !360, file: !360, line: 539, type: !278, isLocal: true, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @nfd_nfkd, variables: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !814, !815, !816, !817, !818, !819, !820, !823, !826, !829, !830, !831, !832, !835}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !798, file: !360, line: 539, type: !11)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !798, file: !360, line: 539, type: !11)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "k", arg: 3, scope: !798, file: !360, line: 539, type: !50)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !798, file: !360, line: 541, type: !11)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !798, file: !360, line: 542, type: !431)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !798, file: !360, line: 543, type: !17)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !798, file: !360, line: 543, type: !17)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "osize", scope: !798, file: !360, line: 543, type: !17)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !798, file: !360, line: 544, type: !50)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !798, file: !360, line: 545, type: !96)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stack", scope: !798, file: !360, line: 547, type: !811)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 640, align: 32, elements: !107)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !798, file: !360, line: 548, type: !17)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isize", scope: !798, file: !360, line: 548, type: !17)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !798, file: !360, line: 549, type: !50)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prefix", scope: !798, file: !360, line: 549, type: !50)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !798, file: !360, line: 549, type: !50)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stackptr", scope: !798, file: !360, line: 549, type: !50)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !798, file: !360, line: 550, type: !376)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !798, file: !360, line: 550, type: !376)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !821, file: !360, line: 569, type: !357)
!821 = distinct !DILexicalBlock(scope: !822, file: !360, line: 568, column: 25)
!822 = distinct !DILexicalBlock(scope: !798, file: !360, line: 566, column: 23)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_output", scope: !824, file: !360, line: 573, type: !431)
!824 = distinct !DILexicalBlock(scope: !825, file: !360, line: 572, column: 28)
!825 = distinct !DILexicalBlock(scope: !821, file: !360, line: 572, column: 17)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "SIndex", scope: !827, file: !360, line: 586, type: !50)
!827 = distinct !DILexicalBlock(scope: !828, file: !360, line: 585, column: 66)
!828 = distinct !DILexicalBlock(scope: !821, file: !360, line: 585, column: 17)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !827, file: !360, line: 587, type: !50)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "V", scope: !827, file: !360, line: 588, type: !50)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "T", scope: !827, file: !360, line: 589, type: !50)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !833, file: !360, line: 601, type: !357)
!833 = distinct !DILexicalBlock(scope: !834, file: !360, line: 600, column: 70)
!834 = distinct !DILexicalBlock(scope: !821, file: !360, line: 600, column: 17)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !836, file: !360, line: 648, type: !357)
!836 = distinct !DILexicalBlock(scope: !837, file: !360, line: 647, column: 19)
!837 = distinct !DILexicalBlock(scope: !838, file: !360, line: 639, column: 91)
!838 = distinct !DILexicalBlock(scope: !839, file: !360, line: 639, column: 5)
!839 = distinct !DILexicalBlock(scope: !798, file: !360, line: 639, column: 5)
!840 = !DISubprogram(name: "get_decomp_record", scope: !360, file: !360, line: 505, type: !841, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i32, i32*, i32*, i32*)* @get_decomp_record, variables: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !11, !357, !646, !646, !646}
!843 = !{!844, !845, !846, !847, !848}
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !840, file: !360, line: 505, type: !11)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 2, scope: !840, file: !360, line: 505, type: !357)
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !840, file: !360, line: 505, type: !646)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 4, scope: !840, file: !360, line: 505, type: !646)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "count", arg: 5, scope: !840, file: !360, line: 505, type: !646)
!849 = !DISubprogram(name: "new_previous_version", scope: !360, file: !360, line: 86, type: !850, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct.change_record* (i32)*, i32 (i32)*)* @new_previous_version, variables: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{!11, !35, !366, !384}
!852 = !{!853, !854, !855, !856}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !849, file: !360, line: 86, type: !35)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "getrecord", arg: 2, scope: !849, file: !360, line: 86, type: !366)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "normalization", arg: 3, scope: !849, file: !360, line: 87, type: !384)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !849, file: !360, line: 89, type: !358)
!857 = !DISubprogram(name: "get_change_3_2_0", scope: !780, file: !780, line: 6553, type: !367, isLocal: true, isDefinition: true, scopeLine: 6554, flags: DIFlagPrototyped, isOptimized: true, function: %struct.change_record* (i32)* @get_change_3_2_0, variables: !858)
!858 = !{!859, !860}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !857, file: !780, line: 6553, type: !357)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !857, file: !780, line: 6555, type: !50)
!861 = !DISubprogram(name: "normalization_3_2_0", scope: !780, file: !780, line: 6564, type: !385, isLocal: true, isDefinition: true, scopeLine: 6565, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @normalization_3_2_0, variables: !862)
!862 = !{!863}
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !861, file: !780, line: 6564, type: !357)
!864 = !{!865, !869, !873, !877, !881, !883, !888, !892, !896, !900, !904, !908, !912, !916, !920, !924, !928, !932, !936, !940, !944, !948, !951, !952, !953, !954, !959, !960, !964, !968, !972, !976, !980, !984, !988, !1001, !1005, !1009, !1013, !1017, !1021, !1025, !1030, !1052, !1056, !1057, !1061, !1065}
!865 = !DIGlobalVariable(name: "_PyUnicode_Database_Records", scope: !0, file: !780, line: 5, type: !866, isLocal: false, isDefinition: true, variable: [329 x %struct._PyUnicode_DatabaseRecord]* @_PyUnicode_Database_Records)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 15792, align: 8, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 329)
!869 = !DIGlobalVariable(name: "_PyUnicode_CategoryNames", scope: !0, file: !780, line: 590, type: !870, isLocal: false, isDefinition: true, variable: [32 x i8*]* @_PyUnicode_CategoryNames)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, align: 64, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 32)
!873 = !DIGlobalVariable(name: "_PyUnicode_BidirectionalNames", scope: !0, file: !780, line: 624, type: !874, isLocal: false, isDefinition: true, variable: [25 x i8*]* @_PyUnicode_BidirectionalNames)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1600, align: 64, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 25)
!877 = !DIGlobalVariable(name: "_PyUnicode_EastAsianWidthNames", scope: !0, file: !780, line: 651, type: !878, isLocal: false, isDefinition: true, variable: [7 x i8*]* @_PyUnicode_EastAsianWidthNames)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 448, align: 64, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 7)
!881 = !DIGlobalVariable(name: "UCD_Type", scope: !0, file: !360, line: 1319, type: !882, isLocal: true, isDefinition: true, variable: %struct._typeobject* @UCD_Type)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !13, line: 422, baseType: !26)
!883 = !DIGlobalVariable(name: "unicodedata_functions", scope: !0, file: !360, line: 1296, type: !884, isLocal: true, isDefinition: true, variable: [13 x %struct.PyMethodDef]* @unicodedata_functions)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 3328, align: 64, elements: !886)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!886 = !{!887}
!887 = !DISubrange(count: 13)
!888 = !DIGlobalVariable(name: "unicodedata_UCD_decimal__doc__", scope: !0, file: !360, line: 131, type: !889, isLocal: true, isDefinition: true, variable: [278 x i8]* @unicodedata_UCD_decimal__doc__)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2224, align: 8, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 278)
!892 = !DIGlobalVariable(name: "unicodedata_digit__doc__", scope: !0, file: !360, line: 205, type: !893, isLocal: true, isDefinition: true, variable: [193 x i8]* @unicodedata_digit__doc__)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1544, align: 8, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 193)
!896 = !DIGlobalVariable(name: "unicodedata_numeric__doc__", scope: !0, file: !360, line: 239, type: !897, isLocal: true, isDefinition: true, variable: [195 x i8]* @unicodedata_numeric__doc__)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1560, align: 8, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 195)
!900 = !DIGlobalVariable(name: "index1", scope: !0, file: !780, line: 682, type: !901, isLocal: true, isDefinition: true, variable: [8704 x i8]* @index1)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 69632, align: 8, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 8704)
!904 = !DIGlobalVariable(name: "index2", scope: !0, file: !780, line: 1198, type: !905, isLocal: true, isDefinition: true, variable: [25472 x i16]* @index2)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 407552, align: 16, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 25472)
!908 = !DIGlobalVariable(name: "unicodedata_category__doc__", scope: !0, file: !360, line: 289, type: !909, isLocal: true, isDefinition: true, variable: [99 x i8]* @unicodedata_category__doc__)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 792, align: 8, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 99)
!912 = !DIGlobalVariable(name: "unicodedata_bidirectional__doc__", scope: !0, file: !360, line: 317, type: !913, isLocal: true, isDefinition: true, variable: [165 x i8]* @unicodedata_bidirectional__doc__)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1320, align: 8, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 165)
!916 = !DIGlobalVariable(name: "unicodedata_combining__doc__", scope: !0, file: !360, line: 348, type: !917, isLocal: true, isDefinition: true, variable: [154 x i8]* @unicodedata_combining__doc__)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1232, align: 8, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 154)
!920 = !DIGlobalVariable(name: "unicodedata_mirrored__doc__", scope: !0, file: !360, line: 377, type: !921, isLocal: true, isDefinition: true, variable: [210 x i8]* @unicodedata_mirrored__doc__)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1680, align: 8, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 210)
