; ModuleID = 'irs-onlybc/weakrefobject.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !371, globals: !803)
!1 = !DIFile(filename: "weakrefobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !362, !52, !351, !363}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !353, line: 10, baseType: !354)
!353 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !353, line: 16, size: 448, align: 64, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !354, file: !353, line: 17, baseType: !6, size: 128, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !354, file: !353, line: 23, baseType: !5, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !354, file: !353, line: 26, baseType: !5, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !354, file: !353, line: 31, baseType: !218, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !354, file: !353, line: 38, baseType: !351, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !354, file: !353, line: 39, baseType: !351, size: 64, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !365, line: 33, baseType: !366)
!365 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 25, size: 256, align: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !366, file: !365, line: 26, baseType: !23, size: 192, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !366, file: !365, line: 27, baseType: !370, size: 64, align: 64, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!371 = !{!372, !379, !385, !405, !424, !427, !466, !477, !480, !492, !497, !507, !518, !523, !533, !539, !548, !570, !579, !582, !585, !589, !592, !596, !600, !604, !608, !613, !616, !619, !622, !626, !629, !633, !637, !641, !645, !649, !652, !655, !659, !663, !667, !671, !676, !680, !684, !688, !692, !696, !700, !704, !708, !712, !715, !718, !724, !728, !735, !738, !742, !747, !752, !755, !758, !761, !766, !773, !780, !787, !793}
!372 = !DISubprogram(name: "_PyWeakref_GetWeakrefCount", scope: !373, file: !373, line: 10, type: !374, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._PyWeakReference*)* @_PyWeakref_GetWeakrefCount, variables: !376)
!373 = !DIFile(filename: "Objects/weakrefobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!374 = !DISubroutineType(types: !375)
!375 = !{!11, !351}
!376 = !{!377, !378}
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 1, scope: !372, file: !373, line: 10, type: !351)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !372, file: !373, line: 12, type: !11)
!379 = !DISubprogram(name: "_PyWeakref_ClearRef", scope: !373, file: !373, line: 89, type: !380, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*)* @_PyWeakref_ClearRef, variables: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !351}
!382 = !{!383, !384}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !379, file: !373, line: 89, type: !351)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !379, file: !373, line: 91, type: !5)
!385 = !DISubprogram(name: "PyWeakref_NewRef", scope: !373, file: !373, line: 730, type: !126, isLocal: false, isDefinition: true, scopeLine: 731, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyWeakref_NewRef, variables: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !403}
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !385, file: !373, line: 730, type: !5)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !385, file: !373, line: 730, type: !5)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !385, file: !373, line: 732, type: !351)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !385, file: !373, line: 733, type: !350)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !385, file: !373, line: 734, type: !351)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !385, file: !373, line: 734, type: !351)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !394, file: !373, line: 768, type: !5)
!394 = distinct !DILexicalBlock(scope: !395, file: !373, line: 768, column: 24)
!395 = distinct !DILexicalBlock(scope: !396, file: !373, line: 763, column: 22)
!396 = distinct !DILexicalBlock(scope: !397, file: !373, line: 761, column: 21)
!397 = distinct !DILexicalBlock(scope: !398, file: !373, line: 760, column: 41)
!398 = distinct !DILexicalBlock(scope: !399, file: !373, line: 760, column: 17)
!399 = distinct !DILexicalBlock(scope: !400, file: !373, line: 758, column: 35)
!400 = distinct !DILexicalBlock(scope: !401, file: !373, line: 758, column: 13)
!401 = distinct !DILexicalBlock(scope: !402, file: !373, line: 751, column: 10)
!402 = distinct !DILexicalBlock(scope: !385, file: !373, line: 749, column: 9)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !404, file: !373, line: 774, type: !351)
!404 = distinct !DILexicalBlock(scope: !398, file: !373, line: 773, column: 18)
!405 = !DISubprogram(name: "PyWeakref_NewProxy", scope: !373, file: !373, line: 789, type: !126, isLocal: false, isDefinition: true, scopeLine: 790, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyWeakref_NewProxy, variables: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !418}
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !405, file: !373, line: 789, type: !5)
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !405, file: !373, line: 789, type: !5)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !405, file: !373, line: 791, type: !351)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !405, file: !373, line: 792, type: !350)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !405, file: !373, line: 793, type: !351)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !405, file: !373, line: 793, type: !351)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !414, file: !373, line: 818, type: !351)
!414 = distinct !DILexicalBlock(scope: !415, file: !373, line: 817, column: 35)
!415 = distinct !DILexicalBlock(scope: !416, file: !373, line: 817, column: 13)
!416 = distinct !DILexicalBlock(scope: !417, file: !373, line: 810, column: 10)
!417 = distinct !DILexicalBlock(scope: !405, file: !373, line: 808, column: 9)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !419, file: !373, line: 831, type: !5)
!419 = distinct !DILexicalBlock(scope: !420, file: !373, line: 831, column: 24)
!420 = distinct !DILexicalBlock(scope: !421, file: !373, line: 826, column: 42)
!421 = distinct !DILexicalBlock(scope: !422, file: !373, line: 826, column: 21)
!422 = distinct !DILexicalBlock(scope: !423, file: !373, line: 825, column: 41)
!423 = distinct !DILexicalBlock(scope: !414, file: !373, line: 825, column: 17)
!424 = !DISubprogram(name: "PyWeakref_GetObject", scope: !373, file: !373, line: 853, type: !116, isLocal: false, isDefinition: true, scopeLine: 854, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyWeakref_GetObject, variables: !425)
!425 = !{!426}
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 1, scope: !424, file: !373, line: 853, type: !5)
!427 = !DISubprogram(name: "PyObject_ClearWeakRefs", scope: !373, file: !373, line: 883, type: !37, isLocal: false, isDefinition: true, scopeLine: 884, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyObject_ClearWeakRefs, variables: !428)
!428 = !{!429, !430, !431, !434, !435, !436, !437, !438, !439, !442, !446, !448, !449, !453, !457, !461, !464}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !427, file: !373, line: 883, type: !5)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !427, file: !373, line: 885, type: !350)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !432, file: !373, line: 901, type: !351)
!432 = distinct !DILexicalBlock(scope: !433, file: !373, line: 900, column: 30)
!433 = distinct !DILexicalBlock(scope: !427, file: !373, line: 900, column: 9)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !432, file: !373, line: 902, type: !11)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restore_error", scope: !432, file: !373, line: 903, type: !44)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_type", scope: !432, file: !373, line: 904, type: !5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_value", scope: !432, file: !373, line: 904, type: !5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_tb", scope: !432, file: !373, line: 904, type: !5)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !440, file: !373, line: 909, type: !5)
!440 = distinct !DILexicalBlock(scope: !441, file: !373, line: 908, column: 25)
!441 = distinct !DILexicalBlock(scope: !432, file: !373, line: 908, column: 13)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !373, line: 916, type: !5)
!443 = distinct !DILexicalBlock(scope: !444, file: !373, line: 916, column: 20)
!444 = distinct !DILexicalBlock(scope: !445, file: !373, line: 913, column: 41)
!445 = distinct !DILexicalBlock(scope: !440, file: !373, line: 913, column: 17)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !447, file: !373, line: 920, type: !5)
!447 = distinct !DILexicalBlock(scope: !441, file: !373, line: 919, column: 14)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !447, file: !373, line: 921, type: !11)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !450, file: !373, line: 931, type: !351)
!450 = distinct !DILexicalBlock(scope: !451, file: !373, line: 930, column: 41)
!451 = distinct !DILexicalBlock(scope: !452, file: !373, line: 930, column: 13)
!452 = distinct !DILexicalBlock(scope: !447, file: !373, line: 930, column: 13)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !454, file: !373, line: 940, type: !5)
!454 = distinct !DILexicalBlock(scope: !455, file: !373, line: 940, column: 24)
!455 = distinct !DILexicalBlock(scope: !456, file: !373, line: 939, column: 22)
!456 = distinct !DILexicalBlock(scope: !450, file: !373, line: 933, column: 21)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !458, file: !373, line: 947, type: !5)
!458 = distinct !DILexicalBlock(scope: !459, file: !373, line: 946, column: 41)
!459 = distinct !DILexicalBlock(scope: !460, file: !373, line: 946, column: 13)
!460 = distinct !DILexicalBlock(scope: !447, file: !373, line: 946, column: 13)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !462, file: !373, line: 951, type: !5)
!462 = distinct !DILexicalBlock(scope: !463, file: !373, line: 950, column: 45)
!463 = distinct !DILexicalBlock(scope: !458, file: !373, line: 950, column: 21)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !465, file: !373, line: 955, type: !5)
!465 = distinct !DILexicalBlock(scope: !447, file: !373, line: 955, column: 16)
!466 = !DISubprogram(name: "clear_weakref", scope: !373, file: !373, line: 51, type: !380, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*)* @clear_weakref, variables: !467)
!467 = !{!468, !469, !470, !473}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !466, file: !373, line: 51, type: !351)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !466, file: !373, line: 53, type: !5)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !471, file: !373, line: 56, type: !350)
!471 = distinct !DILexicalBlock(scope: !472, file: !373, line: 55, column: 47)
!472 = distinct !DILexicalBlock(scope: !466, file: !373, line: 55, column: 9)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !373, line: 72, type: !5)
!474 = distinct !DILexicalBlock(scope: !475, file: !373, line: 72, column: 12)
!475 = distinct !DILexicalBlock(scope: !476, file: !373, line: 71, column: 33)
!476 = distinct !DILexicalBlock(scope: !466, file: !373, line: 71, column: 9)
!477 = !DISubprogram(name: "weakref_dealloc", scope: !373, file: !373, line: 103, type: !37, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @weakref_dealloc, variables: !478)
!478 = !{!479}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !477, file: !373, line: 103, type: !5)
!480 = !DISubprogram(name: "weakref_repr", scope: !373, file: !373, line: 156, type: !481, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @weakref_repr, variables: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!5, !351}
!483 = !{!484, !485, !486, !487, !489}
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !480, file: !373, line: 156, type: !351)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !480, file: !373, line: 158, type: !5)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr", scope: !480, file: !373, line: 158, type: !5)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !488, file: !373, line: 182, type: !5)
!488 = distinct !DILexicalBlock(scope: !480, file: !373, line: 182, column: 8)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !490, file: !373, line: 182, type: !5)
!490 = distinct !DILexicalBlock(scope: !491, file: !373, line: 182, column: 96)
!491 = distinct !DILexicalBlock(scope: !488, file: !373, line: 182, column: 62)
!492 = !DISubprogram(name: "weakref_hash", scope: !373, file: !373, line: 142, type: !493, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._PyWeakReference*)* @weakref_hash, variables: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{!218, !351}
!495 = !{!496}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !492, file: !373, line: 142, type: !351)
!497 = !DISubprogram(name: "weakref_call", scope: !373, file: !373, line: 128, type: !498, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @weakref_call, variables: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{!5, !351, !5, !5}
!500 = !{!501, !502, !503, !504}
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !497, file: !373, line: 128, type: !351)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !497, file: !373, line: 128, type: !5)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !497, file: !373, line: 128, type: !5)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !505, file: !373, line: 133, type: !5)
!505 = distinct !DILexicalBlock(scope: !506, file: !373, line: 132, column: 69)
!506 = distinct !DILexicalBlock(scope: !497, file: !373, line: 132, column: 9)
!507 = !DISubprogram(name: "gc_traverse", scope: !373, file: !373, line: 112, type: !508, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, i32 (%struct._object*, i8*)*, i8*)* @gc_traverse, variables: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!44, !351, !263, !4}
!510 = !{!511, !512, !513, !514}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !507, file: !373, line: 112, type: !351)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !507, file: !373, line: 112, type: !263)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !507, file: !373, line: 112, type: !4)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !515, file: !373, line: 114, type: !44)
!515 = distinct !DILexicalBlock(scope: !516, file: !373, line: 114, column: 33)
!516 = distinct !DILexicalBlock(scope: !517, file: !373, line: 114, column: 14)
!517 = distinct !DILexicalBlock(scope: !507, file: !373, line: 114, column: 8)
!518 = !DISubprogram(name: "gc_clear", scope: !373, file: !373, line: 120, type: !519, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*)* @gc_clear, variables: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!44, !351}
!521 = !{!522}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !518, file: !373, line: 120, type: !351)
!523 = !DISubprogram(name: "weakref_richcompare", scope: !373, file: !373, line: 191, type: !524, isLocal: true, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*, %struct._PyWeakReference*, i32)* @weakref_richcompare, variables: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!5, !351, !351, !44}
!526 = !{!527, !528, !529, !530}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !523, file: !373, line: 191, type: !351)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !523, file: !373, line: 191, type: !351)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !523, file: !373, line: 191, type: !44)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !531, file: !373, line: 200, type: !44)
!531 = distinct !DILexicalBlock(scope: !532, file: !373, line: 199, column: 170)
!532 = distinct !DILexicalBlock(scope: !523, file: !373, line: 198, column: 9)
!533 = !DISubprogram(name: "weakref___init__", scope: !373, file: !373, line: 330, type: !211, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @weakref___init__, variables: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !533, file: !373, line: 330, type: !5)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !533, file: !373, line: 330, type: !5)
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !533, file: !373, line: 330, type: !5)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !533, file: !373, line: 332, type: !5)
!539 = !DISubprogram(name: "parse_weakref_init_args", scope: !373, file: !373, line: 268, type: !540, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._object*, %struct._object**, %struct._object**)* @parse_weakref_init_args, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!44, !52, !5, !5, !362, !362}
!542 = !{!543, !544, !545, !546, !547}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 1, scope: !539, file: !373, line: 268, type: !52)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !539, file: !373, line: 268, type: !5)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !539, file: !373, line: 268, type: !5)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obp", arg: 4, scope: !539, file: !373, line: 269, type: !362)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callbackp", arg: 5, scope: !539, file: !373, line: 269, type: !362)
!548 = !DISubprogram(name: "weakref___new__", scope: !373, file: !373, line: 276, type: !549, isLocal: true, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @weakref___new__, variables: !553)
!549 = !DISubroutineType(types: !550)
!550 = !{!5, !551, !5, !5}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !563, !564, !565}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !548, file: !373, line: 276, type: !551)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !548, file: !373, line: 276, type: !5)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !548, file: !373, line: 276, type: !5)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !548, file: !373, line: 278, type: !351)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ob", scope: !548, file: !373, line: 279, type: !5)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !548, file: !373, line: 279, type: !5)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !561, file: !373, line: 282, type: !351)
!561 = distinct !DILexicalBlock(scope: !562, file: !373, line: 281, column: 75)
!562 = distinct !DILexicalBlock(scope: !548, file: !373, line: 281, column: 9)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !561, file: !373, line: 282, type: !351)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !561, file: !373, line: 283, type: !350)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !566, file: !373, line: 315, type: !351)
!566 = distinct !DILexicalBlock(scope: !567, file: !373, line: 314, column: 18)
!567 = distinct !DILexicalBlock(scope: !568, file: !373, line: 311, column: 17)
!568 = distinct !DILexicalBlock(scope: !569, file: !373, line: 309, column: 33)
!569 = distinct !DILexicalBlock(scope: !561, file: !373, line: 309, column: 13)
!570 = !DISubprogram(name: "init_weakref", scope: !373, file: !373, line: 23, type: !571, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @init_weakref, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !351, !5, !5}
!573 = !{!574, !575, !576, !577}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !570, file: !373, line: 23, type: !351)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 2, scope: !570, file: !373, line: 23, type: !5)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 3, scope: !570, file: !373, line: 23, type: !5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !578, file: !373, line: 27, type: !5)
!578 = distinct !DILexicalBlock(scope: !570, file: !373, line: 27, column: 8)
!579 = !DISubprogram(name: "proxy_dealloc", scope: !373, file: !373, line: 535, type: !380, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*)* @proxy_dealloc, variables: !580)
!580 = !{!581}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !579, file: !373, line: 535, type: !351)
!582 = !DISubprogram(name: "proxy_repr", scope: !373, file: !373, line: 465, type: !481, isLocal: true, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @proxy_repr, variables: !583)
!583 = !{!584}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !582, file: !373, line: 465, type: !351)
!585 = !DISubprogram(name: "proxy_add", scope: !373, file: !373, line: 492, type: !126, isLocal: true, isDefinition: true, scopeLine: 492, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_add, variables: !586)
!586 = !{!587, !588}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !585, file: !373, line: 492, type: !5)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !585, file: !373, line: 492, type: !5)
!589 = !DISubprogram(name: "proxy_checkref", scope: !373, file: !373, line: 392, type: !519, isLocal: true, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*)* @proxy_checkref, variables: !590)
!590 = !{!591}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !589, file: !373, line: 392, type: !351)
!592 = !DISubprogram(name: "proxy_sub", scope: !373, file: !373, line: 493, type: !126, isLocal: true, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_sub, variables: !593)
!593 = !{!594, !595}
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !592, file: !373, line: 493, type: !5)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !592, file: !373, line: 493, type: !5)
!596 = !DISubprogram(name: "proxy_mul", scope: !373, file: !373, line: 494, type: !126, isLocal: true, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_mul, variables: !597)
!597 = !{!598, !599}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !596, file: !373, line: 494, type: !5)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !596, file: !373, line: 494, type: !5)
!600 = !DISubprogram(name: "proxy_mod", scope: !373, file: !373, line: 497, type: !126, isLocal: true, isDefinition: true, scopeLine: 497, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_mod, variables: !601)
!601 = !{!602, !603}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !600, file: !373, line: 497, type: !5)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !600, file: !373, line: 497, type: !5)
!604 = !DISubprogram(name: "proxy_divmod", scope: !373, file: !373, line: 498, type: !126, isLocal: true, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_divmod, variables: !605)
!605 = !{!606, !607}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !604, file: !373, line: 498, type: !5)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !604, file: !373, line: 498, type: !5)
!608 = !DISubprogram(name: "proxy_pow", scope: !373, file: !373, line: 499, type: !135, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @proxy_pow, variables: !609)
!609 = !{!610, !611, !612}
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !608, file: !373, line: 499, type: !5)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !608, file: !373, line: 499, type: !5)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !608, file: !373, line: 499, type: !5)
!613 = !DISubprogram(name: "proxy_neg", scope: !373, file: !373, line: 500, type: !116, isLocal: true, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_neg, variables: !614)
!614 = !{!615}
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !613, file: !373, line: 500, type: !5)
!616 = !DISubprogram(name: "proxy_pos", scope: !373, file: !373, line: 501, type: !116, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_pos, variables: !617)
!617 = !{!618}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !616, file: !373, line: 501, type: !5)
!619 = !DISubprogram(name: "proxy_abs", scope: !373, file: !373, line: 502, type: !116, isLocal: true, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_abs, variables: !620)
!620 = !{!621}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !619, file: !373, line: 502, type: !5)
!622 = !DISubprogram(name: "proxy_bool", scope: !373, file: !373, line: 526, type: !519, isLocal: true, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*)* @proxy_bool, variables: !623)
!623 = !{!624, !625}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !622, file: !373, line: 526, type: !351)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !622, file: !373, line: 528, type: !5)
!626 = !DISubprogram(name: "proxy_invert", scope: !373, file: !373, line: 503, type: !116, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_invert, variables: !627)
!627 = !{!628}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !626, file: !373, line: 503, type: !5)
!629 = !DISubprogram(name: "proxy_lshift", scope: !373, file: !373, line: 504, type: !126, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_lshift, variables: !630)
!630 = !{!631, !632}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !629, file: !373, line: 504, type: !5)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !629, file: !373, line: 504, type: !5)
!633 = !DISubprogram(name: "proxy_rshift", scope: !373, file: !373, line: 505, type: !126, isLocal: true, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_rshift, variables: !634)
!634 = !{!635, !636}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !633, file: !373, line: 505, type: !5)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !633, file: !373, line: 505, type: !5)
!637 = !DISubprogram(name: "proxy_and", scope: !373, file: !373, line: 506, type: !126, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_and, variables: !638)
!638 = !{!639, !640}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !637, file: !373, line: 506, type: !5)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !637, file: !373, line: 506, type: !5)
!641 = !DISubprogram(name: "proxy_xor", scope: !373, file: !373, line: 507, type: !126, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_xor, variables: !642)
!642 = !{!643, !644}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !641, file: !373, line: 507, type: !5)
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !641, file: !373, line: 507, type: !5)
!645 = !DISubprogram(name: "proxy_or", scope: !373, file: !373, line: 508, type: !126, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_or, variables: !646)
!646 = !{!647, !648}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !645, file: !373, line: 508, type: !5)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !645, file: !373, line: 508, type: !5)
!649 = !DISubprogram(name: "proxy_int", scope: !373, file: !373, line: 509, type: !116, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_int, variables: !650)
!650 = !{!651}
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !649, file: !373, line: 509, type: !5)
!652 = !DISubprogram(name: "proxy_float", scope: !373, file: !373, line: 510, type: !116, isLocal: true, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_float, variables: !653)
!653 = !{!654}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !652, file: !373, line: 510, type: !5)
!655 = !DISubprogram(name: "proxy_iadd", scope: !373, file: !373, line: 511, type: !126, isLocal: true, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_iadd, variables: !656)
!656 = !{!657, !658}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !655, file: !373, line: 511, type: !5)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !655, file: !373, line: 511, type: !5)
!659 = !DISubprogram(name: "proxy_isub", scope: !373, file: !373, line: 512, type: !126, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_isub, variables: !660)
!660 = !{!661, !662}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !659, file: !373, line: 512, type: !5)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !659, file: !373, line: 512, type: !5)
!663 = !DISubprogram(name: "proxy_imul", scope: !373, file: !373, line: 513, type: !126, isLocal: true, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_imul, variables: !664)
!664 = !{!665, !666}
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !663, file: !373, line: 513, type: !5)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !663, file: !373, line: 513, type: !5)
!667 = !DISubprogram(name: "proxy_imod", scope: !373, file: !373, line: 516, type: !126, isLocal: true, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_imod, variables: !668)
!668 = !{!669, !670}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !667, file: !373, line: 516, type: !5)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !667, file: !373, line: 516, type: !5)
!671 = !DISubprogram(name: "proxy_ipow", scope: !373, file: !373, line: 517, type: !135, isLocal: true, isDefinition: true, scopeLine: 517, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @proxy_ipow, variables: !672)
!672 = !{!673, !674, !675}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !671, file: !373, line: 517, type: !5)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !671, file: !373, line: 517, type: !5)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !671, file: !373, line: 517, type: !5)
!676 = !DISubprogram(name: "proxy_ilshift", scope: !373, file: !373, line: 518, type: !126, isLocal: true, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ilshift, variables: !677)
!677 = !{!678, !679}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !676, file: !373, line: 518, type: !5)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !676, file: !373, line: 518, type: !5)
!680 = !DISubprogram(name: "proxy_irshift", scope: !373, file: !373, line: 519, type: !126, isLocal: true, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_irshift, variables: !681)
!681 = !{!682, !683}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !680, file: !373, line: 519, type: !5)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !680, file: !373, line: 519, type: !5)
!684 = !DISubprogram(name: "proxy_iand", scope: !373, file: !373, line: 520, type: !126, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_iand, variables: !685)
!685 = !{!686, !687}
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !684, file: !373, line: 520, type: !5)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !684, file: !373, line: 520, type: !5)
!688 = !DISubprogram(name: "proxy_ixor", scope: !373, file: !373, line: 521, type: !126, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ixor, variables: !689)
!689 = !{!690, !691}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !688, file: !373, line: 521, type: !5)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !688, file: !373, line: 521, type: !5)
!692 = !DISubprogram(name: "proxy_ior", scope: !373, file: !373, line: 522, type: !126, isLocal: true, isDefinition: true, scopeLine: 522, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ior, variables: !693)
!693 = !{!694, !695}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !692, file: !373, line: 522, type: !5)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !692, file: !373, line: 522, type: !5)
!696 = !DISubprogram(name: "proxy_floor_div", scope: !373, file: !373, line: 495, type: !126, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_floor_div, variables: !697)
!697 = !{!698, !699}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !696, file: !373, line: 495, type: !5)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !696, file: !373, line: 495, type: !5)
!700 = !DISubprogram(name: "proxy_true_div", scope: !373, file: !373, line: 496, type: !126, isLocal: true, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_true_div, variables: !701)
!701 = !{!702, !703}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !700, file: !373, line: 496, type: !5)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !700, file: !373, line: 496, type: !5)
!704 = !DISubprogram(name: "proxy_ifloor_div", scope: !373, file: !373, line: 514, type: !126, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ifloor_div, variables: !705)
!705 = !{!706, !707}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !704, file: !373, line: 514, type: !5)
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !704, file: !373, line: 514, type: !5)
!708 = !DISubprogram(name: "proxy_itrue_div", scope: !373, file: !373, line: 515, type: !126, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_itrue_div, variables: !709)
!709 = !{!710, !711}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !708, file: !373, line: 515, type: !5)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !708, file: !373, line: 515, type: !5)
!712 = !DISubprogram(name: "proxy_index", scope: !373, file: !373, line: 523, type: !116, isLocal: true, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_index, variables: !713)
!713 = !{!714}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !712, file: !373, line: 523, type: !5)
!715 = !DISubprogram(name: "proxy_length", scope: !373, file: !373, line: 557, type: !374, isLocal: true, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._PyWeakReference*)* @proxy_length, variables: !716)
!716 = !{!717}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !715, file: !373, line: 557, type: !351)
!718 = !DISubprogram(name: "proxy_contains", scope: !373, file: !373, line: 546, type: !719, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, %struct._object*)* @proxy_contains, variables: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!44, !351, !5}
!721 = !{!722, !723}
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !718, file: !373, line: 546, type: !351)
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !718, file: !373, line: 546, type: !5)
!724 = !DISubprogram(name: "proxy_getitem", scope: !373, file: !373, line: 564, type: !126, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_getitem, variables: !725)
!725 = !{!726, !727}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !724, file: !373, line: 564, type: !5)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !724, file: !373, line: 564, type: !5)
!728 = !DISubprogram(name: "proxy_setitem", scope: !373, file: !373, line: 567, type: !729, isLocal: true, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @proxy_setitem, variables: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{!44, !351, !5, !5}
!731 = !{!732, !733, !734}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !728, file: !373, line: 567, type: !351)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !728, file: !373, line: 567, type: !5)
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !728, file: !373, line: 567, type: !5)
!735 = !DISubprogram(name: "proxy_str", scope: !373, file: !373, line: 461, type: !116, isLocal: true, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_str, variables: !736)
!736 = !{!737}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !735, file: !373, line: 461, type: !5)
!738 = !DISubprogram(name: "proxy_getattr", scope: !373, file: !373, line: 460, type: !126, isLocal: true, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_getattr, variables: !739)
!739 = !{!740, !741}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !738, file: !373, line: 460, type: !5)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !738, file: !373, line: 460, type: !5)
!742 = !DISubprogram(name: "proxy_setattr", scope: !373, file: !373, line: 476, type: !729, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @proxy_setattr, variables: !743)
!743 = !{!744, !745, !746}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !742, file: !373, line: 476, type: !351)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !742, file: !373, line: 476, type: !5)
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !742, file: !373, line: 476, type: !5)
!747 = !DISubprogram(name: "proxy_richcompare", scope: !373, file: !373, line: 484, type: !271, isLocal: true, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @proxy_richcompare, variables: !748)
!748 = !{!749, !750, !751}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !747, file: !373, line: 484, type: !5)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !747, file: !373, line: 484, type: !5)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !747, file: !373, line: 484, type: !44)
!752 = !DISubprogram(name: "proxy_iter", scope: !373, file: !373, line: 581, type: !481, isLocal: true, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @proxy_iter, variables: !753)
!753 = !{!754}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !752, file: !373, line: 581, type: !351)
!755 = !DISubprogram(name: "proxy_iternext", scope: !373, file: !373, line: 589, type: !481, isLocal: true, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @proxy_iternext, variables: !756)
!756 = !{!757}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !755, file: !373, line: 589, type: !351)
!758 = !DISubprogram(name: "proxy_bytes", scope: !373, file: !373, line: 597, type: !116, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_bytes, variables: !759)
!759 = !{!760}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !758, file: !373, line: 597, type: !5)
!761 = !DISubprogram(name: "proxy_call", scope: !373, file: !373, line: 462, type: !135, isLocal: true, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @proxy_call, variables: !762)
!762 = !{!763, !764, !765}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !761, file: !373, line: 462, type: !5)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !761, file: !373, line: 462, type: !5)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !761, file: !373, line: 462, type: !5)
!766 = !DISubprogram(name: "get_basic_refs", scope: !373, file: !373, line: 218, type: !767, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*, %struct._PyWeakReference**, %struct._PyWeakReference**)* @get_basic_refs, variables: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !351, !350, !350}
!769 = !{!770, !771, !772}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 1, scope: !766, file: !373, line: 218, type: !351)
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "refp", arg: 2, scope: !766, file: !373, line: 219, type: !350)
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxyp", arg: 3, scope: !766, file: !373, line: 219, type: !350)
!773 = !DISubprogram(name: "new_weakref", scope: !373, file: !373, line: 32, type: !774, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: %struct._PyWeakReference* (%struct._object*, %struct._object*)* @new_weakref, variables: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{!351, !5, !5}
!776 = !{!777, !778, !779}
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !773, file: !373, line: 32, type: !5)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !773, file: !373, line: 32, type: !5)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !773, file: !373, line: 34, type: !351)
!780 = !DISubprogram(name: "insert_head", scope: !373, file: !373, line: 256, type: !781, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*, %struct._PyWeakReference**)* @insert_head, variables: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !351, !350}
!783 = !{!784, !785, !786}
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newref", arg: 1, scope: !780, file: !373, line: 256, type: !351)
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !780, file: !373, line: 256, type: !350)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !780, file: !373, line: 258, type: !351)
!787 = !DISubprogram(name: "insert_after", scope: !373, file: !373, line: 243, type: !788, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*, %struct._PyWeakReference*)* @insert_after, variables: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !351, !351}
!790 = !{!791, !792}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newref", arg: 1, scope: !787, file: !373, line: 243, type: !351)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prev", arg: 2, scope: !787, file: !373, line: 243, type: !351)
!793 = !DISubprogram(name: "handle_callback", scope: !373, file: !373, line: 866, type: !794, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*, %struct._object*)* @handle_callback, variables: !796)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !351, !5}
!796 = !{!797, !798, !799, !800}
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 1, scope: !793, file: !373, line: 866, type: !351)
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !793, file: !373, line: 866, type: !5)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbresult", scope: !793, file: !373, line: 868, type: !5)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !373, line: 873, type: !5)
!801 = distinct !DILexicalBlock(scope: !802, file: !373, line: 873, column: 12)
!802 = distinct !DILexicalBlock(scope: !793, file: !373, line: 870, column: 9)
!803 = !{!804, !805, !806, !807, !815, !817, !822, !823, !824, !825, !828}
!804 = !DIGlobalVariable(name: "_PyWeakref_RefType", scope: !0, file: !373, line: 347, type: !552, isLocal: false, isDefinition: true, variable: %struct._typeobject* @_PyWeakref_RefType)
!805 = !DIGlobalVariable(name: "_PyWeakref_ProxyType", scope: !0, file: !373, line: 662, type: !552, isLocal: false, isDefinition: true, variable: %struct._typeobject* @_PyWeakref_ProxyType)
!806 = !DIGlobalVariable(name: "_PyWeakref_CallableProxyType", scope: !0, file: !373, line: 696, type: !552, isLocal: false, isDefinition: true, variable: %struct._typeobject* @_PyWeakref_CallableProxyType)
!807 = !DIGlobalVariable(name: "PyId___name__", scope: !480, file: !373, line: 159, type: !808, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @weakref_repr.PyId___name__)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !7, line: 144, baseType: !809)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !7, line: 140, size: 192, align: 64, elements: !810)
!810 = !{!811, !813, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !7, line: 141, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !809, file: !7, line: 142, baseType: !29, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !809, file: !7, line: 143, baseType: !5, size: 64, align: 64, offset: 128)
!815 = !DIGlobalVariable(name: "kwlist", scope: !497, file: !373, line: 130, type: !816, isLocal: true, isDefinition: true, variable: [1 x i8*]* @weakref_call.kwlist)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, align: 64, elements: !82)
!817 = !DIGlobalVariable(name: "weakref_members", scope: !0, file: !373, line: 341, type: !818, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @weakref_members)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 640, align: 64, elements: !820)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !291, line: 24, baseType: !290)
!820 = !{!821}
!821 = !DISubrange(count: 2)
!822 = !DIGlobalVariable(name: "proxy_as_number", scope: !0, file: !373, line: 606, type: !120, isLocal: true, isDefinition: true, variable: %struct.PyNumberMethods* @proxy_as_number)
!823 = !DIGlobalVariable(name: "proxy_as_sequence", scope: !0, file: !373, line: 643, type: !172, isLocal: true, isDefinition: true, variable: %struct.PySequenceMethods* @proxy_as_sequence)
!824 = !DIGlobalVariable(name: "proxy_as_mapping", scope: !0, file: !373, line: 654, type: !203, isLocal: true, isDefinition: true, variable: %struct.PyMappingMethods* @proxy_as_mapping)
!825 = !DIGlobalVariable(name: "proxy_methods", scope: !0, file: !373, line: 600, type: !826, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @proxy_methods)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 512, align: 64, elements: !820)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!828 = !DIGlobalVariable(name: "PyId___bytes__", scope: !758, file: !373, line: 597, type: !808, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @proxy_bytes.PyId___bytes__)
!829 = !{i32 2, !"Dwarf Version", i32 4}
!830 = !{i32 2, !"Debug Info Version", i32 3}
!831 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!832 = !{!833, !833, i64 0}
!833 = !{!"any pointer", !834, i64 0}
!834 = !{!"omnipotent char", !835, i64 0}
!835 = !{!"Simple C/C++ TBAA"}
!836 = !DIExpression()
!837 = !DILocation(line: 10, column: 45, scope: !372)
!838 = !DILocation(line: 12, column: 5, scope: !372)
!839 = !DILocation(line: 12, column: 16, scope: !372)
!840 = !{!841, !841, i64 0}
!841 = !{!"long", !834, i64 0}
!842 = !DILocation(line: 14, column: 5, scope: !372)
!843 = !DILocation(line: 14, column: 12, scope: !844)
!844 = !DILexicalBlockFile(scope: !845, file: !373, discriminator: 2)
!845 = !DILexicalBlockFile(scope: !372, file: !373, discriminator: 1)
!846 = !DILocation(line: 14, column: 17, scope: !372)
!847 = !DILocation(line: 15, column: 9, scope: !848)
!848 = distinct !DILexicalBlock(scope: !372, file: !373, line: 14, column: 32)
!849 = !DILocation(line: 16, column: 16, scope: !848)
!850 = !DILocation(line: 16, column: 22, scope: !848)
!851 = !{!852, !833, i64 48}
!852 = !{!"_PyWeakReference", !853, i64 0, !833, i64 16, !833, i64 24, !841, i64 32, !833, i64 40, !833, i64 48}
!853 = !{!"_object", !841, i64 0, !833, i64 8}
!854 = !DILocation(line: 16, column: 14, scope: !848)
!855 = !DILocation(line: 18, column: 12, scope: !372)
!856 = !DILocation(line: 19, column: 1, scope: !372)
!857 = !DILocation(line: 18, column: 5, scope: !372)
!858 = !DILocation(line: 89, column: 38, scope: !379)
!859 = !DILocation(line: 91, column: 5, scope: !379)
!860 = !DILocation(line: 91, column: 15, scope: !379)
!861 = !DILocation(line: 96, column: 16, scope: !379)
!862 = !DILocation(line: 96, column: 22, scope: !379)
!863 = !{!852, !833, i64 24}
!864 = !DILocation(line: 96, column: 14, scope: !379)
!865 = !DILocation(line: 97, column: 5, scope: !379)
