; ModuleID = 'irs-onlybc/xmlparse.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.XML_Feature = type { i32, i8*, i64 }

!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!93 = !DIEnumerator(name: "XML_ROLE_ERROR", value: -1)
!94 = !DIEnumerator(name: "XML_ROLE_NONE", value: 0)
!95 = !DIEnumerator(name: "XML_ROLE_XML_DECL", value: 1)
!96 = !DIEnumerator(name: "XML_ROLE_INSTANCE_START", value: 2)
!97 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_NONE", value: 3)
!98 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_NAME", value: 4)
!99 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_SYSTEM_ID", value: 5)
!100 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_PUBLIC_ID", value: 6)
!101 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_INTERNAL_SUBSET", value: 7)
!102 = !DIEnumerator(name: "XML_ROLE_DOCTYPE_CLOSE", value: 8)
!103 = !DIEnumerator(name: "XML_ROLE_GENERAL_ENTITY_NAME", value: 9)
!104 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_NAME", value: 10)
!105 = !DIEnumerator(name: "XML_ROLE_ENTITY_NONE", value: 11)
!106 = !DIEnumerator(name: "XML_ROLE_ENTITY_VALUE", value: 12)
!107 = !DIEnumerator(name: "XML_ROLE_ENTITY_SYSTEM_ID", value: 13)
!108 = !DIEnumerator(name: "XML_ROLE_ENTITY_PUBLIC_ID", value: 14)
!109 = !DIEnumerator(name: "XML_ROLE_ENTITY_COMPLETE", value: 15)
!110 = !DIEnumerator(name: "XML_ROLE_ENTITY_NOTATION_NAME", value: 16)
!111 = !DIEnumerator(name: "XML_ROLE_NOTATION_NONE", value: 17)
!112 = !DIEnumerator(name: "XML_ROLE_NOTATION_NAME", value: 18)
!113 = !DIEnumerator(name: "XML_ROLE_NOTATION_SYSTEM_ID", value: 19)
!114 = !DIEnumerator(name: "XML_ROLE_NOTATION_NO_SYSTEM_ID", value: 20)
!115 = !DIEnumerator(name: "XML_ROLE_NOTATION_PUBLIC_ID", value: 21)
!116 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NAME", value: 22)
!117 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_CDATA", value: 23)
!118 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ID", value: 24)
!119 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREF", value: 25)
!120 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREFS", value: 26)
!121 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITY", value: 27)
!122 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITIES", value: 28)
!123 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKEN", value: 29)
!124 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKENS", value: 30)
!125 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_ENUM_VALUE", value: 31)
!126 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NOTATION_VALUE", value: 32)
!127 = !DIEnumerator(name: "XML_ROLE_ATTLIST_NONE", value: 33)
!128 = !DIEnumerator(name: "XML_ROLE_ATTLIST_ELEMENT_NAME", value: 34)
!129 = !DIEnumerator(name: "XML_ROLE_IMPLIED_ATTRIBUTE_VALUE", value: 35)
!130 = !DIEnumerator(name: "XML_ROLE_REQUIRED_ATTRIBUTE_VALUE", value: 36)
!131 = !DIEnumerator(name: "XML_ROLE_DEFAULT_ATTRIBUTE_VALUE", value: 37)
!132 = !DIEnumerator(name: "XML_ROLE_FIXED_ATTRIBUTE_VALUE", value: 38)
!133 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NONE", value: 39)
!134 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NAME", value: 40)
!135 = !DIEnumerator(name: "XML_ROLE_CONTENT_ANY", value: 41)
!136 = !DIEnumerator(name: "XML_ROLE_CONTENT_EMPTY", value: 42)
!137 = !DIEnumerator(name: "XML_ROLE_CONTENT_PCDATA", value: 43)
!138 = !DIEnumerator(name: "XML_ROLE_GROUP_OPEN", value: 44)
!139 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE", value: 45)
!140 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_REP", value: 46)
!141 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_OPT", value: 47)
!142 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_PLUS", value: 48)
!143 = !DIEnumerator(name: "XML_ROLE_GROUP_CHOICE", value: 49)
!144 = !DIEnumerator(name: "XML_ROLE_GROUP_SEQUENCE", value: 50)
!145 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT", value: 51)
!146 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_REP", value: 52)
!147 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_OPT", value: 53)
!148 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_PLUS", value: 54)
!149 = !DIEnumerator(name: "XML_ROLE_PI", value: 55)
!150 = !DIEnumerator(name: "XML_ROLE_COMMENT", value: 56)
!151 = !DIEnumerator(name: "XML_ROLE_TEXT_DECL", value: 57)
!152 = !DIEnumerator(name: "XML_ROLE_IGNORE_SECT", value: 58)
!153 = !DIEnumerator(name: "XML_ROLE_INNER_PARAM_ENTITY_REF", value: 59)
!154 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_REF", value: 60)
!155 = !{!156, !158, !159, !221, !167, !653, !358, !200, !525, !445, !595, !293, !178, !534, !180, !157, !535, !201, !598, !654, !655, !210, !479, !473, !627, !521, !485, !513, !554, !579, !436}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Bool", file: !4, line: 28, baseType: !157)
!157 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Parser", file: !4, line: 25, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "XML_ParserStruct", file: !162, line: 459, size: 7488, align: 64, elements: !163)
!162 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmlparse.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!163 = !{!164, !165, !166, !169, !189, !192, !193, !194, !198, !199, !202, !203, !211, !216, !222, !227, !229, !231, !233, !235, !240, !242, !247, !252, !254, !256, !261, !266, !267, !269, !288, !303, !308, !313, !318, !397, !404, !405, !406, !407, !408, !409, !410, !411, !412, !426, !431, !432, !433, !434, !435, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !520, !522, !523, !524, !596, !597, !619, !620, !621, !622, !623, !624, !625, !626, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !649, !650, !651, !652}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "m_userData", scope: !161, file: !162, line: 462, baseType: !158, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "m_handlerArg", scope: !161, file: !162, line: 463, baseType: !158, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "m_buffer", scope: !161, file: !162, line: 464, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_mem", scope: !161, file: !162, line: 465, baseType: !170, size: 192, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Memory_Handling_Suite", file: !4, line: 200, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 196, size: 192, align: 64, elements: !173)
!173 = !{!174, !181, !185}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fcn", scope: !172, file: !4, line: 197, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!158, !178}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 62, baseType: !180)
!179 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!180 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_fcn", scope: !172, file: !4, line: 198, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!158, !158, !178}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "free_fcn", scope: !172, file: !4, line: 199, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !158}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "m_bufferPtr", scope: !161, file: !162, line: 467, baseType: !190, size: 64, align: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "m_bufferEnd", scope: !161, file: !162, line: 469, baseType: !167, size: 64, align: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "m_bufferLim", scope: !161, file: !162, line: 471, baseType: !190, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "m_parseEndByteIndex", scope: !161, file: !162, line: 472, baseType: !195, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Index", file: !196, line: 111, baseType: !197)
!196 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/expat_external.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!197 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "m_parseEndPtr", scope: !161, file: !162, line: 473, baseType: !190, size: 64, align: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "m_dataBuf", scope: !161, file: !162, line: 474, baseType: !200, size: 64, align: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Char", file: !196, line: 98, baseType: !168)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "m_dataBufEnd", scope: !161, file: !162, line: 475, baseType: !200, size: 64, align: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "m_startElementHandler", scope: !161, file: !162, line: 476, baseType: !204, size: 64, align: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartElementHandler", file: !4, line: 252, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !158, !208, !210}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "m_endElementHandler", scope: !161, file: !162, line: 477, baseType: !212, size: 64, align: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndElementHandler", file: !4, line: 256, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !158, !208}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "m_characterDataHandler", scope: !161, file: !162, line: 478, baseType: !217, size: 64, align: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_CharacterDataHandler", file: !4, line: 261, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !158, !208, !221}
!221 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "m_processingInstructionHandler", scope: !161, file: !162, line: 479, baseType: !223, size: 64, align: 64, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ProcessingInstructionHandler", file: !4, line: 266, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !158, !208, !208}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "m_commentHandler", scope: !161, file: !162, line: 480, baseType: !228, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_CommentHandler", file: !4, line: 272, baseType: !213)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "m_startCdataSectionHandler", scope: !161, file: !162, line: 481, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartCdataSectionHandler", file: !4, line: 275, baseType: !186)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "m_endCdataSectionHandler", scope: !161, file: !162, line: 482, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndCdataSectionHandler", file: !4, line: 276, baseType: !186)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "m_defaultHandler", scope: !161, file: !162, line: 483, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_DefaultHandler", file: !4, line: 291, baseType: !218)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "m_startDoctypeDeclHandler", scope: !161, file: !162, line: 484, baseType: !236, size: 64, align: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartDoctypeDeclHandler", file: !4, line: 298, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !158, !208, !208, !208, !221}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "m_endDoctypeDeclHandler", scope: !161, file: !162, line: 485, baseType: !241, size: 64, align: 64, offset: 1408)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndDoctypeDeclHandler", file: !4, line: 309, baseType: !186)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "m_unparsedEntityDeclHandler", scope: !161, file: !162, line: 486, baseType: !243, size: 64, align: 64, offset: 1472)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_UnparsedEntityDeclHandler", file: !4, line: 353, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !158, !208, !208, !208, !208, !208}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "m_notationDeclHandler", scope: !161, file: !162, line: 487, baseType: !248, size: 64, align: 64, offset: 1536)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_NotationDeclHandler", file: !4, line: 365, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !158, !208, !208, !208, !208}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "m_startNamespaceDeclHandler", scope: !161, file: !162, line: 488, baseType: !253, size: 64, align: 64, offset: 1600)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartNamespaceDeclHandler", file: !4, line: 378, baseType: !224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "m_endNamespaceDeclHandler", scope: !161, file: !162, line: 489, baseType: !255, size: 64, align: 64, offset: 1664)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndNamespaceDeclHandler", file: !4, line: 383, baseType: !213)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "m_notStandaloneHandler", scope: !161, file: !162, line: 490, baseType: !257, size: 64, align: 64, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_NotStandaloneHandler", file: !4, line: 396, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!221, !158}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "m_externalEntityRefHandler", scope: !161, file: !162, line: 491, baseType: !262, size: 64, align: 64, offset: 1792)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ExternalEntityRefHandler", file: !4, line: 432, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!221, !159, !208, !208, !208, !208}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "m_externalEntityRefHandlerArg", scope: !161, file: !162, line: 492, baseType: !159, size: 64, align: 64, offset: 1856)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "m_skippedEntityHandler", scope: !161, file: !162, line: 493, baseType: !268, size: 64, align: 64, offset: 1920)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_SkippedEntityHandler", file: !4, line: 449, baseType: !218)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingHandler", scope: !161, file: !162, line: 494, baseType: !270, size: 64, align: 64, offset: 1984)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_UnknownEncodingHandler", file: !4, line: 528, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!221, !158, !208, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Encoding", file: !4, line: 511, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 506, size: 8384, align: 64, elements: !277)
!277 = !{!278, !282, !283, !287}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !276, file: !4, line: 507, baseType: !279, size: 8192, align: 32)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 8192, align: 32, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !4, line: 508, baseType: !158, size: 64, align: 64, offset: 8192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !276, file: !4, line: 509, baseType: !284, size: 64, align: 64, offset: 8256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!221, !158, !190}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !276, file: !4, line: 510, baseType: !186, size: 64, align: 64, offset: 8320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "m_elementDeclHandler", scope: !161, file: !162, line: 495, baseType: !289, size: 64, align: 64, offset: 2048)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ElementDeclHandler", file: !4, line: 150, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !158, !208, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Content", file: !4, line: 135, baseType: !295)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "XML_cp", file: !4, line: 137, size: 256, align: 64, elements: !296)
!296 = !{!297, !298, !299, !300, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !4, line: 138, baseType: !3, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "quant", scope: !295, file: !4, line: 139, baseType: !12, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !4, line: 140, baseType: !200, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "numchildren", scope: !295, file: !4, line: 141, baseType: !301, size: 32, align: 32, offset: 128)
!301 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !295, file: !4, line: 142, baseType: !293, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "m_attlistDeclHandler", scope: !161, file: !162, line: 496, baseType: !304, size: 64, align: 64, offset: 2112)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_AttlistDeclHandler", file: !4, line: 166, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !158, !208, !208, !208, !208, !221}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "m_entityDeclHandler", scope: !161, file: !162, line: 497, baseType: !309, size: 64, align: 64, offset: 2176)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EntityDeclHandler", file: !4, line: 329, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !158, !208, !221, !208, !221, !208, !208, !208, !208}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "m_xmlDeclHandler", scope: !161, file: !162, line: 498, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_XmlDeclHandler", file: !4, line: 186, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !158, !208, !208, !221}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "m_encoding", scope: !161, file: !162, line: 499, baseType: !319, size: 64, align: 64, offset: 2304)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENCODING", file: !322, line: 126, baseType: !323)
!322 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmltok.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "encoding", file: !322, line: 133, size: 1152, align: 64, elements: !324)
!324 = !{!325, !334, !338, !342, !346, !350, !354, !366, !367, !368, !379, !380, !385, !394, !395, !396}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scanners", scope: !323, file: !322, line: 134, baseType: !326, size: 256, align: 64)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 256, align: 64, elements: !332)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCANNER", file: !322, line: 128, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!221, !319, !190, !190, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!332 = !{!333}
!333 = !DISubrange(count: 4)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "literalScanners", scope: !323, file: !322, line: 135, baseType: !335, size: 128, align: 64, offset: 256)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 128, align: 64, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 2)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sameName", scope: !323, file: !322, line: 136, baseType: !339, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!221, !319, !190, !190}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nameMatchesAscii", scope: !323, file: !322, line: 139, baseType: !343, size: 64, align: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!221, !319, !190, !190, !190}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !323, file: !322, line: 143, baseType: !347, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!221, !319, !190}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "skipS", scope: !323, file: !322, line: 144, baseType: !351, size: 64, align: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!190, !319, !190}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "getAtts", scope: !323, file: !322, line: 145, baseType: !355, size: 64, align: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!221, !319, !190, !221, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE", file: !322, line: 123, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 118, size: 256, align: 64, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !360, file: !322, line: 119, baseType: !190, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !360, file: !322, line: 120, baseType: !190, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "valueEnd", scope: !360, file: !322, line: 121, baseType: !190, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !360, file: !322, line: 122, baseType: !168, size: 8, align: 8, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "charRefNumber", scope: !323, file: !322, line: 149, baseType: !347, size: 64, align: 64, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "predefinedEntityName", scope: !323, file: !322, line: 150, baseType: !339, size: 64, align: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "updatePosition", scope: !323, file: !322, line: 153, baseType: !369, size: 64, align: 64, offset: 832)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !319, !190, !190, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "POSITION", file: !322, line: 116, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "position", file: !322, line: 112, size: 128, align: 64, elements: !375)
!375 = !{!376, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !374, file: !322, line: 114, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Size", file: !196, line: 112, baseType: !180)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "columnNumber", scope: !374, file: !322, line: 115, baseType: !377, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "isPublicId", scope: !323, file: !322, line: 157, baseType: !328, size: 64, align: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Convert", scope: !323, file: !322, line: 161, baseType: !381, size: 64, align: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !319, !331, !190, !384, !190}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "utf16Convert", scope: !323, file: !322, line: 166, baseType: !386, size: 64, align: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !319, !331, !190, !389, !392}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "minBytesPerChar", scope: !323, file: !322, line: 171, baseType: !221, size: 32, align: 32, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf8", scope: !323, file: !322, line: 172, baseType: !168, size: 8, align: 8, offset: 1120)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf16", scope: !323, file: !322, line: 173, baseType: !168, size: 8, align: 8, offset: 1128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "m_initEncoding", scope: !161, file: !162, line: 500, baseType: !398, size: 1216, align: 64, offset: 2368)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "INIT_ENCODING", file: !322, line: 264, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 261, size: 1216, align: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "initEnc", scope: !399, file: !322, line: 262, baseType: !321, size: 1152, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "encPtr", scope: !399, file: !322, line: 263, baseType: !403, size: 64, align: 64, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "m_internalEncoding", scope: !161, file: !162, line: 501, baseType: !319, size: 64, align: 64, offset: 3584)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "m_protocolEncodingName", scope: !161, file: !162, line: 502, baseType: !208, size: 64, align: 64, offset: 3648)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "m_ns", scope: !161, file: !162, line: 503, baseType: !156, size: 8, align: 8, offset: 3712)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "m_ns_triplets", scope: !161, file: !162, line: 504, baseType: !156, size: 8, align: 8, offset: 3720)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingMem", scope: !161, file: !162, line: 505, baseType: !158, size: 64, align: 64, offset: 3776)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingData", scope: !161, file: !162, line: 506, baseType: !158, size: 64, align: 64, offset: 3840)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingHandlerData", scope: !161, file: !162, line: 507, baseType: !158, size: 64, align: 64, offset: 3904)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "m_unknownEncodingRelease", scope: !161, file: !162, line: 508, baseType: !186, size: 64, align: 64, offset: 3968)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "m_prologState", scope: !161, file: !162, line: 509, baseType: !413, size: 256, align: 64, offset: 4032)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROLOG_STATE", file: !91, line: 100, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "prolog_state", file: !91, line: 87, size: 256, align: 64, elements: !415)
!415 = !{!416, !421, !422, !423, !424, !425}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !414, file: !91, line: 88, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!221, !420, !221, !190, !190, !319}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !414, file: !91, line: 93, baseType: !301, size: 32, align: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "role_none", scope: !414, file: !91, line: 94, baseType: !221, size: 32, align: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "includeLevel", scope: !414, file: !91, line: 96, baseType: !301, size: 32, align: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "documentEntity", scope: !414, file: !91, line: 97, baseType: !221, size: 32, align: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "inEntityValue", scope: !414, file: !91, line: 98, baseType: !221, size: 32, align: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "m_processor", scope: !161, file: !162, line: 510, baseType: !427, size: 64, align: 64, offset: 4288)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Processor", file: !162, line: 300, baseType: !429)
!429 = !DISubroutineType(types: !430)
!430 = !{!18, !159, !190, !190, !331}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "m_errorCode", scope: !161, file: !162, line: 511, baseType: !18, size: 32, align: 32, offset: 4352)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "m_eventPtr", scope: !161, file: !162, line: 512, baseType: !190, size: 64, align: 64, offset: 4416)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "m_eventEndPtr", scope: !161, file: !162, line: 513, baseType: !190, size: 64, align: 64, offset: 4480)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "m_positionPtr", scope: !161, file: !162, line: 514, baseType: !190, size: 64, align: 64, offset: 4544)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "m_openInternalEntities", scope: !161, file: !162, line: 515, baseType: !436, size: 64, align: 64, offset: 4608)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPEN_INTERNAL_ENTITY", file: !162, line: 298, baseType: !438)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "open_internal_entity", file: !162, line: 291, size: 320, align: 64, elements: !439)
!439 = !{!440, !441, !442, !444, !460, !461}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "internalEventPtr", scope: !438, file: !162, line: 292, baseType: !190, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "internalEventEndPtr", scope: !438, file: !162, line: 293, baseType: !190, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !162, line: 294, baseType: !443, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "entity", scope: !438, file: !162, line: 295, baseType: !445, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTITY", file: !162, line: 203, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 191, size: 512, align: 64, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !162, line: 192, baseType: !208, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "textPtr", scope: !447, file: !162, line: 193, baseType: !208, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "textLen", scope: !447, file: !162, line: 194, baseType: !221, size: 32, align: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "processed", scope: !447, file: !162, line: 195, baseType: !221, size: 32, align: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "systemId", scope: !447, file: !162, line: 196, baseType: !208, size: 64, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !447, file: !162, line: 197, baseType: !208, size: 64, align: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "publicId", scope: !447, file: !162, line: 198, baseType: !208, size: 64, align: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "notation", scope: !447, file: !162, line: 199, baseType: !208, size: 64, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !447, file: !162, line: 200, baseType: !156, size: 8, align: 8, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "is_param", scope: !447, file: !162, line: 201, baseType: !156, size: 8, align: 8, offset: 456)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal", scope: !447, file: !162, line: 202, baseType: !156, size: 8, align: 8, offset: 464)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "startTagLevel", scope: !438, file: !162, line: 296, baseType: !221, size: 32, align: 32, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "betweenDecl", scope: !438, file: !162, line: 297, baseType: !156, size: 8, align: 8, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "m_freeInternalEntities", scope: !161, file: !162, line: 516, baseType: !436, size: 64, align: 64, offset: 4672)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "m_defaultExpandInternalEntities", scope: !161, file: !162, line: 517, baseType: !156, size: 8, align: 8, offset: 4736)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "m_tagLevel", scope: !161, file: !162, line: 518, baseType: !221, size: 32, align: 32, offset: 4768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "m_declEntity", scope: !161, file: !162, line: 519, baseType: !445, size: 64, align: 64, offset: 4800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "m_doctypeName", scope: !161, file: !162, line: 520, baseType: !208, size: 64, align: 64, offset: 4864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "m_doctypeSysid", scope: !161, file: !162, line: 521, baseType: !208, size: 64, align: 64, offset: 4928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "m_doctypePubid", scope: !161, file: !162, line: 522, baseType: !208, size: 64, align: 64, offset: 4992)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeType", scope: !161, file: !162, line: 523, baseType: !208, size: 64, align: 64, offset: 5056)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "m_declNotationName", scope: !161, file: !162, line: 524, baseType: !208, size: 64, align: 64, offset: 5120)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "m_declNotationPublicId", scope: !161, file: !162, line: 525, baseType: !208, size: 64, align: 64, offset: 5184)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "m_declElementType", scope: !161, file: !162, line: 526, baseType: !473, size: 64, align: 64, offset: 5248)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELEMENT_TYPE", file: !162, line: 260, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 253, size: 320, align: 64, elements: !476)
!476 = !{!477, !478, !506, !510, !511, !512}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !475, file: !162, line: 254, baseType: !208, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !475, file: !162, line: 255, baseType: !479, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PREFIX", file: !162, line: 157, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "prefix", file: !162, line: 154, size: 128, align: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !481, file: !162, line: 155, baseType: !208, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !481, file: !162, line: 156, baseType: !485, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "BINDING", file: !162, line: 152, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "binding", file: !162, line: 144, size: 384, align: 64, elements: !488)
!488 = !{!489, !491, !493, !494, !503, !504, !505}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !487, file: !162, line: 145, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nextTagBinding", scope: !487, file: !162, line: 146, baseType: !492, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prevPrefixBinding", scope: !487, file: !162, line: 147, baseType: !492, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "attId", scope: !487, file: !162, line: 148, baseType: !495, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_id", file: !162, line: 234, size: 192, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !497, file: !162, line: 235, baseType: !200, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !497, file: !162, line: 236, baseType: !479, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "maybeTokenized", scope: !497, file: !162, line: 237, baseType: !156, size: 8, align: 8, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "xmlns", scope: !497, file: !162, line: 238, baseType: !156, size: 8, align: 8, offset: 136)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !487, file: !162, line: 149, baseType: !200, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "uriLen", scope: !487, file: !162, line: 150, baseType: !221, size: 32, align: 32, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "uriAlloc", scope: !487, file: !162, line: 151, baseType: !221, size: 32, align: 32, offset: 352)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "idAtt", scope: !475, file: !162, line: 256, baseType: !507, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE_ID", file: !162, line: 239, baseType: !497)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nDefaultAtts", scope: !475, file: !162, line: 257, baseType: !221, size: 32, align: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "allocDefaultAtts", scope: !475, file: !162, line: 258, baseType: !221, size: 32, align: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "defaultAtts", scope: !475, file: !162, line: 259, baseType: !513, size: 64, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEFAULT_ATTRIBUTE", file: !162, line: 245, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 241, size: 192, align: 64, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !515, file: !162, line: 242, baseType: !507, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "isCdata", scope: !515, file: !162, line: 243, baseType: !156, size: 8, align: 8, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !515, file: !162, line: 244, baseType: !208, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeId", scope: !161, file: !162, line: 527, baseType: !521, size: 64, align: 64, offset: 5312)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeIsCdata", scope: !161, file: !162, line: 528, baseType: !156, size: 8, align: 8, offset: 5376)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "m_declAttributeIsId", scope: !161, file: !162, line: 529, baseType: !156, size: 8, align: 8, offset: 5384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "m_dtd", scope: !161, file: !162, line: 530, baseType: !525, size: 64, align: 64, offset: 5440)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "DTD", file: !162, line: 289, baseType: !527)
!527 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 262, size: 2880, align: 64, elements: !528)
!528 = !{!529, !546, !547, !548, !549, !570, !571, !572, !573, !574, !575, !576, !577, !578, !590, !591, !592, !593, !594}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "generalEntities", scope: !527, file: !162, line: 263, baseType: !530, size: 320, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASH_TABLE", file: !162, line: 103, baseType: !531)
!531 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 97, size: 320, align: 64, elements: !532)
!532 = !{!533, !541, !542, !543, !544}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !531, file: !162, line: 98, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAMED", file: !162, line: 95, baseType: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 93, size: 64, align: 64, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !537, file: !162, line: 94, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEY", file: !162, line: 91, baseType: !208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !531, file: !162, line: 99, baseType: !157, size: 8, align: 8, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !531, file: !162, line: 100, baseType: !178, size: 64, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !531, file: !162, line: 101, baseType: !178, size: 64, align: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !531, file: !162, line: 102, baseType: !545, size: 64, align: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "elementTypes", scope: !527, file: !162, line: 264, baseType: !530, size: 320, align: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "attributeIds", scope: !527, file: !162, line: 265, baseType: !530, size: 320, align: 64, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !527, file: !162, line: 266, baseType: !530, size: 320, align: 64, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !527, file: !162, line: 267, baseType: !550, size: 384, align: 64, offset: 1280)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRING_POOL", file: !162, line: 230, baseType: !551)
!551 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 223, size: 384, align: 64, elements: !552)
!552 = !{!553, !565, !566, !567, !568, !569}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !551, file: !162, line: 224, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLOCK", file: !162, line: 221, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "block", file: !162, line: 217, size: 128, align: 64, elements: !557)
!557 = !{!558, !560, !561}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !162, line: 218, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !162, line: 219, baseType: !221, size: 32, align: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !556, file: !162, line: 220, baseType: !562, size: 8, align: 8, offset: 96)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8, align: 8, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 1)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "freeBlocks", scope: !551, file: !162, line: 225, baseType: !554, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !551, file: !162, line: 226, baseType: !208, size: 64, align: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !551, file: !162, line: 227, baseType: !200, size: 64, align: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !551, file: !162, line: 228, baseType: !200, size: 64, align: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !551, file: !162, line: 229, baseType: !545, size: 64, align: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "entityValuePool", scope: !527, file: !162, line: 268, baseType: !550, size: 384, align: 64, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "keepProcessing", scope: !527, file: !162, line: 270, baseType: !156, size: 8, align: 8, offset: 2048)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "hasParamEntityRefs", scope: !527, file: !162, line: 273, baseType: !156, size: 8, align: 8, offset: 2056)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !527, file: !162, line: 274, baseType: !156, size: 8, align: 8, offset: 2064)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "paramEntityRead", scope: !527, file: !162, line: 277, baseType: !156, size: 8, align: 8, offset: 2072)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "paramEntities", scope: !527, file: !162, line: 278, baseType: !530, size: 320, align: 64, offset: 2112)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "defaultPrefix", scope: !527, file: !162, line: 280, baseType: !480, size: 128, align: 64, offset: 2432)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "in_eldecl", scope: !527, file: !162, line: 282, baseType: !156, size: 8, align: 8, offset: 2560)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "scaffold", scope: !527, file: !162, line: 283, baseType: !579, size: 64, align: 64, offset: 2624)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONTENT_SCAFFOLD", file: !162, line: 213, baseType: !581)
!581 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 205, size: 256, align: 64, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !162, line: 206, baseType: !3, size: 32, align: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "quant", scope: !581, file: !162, line: 207, baseType: !12, size: 32, align: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !581, file: !162, line: 208, baseType: !208, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "firstchild", scope: !581, file: !162, line: 209, baseType: !221, size: 32, align: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lastchild", scope: !581, file: !162, line: 210, baseType: !221, size: 32, align: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "childcnt", scope: !581, file: !162, line: 211, baseType: !221, size: 32, align: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nextsib", scope: !581, file: !162, line: 212, baseType: !221, size: 32, align: 32, offset: 224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "contentStringLen", scope: !527, file: !162, line: 284, baseType: !301, size: 32, align: 32, offset: 2688)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "scaffSize", scope: !527, file: !162, line: 285, baseType: !301, size: 32, align: 32, offset: 2720)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "scaffCount", scope: !527, file: !162, line: 286, baseType: !301, size: 32, align: 32, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "scaffLevel", scope: !527, file: !162, line: 287, baseType: !221, size: 32, align: 32, offset: 2784)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "scaffIndex", scope: !527, file: !162, line: 288, baseType: !595, size: 64, align: 64, offset: 2816)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "m_curBase", scope: !161, file: !162, line: 531, baseType: !208, size: 64, align: 64, offset: 5504)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "m_tagStack", scope: !161, file: !162, line: 532, baseType: !598, size: 64, align: 64, offset: 5568)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAG", file: !162, line: 189, baseType: !600)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "tag", file: !162, line: 181, size: 704, align: 64, elements: !601)
!601 = !{!602, !604, !605, !606, !616, !617, !618}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !600, file: !162, line: 182, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rawName", scope: !600, file: !162, line: 183, baseType: !190, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rawNameLength", scope: !600, file: !162, line: 184, baseType: !221, size: 32, align: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !600, file: !162, line: 185, baseType: !607, size: 320, align: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAG_NAME", file: !162, line: 166, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 159, size: 320, align: 64, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !608, file: !162, line: 160, baseType: !208, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "localPart", scope: !608, file: !162, line: 161, baseType: !208, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !608, file: !162, line: 162, baseType: !208, size: 64, align: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "strLen", scope: !608, file: !162, line: 163, baseType: !221, size: 32, align: 32, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "uriLen", scope: !608, file: !162, line: 164, baseType: !221, size: 32, align: 32, offset: 224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prefixLen", scope: !608, file: !162, line: 165, baseType: !221, size: 32, align: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !600, file: !162, line: 186, baseType: !167, size: 64, align: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bufEnd", scope: !600, file: !162, line: 187, baseType: !167, size: 64, align: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bindings", scope: !600, file: !162, line: 188, baseType: !485, size: 64, align: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "m_freeTagList", scope: !161, file: !162, line: 533, baseType: !598, size: 64, align: 64, offset: 5632)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "m_inheritedBindings", scope: !161, file: !162, line: 534, baseType: !485, size: 64, align: 64, offset: 5696)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "m_freeBindingList", scope: !161, file: !162, line: 535, baseType: !485, size: 64, align: 64, offset: 5760)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "m_attsSize", scope: !161, file: !162, line: 536, baseType: !221, size: 32, align: 32, offset: 5824)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "m_nSpecifiedAtts", scope: !161, file: !162, line: 537, baseType: !221, size: 32, align: 32, offset: 5856)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "m_idAttIndex", scope: !161, file: !162, line: 538, baseType: !221, size: 32, align: 32, offset: 5888)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "m_atts", scope: !161, file: !162, line: 539, baseType: !358, size: 64, align: 64, offset: 5952)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "m_nsAtts", scope: !161, file: !162, line: 540, baseType: !627, size: 64, align: 64, offset: 6016)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "NS_ATT", file: !162, line: 251, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 247, size: 192, align: 64, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !629, file: !162, line: 248, baseType: !180, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !629, file: !162, line: 249, baseType: !180, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "uriName", scope: !629, file: !162, line: 250, baseType: !208, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m_nsAttsVersion", scope: !161, file: !162, line: 541, baseType: !180, size: 64, align: 64, offset: 6080)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m_nsAttsPower", scope: !161, file: !162, line: 542, baseType: !157, size: 8, align: 8, offset: 6144)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m_position", scope: !161, file: !162, line: 546, baseType: !373, size: 128, align: 64, offset: 6208)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m_tempPool", scope: !161, file: !162, line: 547, baseType: !550, size: 384, align: 64, offset: 6336)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m_temp2Pool", scope: !161, file: !162, line: 548, baseType: !550, size: 384, align: 64, offset: 6720)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m_groupConnector", scope: !161, file: !162, line: 549, baseType: !167, size: 64, align: 64, offset: 7104)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "m_groupSize", scope: !161, file: !162, line: 550, baseType: !301, size: 32, align: 32, offset: 7168)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "m_namespaceSeparator", scope: !161, file: !162, line: 551, baseType: !201, size: 8, align: 8, offset: 7200)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m_parentParser", scope: !161, file: !162, line: 552, baseType: !159, size: 64, align: 64, offset: 7232)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m_parsingStatus", scope: !161, file: !162, line: 553, baseType: !644, size: 64, align: 32, offset: 7296)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ParsingStatus", file: !4, line: 845, baseType: !645)
!645 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 842, size: 64, align: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "parsing", scope: !645, file: !4, line: 843, baseType: !61, size: 32, align: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "finalBuffer", scope: !645, file: !4, line: 844, baseType: !156, size: 8, align: 8, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "m_isParamEntity", scope: !161, file: !162, line: 555, baseType: !156, size: 8, align: 8, offset: 7360)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "m_useForeignDTD", scope: !161, file: !162, line: 556, baseType: !156, size: 8, align: 8, offset: 7368)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "m_paramEntityParsing", scope: !161, file: !162, line: 557, baseType: !67, size: 32, align: 32, offset: 7392)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "m_hash_secret_salt", scope: !161, file: !162, line: 559, baseType: !180, size: 64, align: 64, offset: 7424)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ICHAR", file: !162, line: 44, baseType: !168)
!657 = !{!658, !663, !671, !678, !690, !696, !738, !753, !756, !762, !768, !774, !778, !783, !788, !791, !798, !804, !810, !816, !822, !828, !835, !841, !847, !853, !857, !864, !870, !876, !882, !888, !895, !901, !907, !913, !919, !923, !929, !936, !942, !948, !954, !960, !966, !972, !983, !992, !1013, !1019, !1025, !1032, !1037, !1042, !1045, !1052, !1057, !1060, !1066, !1072, !1079, !1083, !1086, !1094, !1098, !1109, !1120, !1134, !1140, !1147, !1154, !1162, !1168, !1175, !1179, !1193, !1201, !1309, !1330, !1338, !1367, !1374, !1380, !1387, !1394, !1487, !1514, !1523, !1530, !1626, !1641, !1660, !1671, !1703, !1710, !1717, !1730, !1741, !1764, !1770, !1776, !1796, !1813, !1824, !1852, !1878, !1891, !1898, !1910, !1925, !1943, !1953, !1971, !1982, !1986, !1993, !2003, !2006, !2011, !2018, !2026, !2037, !2044, !2060, !2070, !2078, !2084, !2098, !2111, !2122, !2128, !2140, !2144, !2177, !2204, !2211, !2221, !2229}
!658 = !DISubprogram(name: "PyExpat_XML_ParserCreate", scope: !162, file: !162, line: 671, type: !659, isLocal: false, isDefinition: true, scopeLine: 672, flags: DIFlagPrototyped, isOptimized: true, function: %struct.XML_ParserStruct* (i8*)* @PyExpat_XML_ParserCreate, variables: !661)
!659 = !DISubroutineType(types: !660)
!660 = !{!159, !208}
!661 = !{!662}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encodingName", arg: 1, scope: !658, file: !162, line: 671, type: !208)
!663 = !DISubprogram(name: "PyExpat_XML_ParserCreateNS", scope: !162, file: !162, line: 677, type: !664, isLocal: false, isDefinition: true, scopeLine: 678, flags: DIFlagPrototyped, isOptimized: true, function: %struct.XML_ParserStruct* (i8*, i8)* @PyExpat_XML_ParserCreateNS, variables: !666)
!664 = !DISubroutineType(types: !665)
!665 = !{!159, !208, !201}
!666 = !{!667, !668, !669}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encodingName", arg: 1, scope: !663, file: !162, line: 677, type: !208)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsSep", arg: 2, scope: !663, file: !162, line: 677, type: !201)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !663, file: !162, line: 679, type: !670)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 16, align: 8, elements: !336)
!671 = !DISubprogram(name: "PyExpat_XML_ParserCreate_MM", scope: !162, file: !162, line: 717, type: !672, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: true, function: %struct.XML_ParserStruct* (i8*, %struct.XML_Memory_Handling_Suite*, i8*)* @PyExpat_XML_ParserCreate_MM, variables: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{!159, !208, !545, !208}
!674 = !{!675, !676, !677}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encodingName", arg: 1, scope: !671, file: !162, line: 717, type: !208)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "memsuite", arg: 2, scope: !671, file: !162, line: 718, type: !545)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nameSep", arg: 3, scope: !671, file: !162, line: 719, type: !208)
!678 = !DISubprogram(name: "PyExpat_XML_ParserReset", scope: !162, file: !162, line: 925, type: !679, isLocal: false, isDefinition: true, scopeLine: 926, flags: DIFlagPrototyped, isOptimized: true, function: i8 (%struct.XML_ParserStruct*, i8*)* @PyExpat_XML_ParserReset, variables: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{!156, !159, !208}
!681 = !{!682, !683, !684, !685, !686, !688}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !678, file: !162, line: 925, type: !159)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encodingName", arg: 2, scope: !678, file: !162, line: 925, type: !208)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tStk", scope: !678, file: !162, line: 927, type: !598)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "openEntityList", scope: !678, file: !162, line: 928, type: !436)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tag", scope: !687, file: !162, line: 934, type: !598)
!687 = distinct !DILexicalBlock(scope: !678, file: !162, line: 933, column: 16)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "openEntity", scope: !689, file: !162, line: 944, type: !436)
!689 = distinct !DILexicalBlock(scope: !678, file: !162, line: 943, column: 26)
!690 = !DISubprogram(name: "PyExpat_XML_SetEncoding", scope: !162, file: !162, line: 961, type: !691, isLocal: false, isDefinition: true, scopeLine: 962, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i8*)* @PyExpat_XML_SetEncoding, variables: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{!72, !159, !208}
!693 = !{!694, !695}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !690, file: !162, line: 961, type: !159)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encodingName", arg: 2, scope: !690, file: !162, line: 961, type: !208)
!696 = !DISubprogram(name: "PyExpat_XML_ExternalEntityParserCreate", scope: !162, file: !162, line: 980, type: !697, isLocal: false, isDefinition: true, scopeLine: 983, flags: DIFlagPrototyped, isOptimized: true, function: %struct.XML_ParserStruct* (%struct.XML_ParserStruct*, i8*, i8*)* @PyExpat_XML_ExternalEntityParserCreate, variables: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{!159, !159, !208, !208}
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldParser", arg: 1, scope: !696, file: !162, line: 980, type: !159)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !696, file: !162, line: 981, type: !208)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encodingName", arg: 3, scope: !696, file: !162, line: 982, type: !208)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parser", scope: !696, file: !162, line: 984, type: !159)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newDtd", scope: !696, file: !162, line: 985, type: !525)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldDtd", scope: !696, file: !162, line: 986, type: !525)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldStartElementHandler", scope: !696, file: !162, line: 987, type: !204)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldEndElementHandler", scope: !696, file: !162, line: 988, type: !212)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldCharacterDataHandler", scope: !696, file: !162, line: 989, type: !217)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldProcessingInstructionHandler", scope: !696, file: !162, line: 990, type: !223)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldCommentHandler", scope: !696, file: !162, line: 992, type: !228)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldStartCdataSectionHandler", scope: !696, file: !162, line: 993, type: !230)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldEndCdataSectionHandler", scope: !696, file: !162, line: 995, type: !232)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldDefaultHandler", scope: !696, file: !162, line: 997, type: !234)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldUnparsedEntityDeclHandler", scope: !696, file: !162, line: 998, type: !243)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldNotationDeclHandler", scope: !696, file: !162, line: 1000, type: !248)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldStartNamespaceDeclHandler", scope: !696, file: !162, line: 1001, type: !253)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldEndNamespaceDeclHandler", scope: !696, file: !162, line: 1003, type: !255)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldNotStandaloneHandler", scope: !696, file: !162, line: 1005, type: !257)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldExternalEntityRefHandler", scope: !696, file: !162, line: 1006, type: !262)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldSkippedEntityHandler", scope: !696, file: !162, line: 1008, type: !268)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldUnknownEncodingHandler", scope: !696, file: !162, line: 1009, type: !270)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldElementDeclHandler", scope: !696, file: !162, line: 1011, type: !289)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldAttlistDeclHandler", scope: !696, file: !162, line: 1012, type: !304)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldEntityDeclHandler", scope: !696, file: !162, line: 1013, type: !309)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldXmlDeclHandler", scope: !696, file: !162, line: 1014, type: !314)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldDeclElementType", scope: !696, file: !162, line: 1015, type: !473)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldUserData", scope: !696, file: !162, line: 1017, type: !158)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldHandlerArg", scope: !696, file: !162, line: 1018, type: !158)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldDefaultExpandInternalEntities", scope: !696, file: !162, line: 1019, type: !156)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldExternalEntityRefHandlerArg", scope: !696, file: !162, line: 1020, type: !159)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldParamEntityParsing", scope: !696, file: !162, line: 1022, type: !67)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldInEntityValue", scope: !696, file: !162, line: 1023, type: !221)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldns_triplets", scope: !696, file: !162, line: 1025, type: !156)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldhash_secret_salt", scope: !696, file: !162, line: 1031, type: !180)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !736, file: !162, line: 1044, type: !670)
!736 = distinct !DILexicalBlock(scope: !737, file: !162, line: 1043, column: 23)
!737 = distinct !DILexicalBlock(scope: !696, file: !162, line: 1043, column: 7)
!738 = !DISubprogram(name: "PyExpat_XML_ParserFree", scope: !162, file: !162, line: 1130, type: !739, isLocal: false, isDefinition: true, scopeLine: 1131, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*)* @PyExpat_XML_ParserFree, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !159}
!741 = !{!742, !743, !744, !745, !749}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !738, file: !162, line: 1130, type: !159)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tagList", scope: !738, file: !162, line: 1132, type: !598)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entityList", scope: !738, file: !162, line: 1133, type: !436)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !746, file: !162, line: 1139, type: !598)
!746 = distinct !DILexicalBlock(scope: !747, file: !162, line: 1138, column: 12)
!747 = distinct !DILexicalBlock(scope: !748, file: !162, line: 1138, column: 3)
!748 = distinct !DILexicalBlock(scope: !738, file: !162, line: 1138, column: 3)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "openEntity", scope: !750, file: !162, line: 1155, type: !436)
!750 = distinct !DILexicalBlock(scope: !751, file: !162, line: 1154, column: 12)
!751 = distinct !DILexicalBlock(scope: !752, file: !162, line: 1154, column: 3)
!752 = distinct !DILexicalBlock(scope: !738, file: !162, line: 1154, column: 3)
!753 = !DISubprogram(name: "PyExpat_XML_UseParserAsHandlerArg", scope: !162, file: !162, line: 1195, type: !739, isLocal: false, isDefinition: true, scopeLine: 1196, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*)* @PyExpat_XML_UseParserAsHandlerArg, variables: !754)
!754 = !{!755}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !753, file: !162, line: 1195, type: !159)
!756 = !DISubprogram(name: "PyExpat_XML_UseForeignDTD", scope: !162, file: !162, line: 1201, type: !757, isLocal: false, isDefinition: true, scopeLine: 1202, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i8)* @PyExpat_XML_UseForeignDTD, variables: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{!18, !159, !156}
!759 = !{!760, !761}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !756, file: !162, line: 1201, type: !159)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "useDTD", arg: 2, scope: !756, file: !162, line: 1201, type: !156)
!762 = !DISubprogram(name: "PyExpat_XML_SetReturnNSTriplet", scope: !162, file: !162, line: 1215, type: !763, isLocal: false, isDefinition: true, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, i32)* @PyExpat_XML_SetReturnNSTriplet, variables: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !159, !221}
!765 = !{!766, !767}
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !762, file: !162, line: 1215, type: !159)
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "do_nst", arg: 2, scope: !762, file: !162, line: 1215, type: !221)
!768 = !DISubprogram(name: "PyExpat_XML_SetUserData", scope: !162, file: !162, line: 1224, type: !769, isLocal: false, isDefinition: true, scopeLine: 1225, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, i8*)* @PyExpat_XML_SetUserData, variables: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !159, !158}
!771 = !{!772, !773}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !768, file: !162, line: 1224, type: !159)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !768, file: !162, line: 1224, type: !158)
!774 = !DISubprogram(name: "PyExpat_XML_SetBase", scope: !162, file: !162, line: 1233, type: !691, isLocal: false, isDefinition: true, scopeLine: 1234, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i8*)* @PyExpat_XML_SetBase, variables: !775)
!775 = !{!776, !777}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !774, file: !162, line: 1233, type: !159)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !774, file: !162, line: 1233, type: !208)
!778 = !DISubprogram(name: "PyExpat_XML_GetBase", scope: !162, file: !162, line: 1247, type: !779, isLocal: false, isDefinition: true, scopeLine: 1248, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.XML_ParserStruct*)* @PyExpat_XML_GetBase, variables: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!208, !159}
!781 = !{!782}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !778, file: !162, line: 1247, type: !159)
!783 = !DISubprogram(name: "PyExpat_XML_GetSpecifiedAttributeCount", scope: !162, file: !162, line: 1253, type: !784, isLocal: false, isDefinition: true, scopeLine: 1254, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*)* @PyExpat_XML_GetSpecifiedAttributeCount, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!221, !159}
!786 = !{!787}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !783, file: !162, line: 1253, type: !159)
!788 = !DISubprogram(name: "PyExpat_XML_GetIdAttributeIndex", scope: !162, file: !162, line: 1259, type: !784, isLocal: false, isDefinition: true, scopeLine: 1260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*)* @PyExpat_XML_GetIdAttributeIndex, variables: !789)
!789 = !{!790}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !788, file: !162, line: 1259, type: !159)
!791 = !DISubprogram(name: "PyExpat_XML_SetElementHandler", scope: !162, file: !162, line: 1273, type: !792, isLocal: false, isDefinition: true, scopeLine: 1276, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8**)*, void (i8*, i8*)*)* @PyExpat_XML_SetElementHandler, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !159, !204, !212}
!794 = !{!795, !796, !797}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !791, file: !162, line: 1273, type: !159)
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !791, file: !162, line: 1274, type: !204)
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !791, file: !162, line: 1275, type: !212)
!798 = !DISubprogram(name: "PyExpat_XML_SetStartElementHandler", scope: !162, file: !162, line: 1282, type: !799, isLocal: false, isDefinition: true, scopeLine: 1283, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8**)*)* @PyExpat_XML_SetStartElementHandler, variables: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !159, !204}
!801 = !{!802, !803}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !798, file: !162, line: 1282, type: !159)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !798, file: !162, line: 1283, type: !204)
!804 = !DISubprogram(name: "PyExpat_XML_SetEndElementHandler", scope: !162, file: !162, line: 1288, type: !805, isLocal: false, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*)*)* @PyExpat_XML_SetEndElementHandler, variables: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !159, !212}
!807 = !{!808, !809}
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !804, file: !162, line: 1288, type: !159)
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !804, file: !162, line: 1289, type: !212)
!810 = !DISubprogram(name: "PyExpat_XML_SetCharacterDataHandler", scope: !162, file: !162, line: 1294, type: !811, isLocal: false, isDefinition: true, scopeLine: 1296, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i32)*)* @PyExpat_XML_SetCharacterDataHandler, variables: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !159, !217}
!813 = !{!814, !815}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !810, file: !162, line: 1294, type: !159)
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !810, file: !162, line: 1295, type: !217)
!816 = !DISubprogram(name: "PyExpat_XML_SetProcessingInstructionHandler", scope: !162, file: !162, line: 1301, type: !817, isLocal: false, isDefinition: true, scopeLine: 1303, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*)*)* @PyExpat_XML_SetProcessingInstructionHandler, variables: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !159, !223}
!819 = !{!820, !821}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !816, file: !162, line: 1301, type: !159)
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !816, file: !162, line: 1302, type: !223)
!822 = !DISubprogram(name: "PyExpat_XML_SetCommentHandler", scope: !162, file: !162, line: 1308, type: !823, isLocal: false, isDefinition: true, scopeLine: 1310, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*)*)* @PyExpat_XML_SetCommentHandler, variables: !825)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !159, !228}
!825 = !{!826, !827}
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !822, file: !162, line: 1308, type: !159)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !822, file: !162, line: 1309, type: !228)
!828 = !DISubprogram(name: "PyExpat_XML_SetCdataSectionHandler", scope: !162, file: !162, line: 1315, type: !829, isLocal: false, isDefinition: true, scopeLine: 1318, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*)*, void (i8*)*)* @PyExpat_XML_SetCdataSectionHandler, variables: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !159, !230, !232}
!831 = !{!832, !833, !834}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !828, file: !162, line: 1315, type: !159)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !828, file: !162, line: 1316, type: !230)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !828, file: !162, line: 1317, type: !232)
!835 = !DISubprogram(name: "PyExpat_XML_SetStartCdataSectionHandler", scope: !162, file: !162, line: 1324, type: !836, isLocal: false, isDefinition: true, scopeLine: 1325, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*)*)* @PyExpat_XML_SetStartCdataSectionHandler, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !159, !230}
!838 = !{!839, !840}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !835, file: !162, line: 1324, type: !159)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !835, file: !162, line: 1325, type: !230)
!841 = !DISubprogram(name: "PyExpat_XML_SetEndCdataSectionHandler", scope: !162, file: !162, line: 1330, type: !842, isLocal: false, isDefinition: true, scopeLine: 1331, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*)*)* @PyExpat_XML_SetEndCdataSectionHandler, variables: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !159, !232}
!844 = !{!845, !846}
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !841, file: !162, line: 1330, type: !159)
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !841, file: !162, line: 1331, type: !232)
!847 = !DISubprogram(name: "PyExpat_XML_SetDefaultHandler", scope: !162, file: !162, line: 1336, type: !848, isLocal: false, isDefinition: true, scopeLine: 1338, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i32)*)* @PyExpat_XML_SetDefaultHandler, variables: !850)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !159, !234}
!850 = !{!851, !852}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !847, file: !162, line: 1336, type: !159)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !847, file: !162, line: 1337, type: !234)
!853 = !DISubprogram(name: "PyExpat_XML_SetDefaultHandlerExpand", scope: !162, file: !162, line: 1344, type: !848, isLocal: false, isDefinition: true, scopeLine: 1346, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i32)*)* @PyExpat_XML_SetDefaultHandlerExpand, variables: !854)
!854 = !{!855, !856}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !853, file: !162, line: 1344, type: !159)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !853, file: !162, line: 1345, type: !234)
!857 = !DISubprogram(name: "PyExpat_XML_SetDoctypeDeclHandler", scope: !162, file: !162, line: 1352, type: !858, isLocal: false, isDefinition: true, scopeLine: 1355, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i8*, i32)*, void (i8*)*)* @PyExpat_XML_SetDoctypeDeclHandler, variables: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !159, !236, !241}
!860 = !{!861, !862, !863}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !857, file: !162, line: 1352, type: !159)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !857, file: !162, line: 1353, type: !236)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !857, file: !162, line: 1354, type: !241)
!864 = !DISubprogram(name: "PyExpat_XML_SetStartDoctypeDeclHandler", scope: !162, file: !162, line: 1361, type: !865, isLocal: false, isDefinition: true, scopeLine: 1362, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i8*, i32)*)* @PyExpat_XML_SetStartDoctypeDeclHandler, variables: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !159, !236}
!867 = !{!868, !869}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !864, file: !162, line: 1361, type: !159)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !864, file: !162, line: 1362, type: !236)
!870 = !DISubprogram(name: "PyExpat_XML_SetEndDoctypeDeclHandler", scope: !162, file: !162, line: 1367, type: !871, isLocal: false, isDefinition: true, scopeLine: 1368, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*)*)* @PyExpat_XML_SetEndDoctypeDeclHandler, variables: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{null, !159, !241}
!873 = !{!874, !875}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !870, file: !162, line: 1367, type: !159)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !870, file: !162, line: 1368, type: !241)
!876 = !DISubprogram(name: "PyExpat_XML_SetUnparsedEntityDeclHandler", scope: !162, file: !162, line: 1373, type: !877, isLocal: false, isDefinition: true, scopeLine: 1375, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i8*, i8*, i8*)*)* @PyExpat_XML_SetUnparsedEntityDeclHandler, variables: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !159, !243}
!879 = !{!880, !881}
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !876, file: !162, line: 1373, type: !159)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !876, file: !162, line: 1374, type: !243)
!882 = !DISubprogram(name: "PyExpat_XML_SetNotationDeclHandler", scope: !162, file: !162, line: 1380, type: !883, isLocal: false, isDefinition: true, scopeLine: 1382, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i8*, i8*)*)* @PyExpat_XML_SetNotationDeclHandler, variables: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !159, !248}
!885 = !{!886, !887}
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !882, file: !162, line: 1380, type: !159)
!887 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !882, file: !162, line: 1381, type: !248)
!888 = !DISubprogram(name: "PyExpat_XML_SetNamespaceDeclHandler", scope: !162, file: !162, line: 1387, type: !889, isLocal: false, isDefinition: true, scopeLine: 1390, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*)*, void (i8*, i8*)*)* @PyExpat_XML_SetNamespaceDeclHandler, variables: !891)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !159, !253, !255}
!891 = !{!892, !893, !894}
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !888, file: !162, line: 1387, type: !159)
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !888, file: !162, line: 1388, type: !253)
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !888, file: !162, line: 1389, type: !255)
!895 = !DISubprogram(name: "PyExpat_XML_SetStartNamespaceDeclHandler", scope: !162, file: !162, line: 1396, type: !896, isLocal: false, isDefinition: true, scopeLine: 1397, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*)*)* @PyExpat_XML_SetStartNamespaceDeclHandler, variables: !898)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !159, !253}
!898 = !{!899, !900}
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !895, file: !162, line: 1396, type: !159)
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !895, file: !162, line: 1397, type: !253)
!901 = !DISubprogram(name: "PyExpat_XML_SetEndNamespaceDeclHandler", scope: !162, file: !162, line: 1402, type: !902, isLocal: false, isDefinition: true, scopeLine: 1403, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*)*)* @PyExpat_XML_SetEndNamespaceDeclHandler, variables: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !159, !255}
!904 = !{!905, !906}
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !901, file: !162, line: 1402, type: !159)
!906 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !901, file: !162, line: 1403, type: !255)
!907 = !DISubprogram(name: "PyExpat_XML_SetNotStandaloneHandler", scope: !162, file: !162, line: 1408, type: !908, isLocal: false, isDefinition: true, scopeLine: 1410, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, i32 (i8*)*)* @PyExpat_XML_SetNotStandaloneHandler, variables: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !159, !257}
!910 = !{!911, !912}
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !907, file: !162, line: 1408, type: !159)
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !907, file: !162, line: 1409, type: !257)
!913 = !DISubprogram(name: "PyExpat_XML_SetExternalEntityRefHandler", scope: !162, file: !162, line: 1415, type: !914, isLocal: false, isDefinition: true, scopeLine: 1417, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, i32 (%struct.XML_ParserStruct*, i8*, i8*, i8*, i8*)*)* @PyExpat_XML_SetExternalEntityRefHandler, variables: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !159, !262}
!916 = !{!917, !918}
!917 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !913, file: !162, line: 1415, type: !159)
!918 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !913, file: !162, line: 1416, type: !262)
!919 = !DISubprogram(name: "PyExpat_XML_SetExternalEntityRefHandlerArg", scope: !162, file: !162, line: 1422, type: !769, isLocal: false, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, i8*)* @PyExpat_XML_SetExternalEntityRefHandlerArg, variables: !920)
!920 = !{!921, !922}
!921 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !919, file: !162, line: 1422, type: !159)
!922 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !919, file: !162, line: 1422, type: !158)
!923 = !DISubprogram(name: "PyExpat_XML_SetSkippedEntityHandler", scope: !162, file: !162, line: 1431, type: !924, isLocal: false, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i32)*)* @PyExpat_XML_SetSkippedEntityHandler, variables: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !159, !268}
!926 = !{!927, !928}
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !923, file: !162, line: 1431, type: !159)
!928 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !923, file: !162, line: 1432, type: !268)
!929 = !DISubprogram(name: "PyExpat_XML_SetUnknownEncodingHandler", scope: !162, file: !162, line: 1438, type: !930, isLocal: false, isDefinition: true, scopeLine: 1441, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, i32 (i8*, i8*, %struct.XML_Encoding*)*, i8*)* @PyExpat_XML_SetUnknownEncodingHandler, variables: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !159, !270, !158}
!932 = !{!933, !934, !935}
!933 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !929, file: !162, line: 1438, type: !159)
!934 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !929, file: !162, line: 1439, type: !270)
!935 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 3, scope: !929, file: !162, line: 1440, type: !158)
!936 = !DISubprogram(name: "PyExpat_XML_SetElementDeclHandler", scope: !162, file: !162, line: 1447, type: !937, isLocal: false, isDefinition: true, scopeLine: 1449, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, %struct.XML_cp*)*)* @PyExpat_XML_SetElementDeclHandler, variables: !939)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !159, !289}
!939 = !{!940, !941}
!940 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !936, file: !162, line: 1447, type: !159)
!941 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eldecl", arg: 2, scope: !936, file: !162, line: 1448, type: !289)
!942 = !DISubprogram(name: "PyExpat_XML_SetAttlistDeclHandler", scope: !162, file: !162, line: 1454, type: !943, isLocal: false, isDefinition: true, scopeLine: 1456, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i8*, i8*, i32)*)* @PyExpat_XML_SetAttlistDeclHandler, variables: !945)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !159, !304}
!945 = !{!946, !947}
!946 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !942, file: !162, line: 1454, type: !159)
!947 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attdecl", arg: 2, scope: !942, file: !162, line: 1455, type: !304)
!948 = !DISubprogram(name: "PyExpat_XML_SetEntityDeclHandler", scope: !162, file: !162, line: 1461, type: !949, isLocal: false, isDefinition: true, scopeLine: 1463, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i32, i8*, i32, i8*, i8*, i8*, i8*)*)* @PyExpat_XML_SetEntityDeclHandler, variables: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !159, !309}
!951 = !{!952, !953}
!952 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !948, file: !162, line: 1461, type: !159)
!953 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !948, file: !162, line: 1462, type: !309)
!954 = !DISubprogram(name: "PyExpat_XML_SetXmlDeclHandler", scope: !162, file: !162, line: 1468, type: !955, isLocal: false, isDefinition: true, scopeLine: 1469, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XML_ParserStruct*, void (i8*, i8*, i8*, i32)*)* @PyExpat_XML_SetXmlDeclHandler, variables: !957)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !159, !314}
!957 = !{!958, !959}
!958 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !954, file: !162, line: 1468, type: !159)
!959 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 2, scope: !954, file: !162, line: 1469, type: !314)
!960 = !DISubprogram(name: "PyExpat_XML_SetParamEntityParsing", scope: !162, file: !162, line: 1474, type: !961, isLocal: false, isDefinition: true, scopeLine: 1476, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i32)* @PyExpat_XML_SetParamEntityParsing, variables: !963)
!961 = !DISubroutineType(types: !962)
!962 = !{!221, !159, !67}
!963 = !{!964, !965}
!964 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !960, file: !162, line: 1474, type: !159)
!965 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "peParsing", arg: 2, scope: !960, file: !162, line: 1475, type: !67)
!966 = !DISubprogram(name: "PyExpat_XML_SetHashSalt", scope: !162, file: !162, line: 1489, type: !967, isLocal: false, isDefinition: true, scopeLine: 1491, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i64)* @PyExpat_XML_SetHashSalt, variables: !969)
!967 = !DISubroutineType(types: !968)
!968 = !{!221, !159, !180}
!969 = !{!970, !971}
!970 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !966, file: !162, line: 1489, type: !159)
!971 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash_salt", arg: 2, scope: !966, file: !162, line: 1490, type: !180)
!972 = !DISubprogram(name: "PyExpat_XML_Parse", scope: !162, file: !162, line: 1500, type: !973, isLocal: false, isDefinition: true, scopeLine: 1501, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i8*, i32, i32)* @PyExpat_XML_Parse, variables: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{!72, !159, !190, !221, !221}
!975 = !{!976, !977, !978, !979, !980}
!976 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !972, file: !162, line: 1500, type: !159)
!977 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !972, file: !162, line: 1500, type: !190)
!978 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !972, file: !162, line: 1500, type: !221)
!979 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isFinal", arg: 4, scope: !972, file: !162, line: 1500, type: !221)
!980 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buff", scope: !981, file: !162, line: 1612, type: !158)
!981 = distinct !DILexicalBlock(scope: !982, file: !162, line: 1611, column: 8)
!982 = distinct !DILexicalBlock(scope: !972, file: !162, line: 1518, column: 7)
!983 = !DISubprogram(name: "PyExpat_XML_ParseBuffer", scope: !162, file: !162, line: 1623, type: !984, isLocal: false, isDefinition: true, scopeLine: 1624, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XML_ParserStruct*, i32, i32)* @PyExpat_XML_ParseBuffer, variables: !986)
!984 = !DISubroutineType(types: !985)
!985 = !{!72, !159, !221, !221}
!986 = !{!987, !988, !989, !990, !991}
!987 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !983, file: !162, line: 1623, type: !159)
!988 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !983, file: !162, line: 1623, type: !221)
!989 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isFinal", arg: 3, scope: !983, file: !162, line: 1623, type: !221)
!990 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !983, file: !162, line: 1625, type: !190)
!991 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !983, file: !162, line: 1626, type: !72)
!992 = !DISubprogram(name: "PyExpat_XML_GetBuffer", scope: !162, file: !162, line: 1679, type: !993, isLocal: false, isDefinition: true, scopeLine: 1680, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.XML_ParserStruct*, i32)* @PyExpat_XML_GetBuffer, variables: !995)
!993 = !DISubroutineType(types: !994)
!994 = !{!158, !159, !221}
!995 = !{!996, !997, !998, !1001, !1002, !1007, !1009, !1010}
!996 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parser", arg: 1, scope: !992, file: !162, line: 1679, type: !159)
