; ModuleID = 'programs_new/Python-new/xmlrole.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.prolog_state = type { i32 (%struct.prolog_state*, i32, i8*, i8*, %struct.encoding*)*, i32, i32, i32, i32, i32 }
%struct.encoding = type { [4 x i32 (%struct.encoding*, i8*, i8*, i8**)*], [2 x i32 (%struct.encoding*, i8*, i8*, i8**)*], i32 (%struct.encoding*, i8*, i8*)*, i32 (%struct.encoding*, i8*, i8*, i8*)*, i32 (%struct.encoding*, i8*)*, i8* (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i8*)*, void (%struct.encoding*, i8*, i8*, %struct.position*)*, i32 (%struct.encoding*, i8*, i8*, i8**)*, void (%struct.encoding*, i8**, i8*, i8**, i8*)*, void (%struct.encoding*, i8**, i8*, i16**, i16*)*, i32, i8, i8 }
%struct.ATTRIBUTE = type { i8*, i8*, i8*, i8 }
%struct.position = type { i64, i64 }

@KW_DOCTYPE = internal constant [8 x i8] c"DOCTYPE\00", align 1
@KW_SYSTEM = internal constant [7 x i8] c"SYSTEM\00", align 1
@KW_PUBLIC = internal constant [7 x i8] c"PUBLIC\00", align 1
@KW_ENTITY = internal constant [7 x i8] c"ENTITY\00", align 1
@KW_ATTLIST = internal constant [8 x i8] c"ATTLIST\00", align 1
@KW_ELEMENT = internal constant [8 x i8] c"ELEMENT\00", align 1
@KW_NOTATION = internal constant [9 x i8] c"NOTATION\00", align 1
@KW_INCLUDE = internal constant [8 x i8] c"INCLUDE\00", align 1

!25 = !DIEnumerator(name: "XML_ROLE_NOTATION_NAME", value: 18)
!26 = !DIEnumerator(name: "XML_ROLE_NOTATION_SYSTEM_ID", value: 19)
!27 = !DIEnumerator(name: "XML_ROLE_NOTATION_NO_SYSTEM_ID", value: 20)
!28 = !DIEnumerator(name: "XML_ROLE_NOTATION_PUBLIC_ID", value: 21)
!29 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NAME", value: 22)
!30 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_CDATA", value: 23)
!31 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ID", value: 24)
!32 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREF", value: 25)
!33 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_IDREFS", value: 26)
!34 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITY", value: 27)
!35 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_ENTITIES", value: 28)
!36 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKEN", value: 29)
!37 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_TYPE_NMTOKENS", value: 30)
!38 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_ENUM_VALUE", value: 31)
!39 = !DIEnumerator(name: "XML_ROLE_ATTRIBUTE_NOTATION_VALUE", value: 32)
!40 = !DIEnumerator(name: "XML_ROLE_ATTLIST_NONE", value: 33)
!41 = !DIEnumerator(name: "XML_ROLE_ATTLIST_ELEMENT_NAME", value: 34)
!42 = !DIEnumerator(name: "XML_ROLE_IMPLIED_ATTRIBUTE_VALUE", value: 35)
!43 = !DIEnumerator(name: "XML_ROLE_REQUIRED_ATTRIBUTE_VALUE", value: 36)
!44 = !DIEnumerator(name: "XML_ROLE_DEFAULT_ATTRIBUTE_VALUE", value: 37)
!45 = !DIEnumerator(name: "XML_ROLE_FIXED_ATTRIBUTE_VALUE", value: 38)
!46 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NONE", value: 39)
!47 = !DIEnumerator(name: "XML_ROLE_ELEMENT_NAME", value: 40)
!48 = !DIEnumerator(name: "XML_ROLE_CONTENT_ANY", value: 41)
!49 = !DIEnumerator(name: "XML_ROLE_CONTENT_EMPTY", value: 42)
!50 = !DIEnumerator(name: "XML_ROLE_CONTENT_PCDATA", value: 43)
!51 = !DIEnumerator(name: "XML_ROLE_GROUP_OPEN", value: 44)
!52 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE", value: 45)
!53 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_REP", value: 46)
!54 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_OPT", value: 47)
!55 = !DIEnumerator(name: "XML_ROLE_GROUP_CLOSE_PLUS", value: 48)
!56 = !DIEnumerator(name: "XML_ROLE_GROUP_CHOICE", value: 49)
!57 = !DIEnumerator(name: "XML_ROLE_GROUP_SEQUENCE", value: 50)
!58 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT", value: 51)
!59 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_REP", value: 52)
!60 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_OPT", value: 53)
!61 = !DIEnumerator(name: "XML_ROLE_CONTENT_ELEMENT_PLUS", value: 54)
!62 = !DIEnumerator(name: "XML_ROLE_PI", value: 55)
!63 = !DIEnumerator(name: "XML_ROLE_COMMENT", value: 56)
!64 = !DIEnumerator(name: "XML_ROLE_TEXT_DECL", value: 57)
!65 = !DIEnumerator(name: "XML_ROLE_IGNORE_SECT", value: 58)
!66 = !DIEnumerator(name: "XML_ROLE_INNER_PARAM_ENTITY_REF", value: 59)
!67 = !DIEnumerator(name: "XML_ROLE_PARAM_ENTITY_REF", value: 60)
!68 = !{!69}
!69 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!70 = !{!71, !176, !179, !188, !195, !202, !209, !216, !223, !230, !237, !244, !251, !258, !265, !272, !279, !286, !293, !300, !307, !314, !321, !328, !335, !342, !352, !359, !366, !373, !380, !387, !394, !401, !408, !415, !422, !429, !436, !443, !450, !457, !464, !471, !478, !485, !492, !499, !506, !513, !520, !527, !534, !540}
!71 = !DISubprogram(name: "PyExpat_XmlPrologStateInit", scope: !72, file: !72, line: 1316, type: !73, isLocal: false, isDefinition: true, scopeLine: 1317, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.prolog_state*)* @PyExpat_XmlPrologStateInit, variables: !174)
!72 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmlrole.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROLOG_STATE", file: !4, line: 100, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "prolog_state", file: !4, line: 87, size: 256, align: 64, elements: !78)
!78 = !{!79, !168, !170, !171, !172, !173}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !77, file: !4, line: 88, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!69, !83, !69, !84, !84, !87}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENCODING", file: !90, line: 126, baseType: !91)
!90 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmltok.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "encoding", file: !90, line: 133, size: 1152, align: 64, elements: !92)
!92 = !{!93, !102, !106, !110, !114, !118, !122, !134, !135, !136, !149, !150, !156, !165, !166, !167}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "scanners", scope: !91, file: !90, line: 134, baseType: !94, size: 256, align: 64)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, align: 64, elements: !100)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCANNER", file: !90, line: 128, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!69, !87, !84, !84, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "literalScanners", scope: !91, file: !90, line: 135, baseType: !103, size: 128, align: 64, offset: 256)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, align: 64, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 2)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sameName", scope: !91, file: !90, line: 136, baseType: !107, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!69, !87, !84, !84}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "nameMatchesAscii", scope: !91, file: !90, line: 139, baseType: !111, size: 64, align: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!69, !87, !84, !84, !84}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !91, file: !90, line: 143, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!69, !87, !84}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "skipS", scope: !91, file: !90, line: 144, baseType: !119, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!84, !87, !84}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "getAtts", scope: !91, file: !90, line: 145, baseType: !123, size: 64, align: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!69, !87, !84, !69, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE", file: !90, line: 123, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 118, size: 256, align: 64, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !90, line: 119, baseType: !84, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !128, file: !90, line: 120, baseType: !84, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "valueEnd", scope: !128, file: !90, line: 121, baseType: !84, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !128, file: !90, line: 122, baseType: !86, size: 8, align: 8, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "charRefNumber", scope: !91, file: !90, line: 149, baseType: !115, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "predefinedEntityName", scope: !91, file: !90, line: 150, baseType: !107, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "updatePosition", scope: !91, file: !90, line: 153, baseType: !137, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !87, !84, !84, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "POSITION", file: !90, line: 116, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "position", file: !90, line: 112, size: 128, align: 64, elements: !143)
!143 = !{!144, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !142, file: !90, line: 114, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Size", file: !146, line: 112, baseType: !147)
!146 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/expat_external.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!147 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "columnNumber", scope: !142, file: !90, line: 115, baseType: !145, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "isPublicId", scope: !91, file: !90, line: 157, baseType: !96, size: 64, align: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Convert", scope: !91, file: !90, line: 161, baseType: !151, size: 64, align: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !87, !99, !84, !154, !84}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "utf16Convert", scope: !91, file: !90, line: 166, baseType: !157, size: 64, align: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !87, !99, !84, !160, !163}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "minBytesPerChar", scope: !91, file: !90, line: 171, baseType: !69, size: 32, align: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf8", scope: !91, file: !90, line: 172, baseType: !86, size: 8, align: 8, offset: 1120)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf16", scope: !91, file: !90, line: 173, baseType: !86, size: 8, align: 8, offset: 1128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !77, file: !4, line: 93, baseType: !169, size: 32, align: 32, offset: 64)
!169 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "role_none", scope: !77, file: !4, line: 94, baseType: !69, size: 32, align: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "includeLevel", scope: !77, file: !4, line: 96, baseType: !169, size: 32, align: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "documentEntity", scope: !77, file: !4, line: 97, baseType: !69, size: 32, align: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "inEntityValue", scope: !77, file: !4, line: 98, baseType: !69, size: 32, align: 32, offset: 192)
!174 = !{!175}
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !71, file: !72, line: 1316, type: !75)
!176 = !DISubprogram(name: "PyExpat_XmlPrologStateInitExternalEntity", scope: !72, file: !72, line: 1329, type: !73, isLocal: false, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.prolog_state*)* @PyExpat_XmlPrologStateInitExternalEntity, variables: !177)
!177 = !{!178}
!178 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !176, file: !72, line: 1329, type: !75)
!179 = !DISubprogram(name: "prolog0", scope: !72, file: !72, line: 128, type: !180, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.prolog_state*, i32, i8*, i8*, %struct.encoding*)* @prolog0, variables: !182)
!180 = !DISubroutineType(types: !181)
!181 = !{!69, !75, !69, !84, !84, !87}
!182 = !{!183, !184, !185, !186, !187}
!183 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !179, file: !72, line: 128, type: !75)
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 2, scope: !179, file: !72, line: 129, type: !69)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 3, scope: !179, file: !72, line: 130, type: !84)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 4, scope: !179, file: !72, line: 131, type: !84)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 5, scope: !179, file: !72, line: 132, type: !87)
!188 = !DISubprogram(name: "prolog1", scope: !72, file: !72, line: 165, type: !180, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.prolog_state*, i32, i8*, i8*, %struct.encoding*)* @prolog1, variables: !189)
!189 = !{!190, !191, !192, !193, !194}
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !188, file: !72, line: 165, type: !75)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 2, scope: !188, file: !72, line: 166, type: !69)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 3, scope: !188, file: !72, line: 167, type: !84)
!193 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 4, scope: !188, file: !72, line: 168, type: !84)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 5, scope: !188, file: !72, line: 169, type: !87)
!195 = !DISubprogram(name: "doctype0", scope: !72, file: !72, line: 217, type: !180, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.prolog_state*, i32, i8*, i8*, %struct.encoding*)* @doctype0, variables: !196)
!196 = !{!197, !198, !199, !200, !201}
!197 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !195, file: !72, line: 217, type: !75)
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 2, scope: !195, file: !72, line: 218, type: !69)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 3, scope: !195, file: !72, line: 219, type: !84)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 4, scope: !195, file: !72, line: 220, type: !84)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 5, scope: !195, file: !72, line: 221, type: !87)
!202 = !DISubprogram(name: "doctype1", scope: !72, file: !72, line: 235, type: !180, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.prolog_state*, i32, i8*, i8*, %struct.encoding*)* @doctype1, variables: !203)
!203 = !{!204, !205, !206, !207, !208}
!204 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !202, file: !72, line: 235, type: !75)
