; ModuleID = 'programs_new/Python-new/xmltok.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.normal_encoding = type { %struct.encoding, [256 x i8], i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*)* }
%struct.encoding = type { [4 x i32 (%struct.encoding*, i8*, i8*, i8**)*], [2 x i32 (%struct.encoding*, i8*, i8*, i8**)*], i32 (%struct.encoding*, i8*, i8*)*, i32 (%struct.encoding*, i8*, i8*, i8*)*, i32 (%struct.encoding*, i8*)*, i8* (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)*, i32 (%struct.encoding*, i8*)*, i32 (%struct.encoding*, i8*, i8*)*, void (%struct.encoding*, i8*, i8*, %struct.position*)*, i32 (%struct.encoding*, i8*, i8*, i8**)*, void (%struct.encoding*, i8**, i8*, i8**, i8*)*, void (%struct.encoding*, i8**, i8*, i16**, i16*)*, i32, i8, i8 }
%struct.ATTRIBUTE = type { i8*, i8*, i8*, i8 }
%struct.position = type { i64, i64 }
%struct.unknown_encoding = type { %struct.normal_encoding, i32 (i8*, i8*)*, i8*, [256 x i16], [256 x [4 x i8]] }
%struct.INIT_ENCODING = type { %struct.encoding, %struct.encoding** }


!5 = !DISubprogram(name: "PyExpat_XmlUtf8Encode", scope: !4, file: !4, line: 1193, type: !6, isLocal: false, isDefinition: true, scopeLine: 1194, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*)* @PyExpat_XmlUtf8Encode, variables: !11)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8, !9}
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !{!12, !13}
!12 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !5, file: !4, line: 1193, type: !8)
!13 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !5, file: !4, line: 1193, type: !9)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "min2", value: 128)
!16 = !DIEnumerator(name: "min3", value: 2048)
!17 = !DIEnumerator(name: "min4", value: 65536)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 314, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "UTF8_cval1", value: 0)
!21 = !DIEnumerator(name: "UTF8_cval2", value: 192)
!22 = !DIEnumerator(name: "UTF8_cval3", value: 224)
!23 = !DIEnumerator(name: "UTF8_cval4", value: 240)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 6, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmltok_impl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!27 = !DIEnumerator(name: "BT_NONXML", value: 0)
!28 = !DIEnumerator(name: "BT_MALFORM", value: 1)
!29 = !DIEnumerator(name: "BT_LT", value: 2)
!30 = !DIEnumerator(name: "BT_AMP", value: 3)
!31 = !DIEnumerator(name: "BT_RSQB", value: 4)
!32 = !DIEnumerator(name: "BT_LEAD2", value: 5)
!33 = !DIEnumerator(name: "BT_LEAD3", value: 6)
!34 = !DIEnumerator(name: "BT_LEAD4", value: 7)
!35 = !DIEnumerator(name: "BT_TRAIL", value: 8)
!36 = !DIEnumerator(name: "BT_CR", value: 9)
!37 = !DIEnumerator(name: "BT_LF", value: 10)
!38 = !DIEnumerator(name: "BT_GT", value: 11)
!39 = !DIEnumerator(name: "BT_QUOT", value: 12)
!40 = !DIEnumerator(name: "BT_APOS", value: 13)
!41 = !DIEnumerator(name: "BT_EQUALS", value: 14)
!42 = !DIEnumerator(name: "BT_QUEST", value: 15)
!43 = !DIEnumerator(name: "BT_EXCL", value: 16)
!44 = !DIEnumerator(name: "BT_SOL", value: 17)
!45 = !DIEnumerator(name: "BT_SEMI", value: 18)
!46 = !DIEnumerator(name: "BT_NUM", value: 19)
!47 = !DIEnumerator(name: "BT_LSQB", value: 20)
!48 = !DIEnumerator(name: "BT_S", value: 21)
!49 = !DIEnumerator(name: "BT_NMSTRT", value: 22)
!50 = !DIEnumerator(name: "BT_COLON", value: 23)
!51 = !DIEnumerator(name: "BT_HEX", value: 24)
!52 = !DIEnumerator(name: "BT_DIGIT", value: 25)
!53 = !DIEnumerator(name: "BT_NAME", value: 26)
!54 = !DIEnumerator(name: "BT_MINUS", value: 27)
!55 = !DIEnumerator(name: "BT_OTHER", value: 28)
!56 = !DIEnumerator(name: "BT_NONASCII", value: 29)
!57 = !DIEnumerator(name: "BT_PERCNT", value: 30)
!58 = !DIEnumerator(name: "BT_LPAR", value: 31)
!59 = !DIEnumerator(name: "BT_RPAR", value: 32)
!60 = !DIEnumerator(name: "BT_AST", value: 33)
!61 = !DIEnumerator(name: "BT_PLUS", value: 34)
!62 = !DIEnumerator(name: "BT_COMMA", value: 35)
!63 = !DIEnumerator(name: "BT_VERBAR", value: 36)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1426, size: 32, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73}
!66 = !DIEnumerator(name: "UNKNOWN_ENC", value: -1)
!67 = !DIEnumerator(name: "ISO_8859_1_ENC", value: 0)
!68 = !DIEnumerator(name: "US_ASCII_ENC", value: 1)
!69 = !DIEnumerator(name: "UTF_8_ENC", value: 2)
!70 = !DIEnumerator(name: "UTF_16_ENC", value: 3)
!71 = !DIEnumerator(name: "UTF_16BE_ENC", value: 4)
!72 = !DIEnumerator(name: "UTF_16LE_ENC", value: 5)
!73 = !DIEnumerator(name: "NO_ENC", value: 6)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !76, file: !75, line: 1434, size: 32, align: 32, elements: !167)
!75 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmltok_impl.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!76 = !DISubprogram(name: "normal_getAtts", scope: !75, file: !75, line: 1431, type: !77, isLocal: true, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)* @normal_getAtts, variables: !159)
!77 = !DISubroutineType(types: !78)
!78 = !{!8, !79, !91, !8, !151}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENCODING", file: !82, line: 126, baseType: !83)
!82 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/xmltok.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "encoding", file: !82, line: 133, size: 1152, align: 64, elements: !84)
!84 = !{!85, !96, !100, !104, !108, !112, !116, !118, !119, !120, !133, !134, !139, !148, !149, !150}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "scanners", scope: !83, file: !82, line: 134, baseType: !86, size: 256, align: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, align: 64, elements: !94)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCANNER", file: !82, line: 128, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!8, !79, !91, !91, !93}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!94 = !{!95}
!95 = !DISubrange(count: 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "literalScanners", scope: !83, file: !82, line: 135, baseType: !97, size: 128, align: 64, offset: 256)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, align: 64, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 2)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sameName", scope: !83, file: !82, line: 136, baseType: !101, size: 64, align: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!8, !79, !91, !91}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nameMatchesAscii", scope: !83, file: !82, line: 139, baseType: !105, size: 64, align: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!8, !79, !91, !91, !91}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !83, file: !82, line: 143, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!8, !79, !91}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "skipS", scope: !83, file: !82, line: 144, baseType: !113, size: 64, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!91, !79, !91}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "getAtts", scope: !83, file: !82, line: 145, baseType: !117, size: 64, align: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "charRefNumber", scope: !83, file: !82, line: 149, baseType: !109, size: 64, align: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "predefinedEntityName", scope: !83, file: !82, line: 150, baseType: !101, size: 64, align: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "updatePosition", scope: !83, file: !82, line: 153, baseType: !121, size: 64, align: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !79, !91, !91, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "POSITION", file: !82, line: 116, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "position", file: !82, line: 112, size: 128, align: 64, elements: !127)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lineNumber", scope: !126, file: !82, line: 114, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Size", file: !130, line: 112, baseType: !131)
!130 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/expat_external.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!131 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "columnNumber", scope: !126, file: !82, line: 115, baseType: !129, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "isPublicId", scope: !83, file: !82, line: 157, baseType: !88, size: 64, align: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Convert", scope: !83, file: !82, line: 161, baseType: !135, size: 64, align: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !79, !93, !91, !138, !91}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "utf16Convert", scope: !83, file: !82, line: 166, baseType: !140, size: 64, align: 64, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !79, !93, !91, !143, !146}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "minBytesPerChar", scope: !83, file: !82, line: 171, baseType: !8, size: 32, align: 32, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf8", scope: !83, file: !82, line: 172, baseType: !10, size: 8, align: 8, offset: 1120)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "isUtf16", scope: !83, file: !82, line: 173, baseType: !10, size: 8, align: 8, offset: 1128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ATTRIBUTE", file: !82, line: 123, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 118, size: 256, align: 64, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !82, line: 119, baseType: !91, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !153, file: !82, line: 120, baseType: !91, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "valueEnd", scope: !153, file: !82, line: 121, baseType: !91, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !153, file: !82, line: 122, baseType: !10, size: 8, align: 8, offset: 192)
!159 = !{!160, !161, !162, !163, !164, !165, !166}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 1, scope: !76, file: !75, line: 1431, type: !79)
!161 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 2, scope: !76, file: !75, line: 1431, type: !91)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attsMax", arg: 3, scope: !76, file: !75, line: 1432, type: !8)
!163 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atts", arg: 4, scope: !76, file: !75, line: 1432, type: !151)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !76, file: !75, line: 1434, type: !74)
!165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nAtts", scope: !76, file: !75, line: 1435, type: !8)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "open", scope: !76, file: !75, line: 1436, type: !8)
!167 = !{!168, !169, !170}
!168 = !DIEnumerator(name: "other", value: 0)
!169 = !DIEnumerator(name: "inName", value: 1)
!170 = !DIEnumerator(name: "inValue", value: 2)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !172, file: !75, line: 1434, size: 32, align: 32, elements: !167)
!172 = !DISubprogram(name: "little2_getAtts", scope: !75, file: !75, line: 1431, type: !77, isLocal: true, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)* @little2_getAtts, variables: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180}
!174 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 1, scope: !172, file: !75, line: 1431, type: !79)
!175 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 2, scope: !172, file: !75, line: 1431, type: !91)
!176 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attsMax", arg: 3, scope: !172, file: !75, line: 1432, type: !8)
!177 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atts", arg: 4, scope: !172, file: !75, line: 1432, type: !151)
!178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !172, file: !75, line: 1434, type: !171)
!179 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nAtts", scope: !172, file: !75, line: 1435, type: !8)
!180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "open", scope: !172, file: !75, line: 1436, type: !8)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !182, file: !75, line: 1434, size: 32, align: 32, elements: !167)
!182 = !DISubprogram(name: "big2_getAtts", scope: !75, file: !75, line: 1431, type: !77, isLocal: true, isDefinition: true, scopeLine: 1433, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.encoding*, i8*, i32, %struct.ATTRIBUTE*)* @big2_getAtts, variables: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190}
!184 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 1, scope: !182, file: !75, line: 1431, type: !79)
!185 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 2, scope: !182, file: !75, line: 1431, type: !91)
!186 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attsMax", arg: 3, scope: !182, file: !75, line: 1432, type: !8)
!187 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atts", arg: 4, scope: !182, file: !75, line: 1432, type: !151)
!188 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !182, file: !75, line: 1434, type: !181)
!189 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nAtts", scope: !182, file: !75, line: 1435, type: !8)
!190 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "open", scope: !182, file: !75, line: 1436, type: !8)
!191 = !{!10, !145, !192, !8, !9, !201, !225, !226, !129, !228, !230, !218, !232}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "unknown_encoding", file: !4, line: 1247, size: 16192, align: 64, elements: !194)
!194 = !{!195, !213, !219, !220, !222}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !193, file: !4, line: 1248, baseType: !196, size: 3776, align: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "normal_encoding", file: !4, line: 176, size: 3776, align: 64, elements: !197)
!197 = !{!198, !199, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !196, file: !4, line: 177, baseType: !81, size: 1152, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !4, line: 178, baseType: !200, size: 2048, align: 8, offset: 1152)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 2048, align: 8, elements: !202)
!201 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!202 = !{!203}
!203 = !DISubrange(count: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "isName2", scope: !196, file: !4, line: 186, baseType: !109, size: 64, align: 64, offset: 3200)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "isName3", scope: !196, file: !4, line: 187, baseType: !109, size: 64, align: 64, offset: 3264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "isName4", scope: !196, file: !4, line: 188, baseType: !109, size: 64, align: 64, offset: 3328)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "isNmstrt2", scope: !196, file: !4, line: 189, baseType: !109, size: 64, align: 64, offset: 3392)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "isNmstrt3", scope: !196, file: !4, line: 190, baseType: !109, size: 64, align: 64, offset: 3456)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "isNmstrt4", scope: !196, file: !4, line: 191, baseType: !109, size: 64, align: 64, offset: 3520)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "isInvalid2", scope: !196, file: !4, line: 192, baseType: !109, size: 64, align: 64, offset: 3584)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "isInvalid3", scope: !196, file: !4, line: 193, baseType: !109, size: 64, align: 64, offset: 3648)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "isInvalid4", scope: !196, file: !4, line: 194, baseType: !109, size: 64, align: 64, offset: 3712)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "convert", scope: !193, file: !4, line: 1249, baseType: !214, size: 64, align: 64, offset: 3776)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONVERTER", file: !82, line: 285, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!8, !218, !91}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "userData", scope: !193, file: !4, line: 1250, baseType: !218, size: 64, align: 64, offset: 3840)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "utf16", scope: !193, file: !4, line: 1251, baseType: !221, size: 4096, align: 16, offset: 3904)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 4096, align: 16, elements: !202)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !193, file: !4, line: 1252, baseType: !223, size: 8192, align: 8, offset: 8000)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, align: 8, elements: !224)
!224 = !{!203, !95}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "INIT_ENCODING", file: !82, line: 264, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 261, size: 1216, align: 64, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "initEnc", scope: !235, file: !82, line: 262, baseType: !81, size: 1152, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "encPtr", scope: !235, file: !82, line: 263, baseType: !239, size: 64, align: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!240 = !{!5, !241, !247, !251, !267, !271, !272, !281, !295, !296, !297, !303, !315, !322, !329, !340, !346, !352, !360, !369, !375, !381, !387, !394, !401, !407, !429, !435, !441, !447, !453, !460, !467, !479, !484, !490, !495, !76, !499, !515, !520, !526, !532, !543, !550, !555, !561, !567, !573, !591, !601, !610, !623, !627, !631, !635, !639, !643, !647, !651, !655, !667, !673, !682, !688, !694, !702, !709, !715, !721, !730, !737, !744, !750, !772, !778, !784, !790, !799, !809, !816, !828, !833, !839, !844, !172, !848, !864, !869, !875, !881, !896, !903, !909, !920, !926, !945, !952, !962, !971, !977, !983, !991, !998, !1004, !1010, !1019, !1026, !1033, !1039, !1061, !1067, !1073, !1079, !1088, !1098, !1105, !1117, !1122, !1128, !1133, !182, !1137, !1153, !1158, !1164, !1170, !1185, !1192, !1198, !1204, !1228, !1241, !1251, !1254, !1265, !1271, !1277}
!241 = !DISubprogram(name: "PyExpat_XmlUtf16Encode", scope: !4, file: !4, line: 1230, type: !242, isLocal: false, isDefinition: true, scopeLine: 1231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i16*)* @PyExpat_XmlUtf16Encode, variables: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{!8, !8, !144}
!244 = !{!245, !246}
!245 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "charNum", arg: 1, scope: !241, file: !4, line: 1230, type: !8)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !241, file: !4, line: 1230, type: !144)
!247 = !DISubprogram(name: "PyExpat_XmlSizeOfUnknownEncoding", scope: !4, file: !4, line: 1258, type: !248, isLocal: false, isDefinition: true, scopeLine: 1259, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyExpat_XmlSizeOfUnknownEncoding, variables: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{!8}
!250 = !{}
!251 = !DISubprogram(name: "PyExpat_XmlInitUnknownEncoding", scope: !4, file: !4, line: 1346, type: !252, isLocal: false, isDefinition: true, scopeLine: 1350, flags: DIFlagPrototyped, isOptimized: true, function: %struct.encoding* (i8*, i32*, i32 (i8*, i8*)*, i8*)* @PyExpat_XmlInitUnknownEncoding, variables: !256)
!252 = !DISubroutineType(types: !253)
!253 = !{!254, !218, !255, !214, !218}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!256 = !{!257, !258, !259, !260, !261, !262, !263}
!257 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 1, scope: !251, file: !4, line: 1346, type: !218)
!258 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "table", arg: 2, scope: !251, file: !4, line: 1347, type: !255)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "convert", arg: 3, scope: !251, file: !4, line: 1348, type: !214)
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "userData", arg: 4, scope: !251, file: !4, line: 1349, type: !218)
!261 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !251, file: !4, line: 1351, type: !8)
!262 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !251, file: !4, line: 1352, type: !192)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !264, file: !4, line: 1361, type: !8)
!264 = distinct !DILexicalBlock(scope: !265, file: !4, line: 1360, column: 29)
!265 = distinct !DILexicalBlock(scope: !266, file: !4, line: 1360, column: 3)
!266 = distinct !DILexicalBlock(scope: !251, file: !4, line: 1360, column: 3)
!267 = !DISubprogram(name: "PyExpat_XmlGetUtf8InternalEncoding", scope: !268, file: !268, line: 9, type: !269, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: true, function: %struct.encoding* ()* @PyExpat_XmlGetUtf8InternalEncoding, variables: !250)
