; ModuleID = 'programs_new/Python-new/xxlimited.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._typeobject = type opaque
%struct.PyType_Slot = type { i32, i8* }
%struct.PyType_Spec = type { i8*, i32, i32, i32, %struct.PyType_Slot* }
%struct._object = type { i64, %struct._typeobject* }
%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct.XxoObject = type { %struct._object, %struct._object* }

@PyBaseObject_Type = external global %struct._typeobject, align 1
@Null_Type_slots = internal global [4 x %struct.PyType_Slot] [%struct.PyType_Slot { i32 48, i8* null }, %struct.PyType_Slot { i32 65, i8* null }, %struct.PyType_Slot { i32 67, i8* bitcast (%struct._object* (%struct._object*, %struct._object*, i32)* @null_richcompare to i8*) }, %struct.PyType_Slot zeroinitializer], align 16
@PyUnicode_Type = external global %struct._typeobject, align 1
@Str_Type_slots = internal global [2 x %struct.PyType_Slot] [%struct.PyType_Slot { i32 48, i8* null }, %struct.PyType_Slot zeroinitializer], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !34, globals: !116)
!1 = !DIFile(filename: "xxlimited.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !21, !25, !32}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 108, flags: DIFlagFwdDecl)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !4}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "XxoObject", file: !27, line: 24, baseType: !28)
!27 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/xxlimited.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 21, size: 192, align: 64, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !27, line: 22, baseType: !6, size: 128, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x_attr", scope: !28, file: !27, line: 23, baseType: !5, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 332, baseType: !20)
!34 = !{!35, !46, !54, !64, !73, !85, !90, !98, !105, !110}
!35 = !DISubprogram(name: "PyInit_xxlimited", scope: !27, file: !27, line: 241, type: !36, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_xxlimited, variables: !38)
!36 = !DISubroutineType(types: !37)
!37 = !{!5}
!38 = !{!39, !40, !41, !43}
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !35, file: !27, line: 243, type: !5)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !35, file: !27, line: 244, type: !5)
!41 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !42, file: !27, line: 284, type: !5)
!42 = distinct !DILexicalBlock(scope: !35, file: !27, line: 284, column: 8)
!43 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !44, file: !27, line: 284, type: !5)
!44 = distinct !DILexicalBlock(scope: !45, file: !27, line: 284, column: 93)
!45 = distinct !DILexicalBlock(scope: !42, file: !27, line: 284, column: 59)
!46 = !DISubprogram(name: "null_richcompare", scope: !27, file: !27, line: 188, type: !47, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @null_richcompare, variables: !50)
!47 = !DISubroutineType(types: !48)
!48 = !{!5, !5, !5, !49}
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !{!51, !52, !53}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !46, file: !27, line: 188, type: !5)
!52 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !46, file: !27, line: 188, type: !5)
!53 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !46, file: !27, line: 188, type: !49)
!54 = !DISubprogram(name: "Xxo_dealloc", scope: !27, file: !27, line: 44, type: !55, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.XxoObject*)* @Xxo_dealloc, variables: !57)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !25}
!57 = !{!58, !59, !61}
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !54, file: !27, line: 44, type: !25)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !60, file: !27, line: 46, type: !5)
!60 = distinct !DILexicalBlock(scope: !54, file: !27, line: 46, column: 8)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !62, file: !27, line: 46, type: !5)
!62 = distinct !DILexicalBlock(scope: !63, file: !27, line: 46, column: 104)
!63 = distinct !DILexicalBlock(scope: !60, file: !27, line: 46, column: 70)
!64 = !DISubprogram(name: "Xxo_getattro", scope: !27, file: !27, line: 72, type: !65, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.XxoObject*, %struct._object*)* @Xxo_getattro, variables: !67)
!65 = !DISubroutineType(types: !66)
!66 = !{!5, !25, !5}
!67 = !{!68, !69, !70}
!68 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !64, file: !27, line: 72, type: !25)
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !64, file: !27, line: 72, type: !5)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !71, file: !27, line: 75, type: !5)
!71 = distinct !DILexicalBlock(scope: !72, file: !27, line: 74, column: 37)
!72 = distinct !DILexicalBlock(scope: !64, file: !27, line: 74, column: 9)
!73 = !DISubprogram(name: "Xxo_setattr", scope: !27, file: !27, line: 85, type: !74, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.XxoObject*, i8*, %struct._object*)* @Xxo_setattr, variables: !78)
!74 = !DISubroutineType(types: !75)
!75 = !{!49, !25, !76, !5}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!78 = !{!79, !80, !81, !82}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !73, file: !27, line: 85, type: !25)
!80 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !73, file: !27, line: 85, type: !76)
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !73, file: !27, line: 85, type: !5)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !83, file: !27, line: 93, type: !49)
!83 = distinct !DILexicalBlock(scope: !84, file: !27, line: 92, column: 26)
!84 = distinct !DILexicalBlock(scope: !73, file: !27, line: 92, column: 9)
!85 = !DISubprogram(name: "Xxo_demo", scope: !27, file: !27, line: 51, type: !65, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.XxoObject*, %struct._object*)* @Xxo_demo, variables: !86)
!86 = !{!87, !88, !89}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !85, file: !27, line: 51, type: !25)
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !85, file: !27, line: 51, type: !5)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !85, file: !27, line: 53, type: !5)
!90 = !DISubprogram(name: "xx_roj", scope: !27, file: !27, line: 159, type: !91, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @xx_roj, variables: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!5, !5, !5}
!93 = !{!94, !95, !96, !97}
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !90, file: !27, line: 159, type: !5)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !90, file: !27, line: 159, type: !5)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !90, file: !27, line: 161, type: !5)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !90, file: !27, line: 162, type: !17)
!98 = !DISubprogram(name: "xx_foo", scope: !27, file: !27, line: 130, type: !91, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @xx_foo, variables: !99)
!99 = !{!100, !101, !102, !103, !104}
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !98, file: !27, line: 130, type: !5)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !98, file: !27, line: 130, type: !5)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !98, file: !27, line: 132, type: !17)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !98, file: !27, line: 132, type: !17)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !98, file: !27, line: 133, type: !17)
!105 = !DISubprogram(name: "xx_new", scope: !27, file: !27, line: 144, type: !91, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @xx_new, variables: !106)
!106 = !{!107, !108, !109}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !105, file: !27, line: 144, type: !5)
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !105, file: !27, line: 144, type: !5)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !105, file: !27, line: 146, type: !25)
!110 = !DISubprogram(name: "newXxoObject", scope: !27, file: !27, line: 31, type: !111, isLocal: true, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: %struct.XxoObject* (%struct._object*)* @newXxoObject, variables: !113)
!111 = !DISubroutineType(types: !112)
!112 = !{!25, !5}
!113 = !{!114, !115}
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !110, file: !27, line: 31, type: !5)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !110, file: !27, line: 33, type: !25)
!116 = !{!117, !118, !119, !128, !132, !145, !149, !161, !195, !199, !201, !205, !206}
!117 = !DIGlobalVariable(name: "ErrorObject", scope: !0, file: !27, line: 19, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @ErrorObject)
!118 = !DIGlobalVariable(name: "Xxo_Type", scope: !0, file: !27, line: 26, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @Xxo_Type)
!119 = !DIGlobalVariable(name: "Null_Type_slots", scope: !0, file: !27, line: 193, type: !120, isLocal: true, isDefinition: true, variable: [4 x %struct.PyType_Slot]* @Null_Type_slots)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, align: 64, elements: !126)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Slot", file: !7, line: 428, baseType: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 425, size: 128, align: 64, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !122, file: !7, line: 426, baseType: !49, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pfunc", scope: !122, file: !7, line: 427, baseType: !4, size: 64, align: 64, offset: 64)
!126 = !{!127}
!127 = !DISubrange(count: 4)
!128 = !DIGlobalVariable(name: "Str_Type_slots", scope: !0, file: !27, line: 172, type: !129, isLocal: true, isDefinition: true, variable: [2 x %struct.PyType_Slot]* @Str_Type_slots)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 256, align: 64, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 2)
!132 = !DIGlobalVariable(name: "Xxo_Type_spec", scope: !0, file: !27, line: 112, type: !133, isLocal: true, isDefinition: true, variable: %struct.PyType_Spec* @Xxo_Type_spec)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Spec", file: !7, line: 436, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 430, size: 256, align: 64, elements: !135)
!135 = !{!136, !139, !140, !141, !143}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !7, line: 431, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "basicsize", scope: !134, file: !7, line: 432, baseType: !49, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !134, file: !7, line: 433, baseType: !49, size: 32, align: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !7, line: 434, baseType: !142, size: 32, align: 32, offset: 128)
!142 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !134, file: !7, line: 435, baseType: !144, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!145 = !DIGlobalVariable(name: "Xxo_Type_slots", scope: !0, file: !27, line: 103, type: !146, isLocal: true, isDefinition: true, variable: [6 x %struct.PyType_Slot]* @Xxo_Type_slots)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 768, align: 64, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 6)
!149 = !DIGlobalVariable(name: "Xxo_methods", scope: !0, file: !27, line: 65, type: !150, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @Xxo_methods)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 512, align: 64, elements: !130)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !152, line: 47, baseType: !153)
!152 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !152, line: 40, size: 256, align: 64, elements: !154)
!154 = !{!155, !156, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !153, file: !152, line: 41, baseType: !137, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !153, file: !152, line: 42, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !152, line: 18, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !153, file: !152, line: 43, baseType: !49, size: 32, align: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !153, file: !152, line: 45, baseType: !137, size: 64, align: 64, offset: 192)
!161 = !DIGlobalVariable(name: "xxmodule", scope: !0, file: !27, line: 228, type: !162, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @xxmodule)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !163, line: 47, size: 832, align: 64, elements: !164)
!163 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!164 = !{!165, !174, !175, !176, !177, !179, !184, !193, !194}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !162, file: !163, line: 48, baseType: !166, size: 320, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !163, line: 38, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !163, line: 33, size: 320, align: 64, elements: !168)
!168 = !{!169, !170, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !167, file: !163, line: 34, baseType: !6, size: 128, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !167, file: !163, line: 35, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !167, file: !163, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !167, file: !163, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !162, file: !163, line: 49, baseType: !137, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !162, file: !163, line: 50, baseType: !137, size: 64, align: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !162, file: !163, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !162, file: !163, line: 52, baseType: !178, size: 64, align: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !162, file: !163, line: 53, baseType: !180, size: 64, align: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!49, !5}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !162, file: !163, line: 54, baseType: !185, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!49, !5, !189, !4}
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!49, !5, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !162, file: !163, line: 55, baseType: !180, size: 64, align: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !162, file: !163, line: 56, baseType: !21, size: 64, align: 64, offset: 768)
!195 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !27, line: 222, type: !196, isLocal: true, isDefinition: true, variable: [48 x i8]* @module_doc)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 384, align: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 48)
!199 = !DIGlobalVariable(name: "xx_methods", scope: !0, file: !27, line: 212, type: !200, isLocal: true, isDefinition: true, variable: [4 x %struct.PyMethodDef]* @xx_methods)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 1024, align: 64, elements: !126)
!201 = !DIGlobalVariable(name: "xx_foo_doc", scope: !0, file: !27, line: 124, type: !202, isLocal: true, isDefinition: true, variable: [37 x i8]* @xx_foo_doc)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 296, align: 8, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 37)
!205 = !DIGlobalVariable(name: "Str_Type_spec", scope: !0, file: !27, line: 177, type: !133, isLocal: true, isDefinition: true, variable: %struct.PyType_Spec* @Str_Type_spec)
!206 = !DIGlobalVariable(name: "Null_Type_spec", scope: !0, file: !27, line: 200, type: !133, isLocal: true, isDefinition: true, variable: %struct.PyType_Spec* @Null_Type_spec)
!207 = !{i32 2, !"Dwarf Version", i32 4}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{i32 1, !"PIC Level", i32 2}
!210 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!211 = !DILocation(line: 243, column: 5, scope: !35)
!212 = !DIExpression()
!213 = !DILocation(line: 243, column: 15, scope: !35)
!214 = !{!215, !215, i64 0}
!215 = !{!"any pointer", !216, i64 0}
!216 = !{!"omnipotent char", !217, i64 0}
!217 = !{!"Simple C/C++ TBAA"}
!218 = !DILocation(line: 244, column: 5, scope: !35)
!219 = !DILocation(line: 244, column: 15, scope: !35)
!220 = !DILocation(line: 249, column: 30, scope: !35)
!221 = !{!222, !215, i64 8}
!222 = !{!"", !223, i64 0, !215, i64 8}
!223 = !{!"int", !216, i64 0}
!224 = !DILocation(line: 250, column: 30, scope: !35)
!225 = !DILocation(line: 251, column: 29, scope: !35)
!226 = !DILocation(line: 253, column: 16, scope: !35)
!227 = !DILocation(line: 253, column: 14, scope: !35)
!228 = !DILocation(line: 254, column: 9, scope: !229)
!229 = distinct !DILexicalBlock(scope: !35, file: !27, line: 254, column: 9)
!230 = !DILocation(line: 254, column: 18, scope: !229)
!231 = !DILocation(line: 254, column: 9, scope: !35)
!232 = !DILocation(line: 255, column: 9, scope: !229)
!233 = !DILocation(line: 258, column: 9, scope: !35)
!234 = !DILocation(line: 258, column: 7, scope: !35)
!235 = !DILocation(line: 259, column: 9, scope: !236)
!236 = distinct !DILexicalBlock(scope: !35, file: !27, line: 259, column: 9)
!237 = !DILocation(line: 259, column: 11, scope: !236)
!238 = !DILocation(line: 259, column: 9, scope: !35)
!239 = !DILocation(line: 260, column: 9, scope: !236)
!240 = !DILocation(line: 263, column: 9, scope: !241)
!241 = distinct !DILexicalBlock(scope: !35, file: !27, line: 263, column: 9)
!242 = !DILocation(line: 263, column: 21, scope: !241)
!243 = !DILocation(line: 263, column: 9, scope: !35)
!244 = !DILocation(line: 264, column: 23, scope: !245)
!245 = distinct !DILexicalBlock(scope: !241, file: !27, line: 263, column: 36)
!246 = !DILocation(line: 264, column: 21, scope: !245)
!247 = !DILocation(line: 265, column: 13, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !27, line: 265, column: 13)
!249 = !DILocation(line: 265, column: 25, scope: !248)
!250 = !DILocation(line: 265, column: 13, scope: !245)
!251 = !DILocation(line: 266, column: 13, scope: !248)
!252 = !DILocation(line: 267, column: 5, scope: !245)
!253 = !DILocation(line: 268, column: 21, scope: !35)
!254 = !DILocation(line: 268, column: 36, scope: !35)
