; ModuleID = 'irs-onlybc/zipimport.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !508, globals: !1128)
!1 = !DIFile(filename: "zipimport.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !10, !16, !23}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 329, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Modules/zipimport.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "FL_ERROR", value: 0)
!7 = !DIEnumerator(name: "FL_NOT_FOUND", value: 1)
!8 = !DIEnumerator(name: "FL_MODULE_FOUND", value: 2)
!9 = !DIEnumerator(name: "FL_NS_FOUND", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zi_module_info", file: !4, line: 262, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "MI_ERROR", value: 0)
!13 = !DIEnumerator(name: "MI_NOT_FOUND", value: 1)
!14 = !DIEnumerator(name: "MI_MODULE", value: 2)
!15 = !DIEnumerator(name: "MI_PACKAGE", value: 3)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !17, line: 451, size: 32, align: 32, elements: !18)
!17 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !{!19, !20, !21, !22}
!19 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!20 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!21 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!22 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !24, line: 23, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !{!26, !27, !28, !29, !30}
!26 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!27 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!28 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!29 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!30 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!31 = !{!32, !33, !378, !396, !72, !404, !407, !415, !80, !434, !45, !433, !435, !437, !439, !441, !449, !105, !39, !59, !450}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !35, line: 109, baseType: !36)
!35 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !35, line: 105, size: 128, align: 64, elements: !37)
!37 = !{!38, !46}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !36, file: !35, line: 107, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !40, line: 177, baseType: !41)
!40 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 181, baseType: !45)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!45 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !36, file: !35, line: 108, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !35, line: 334, size: 3200, align: 64, elements: !49)
!49 = !{!50, !56, !60, !61, !62, !67, !130, !135, !140, !141, !146, !198, !229, !241, !247, !248, !249, !251, !253, !284, !285, !286, !295, !296, !301, !302, !304, !306, !316, !326, !344, !345, !346, !348, !350, !351, !353, !358, !363, !368, !369, !370, !371, !372, !373, !374, !375, !377}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !48, file: !35, line: 335, baseType: !51, size: 192, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !35, line: 114, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 111, size: 192, align: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !52, file: !35, line: 112, baseType: !34, size: 128, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !52, file: !35, line: 113, baseType: !39, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !48, file: !35, line: 336, baseType: !57, size: 64, align: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !48, file: !35, line: 337, baseType: !39, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !48, file: !35, line: 337, baseType: !39, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !48, file: !35, line: 341, baseType: !63, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !35, line: 308, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !33}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !48, file: !35, line: 342, baseType: !68, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !35, line: 314, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !33, !73, !72}
!72 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !42, line: 48, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !76, line: 246, size: 1728, align: 64, elements: !77)
!76 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!77 = !{!78, !79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !99, !100, !101, !102, !104, !106, !108, !112, !115, !117, !118, !119, !120, !121, !125, !126}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !76, line: 247, baseType: !72, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !75, file: !76, line: 252, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !75, file: !76, line: 253, baseType: !80, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !75, file: !76, line: 254, baseType: !80, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !75, file: !76, line: 255, baseType: !80, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !75, file: !76, line: 256, baseType: !80, size: 64, align: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !75, file: !76, line: 257, baseType: !80, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !75, file: !76, line: 258, baseType: !80, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !75, file: !76, line: 259, baseType: !80, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !75, file: !76, line: 261, baseType: !80, size: 64, align: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !75, file: !76, line: 262, baseType: !80, size: 64, align: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !75, file: !76, line: 263, baseType: !80, size: 64, align: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !75, file: !76, line: 265, baseType: !92, size: 64, align: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !76, line: 161, size: 192, align: 64, elements: !94)
!94 = !{!95, !96, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !93, file: !76, line: 162, baseType: !92, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !93, file: !76, line: 163, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !93, file: !76, line: 167, baseType: !72, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !75, file: !76, line: 267, baseType: !97, size: 64, align: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !75, file: !76, line: 269, baseType: !72, size: 32, align: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !75, file: !76, line: 273, baseType: !72, size: 32, align: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !75, file: !76, line: 275, baseType: !103, size: 64, align: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 140, baseType: !45)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !75, file: !76, line: 279, baseType: !105, size: 16, align: 16, offset: 1024)
!105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !75, file: !76, line: 280, baseType: !107, size: 8, align: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !75, file: !76, line: 281, baseType: !109, size: 8, align: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !75, file: !76, line: 285, baseType: !113, size: 64, align: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !76, line: 155, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !76, line: 294, baseType: !116, size: 64, align: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 141, baseType: !45)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !75, file: !76, line: 303, baseType: !32, size: 64, align: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !75, file: !76, line: 304, baseType: !32, size: 64, align: 64, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !75, file: !76, line: 305, baseType: !32, size: 64, align: 64, offset: 1344)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !75, file: !76, line: 306, baseType: !32, size: 64, align: 64, offset: 1408)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !75, file: !76, line: 307, baseType: !122, size: 64, align: 64, offset: 1472)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 62, baseType: !124)
!123 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!124 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !75, file: !76, line: 309, baseType: !72, size: 32, align: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !75, file: !76, line: 311, baseType: !127, size: 160, align: 8, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 160, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !48, file: !35, line: 343, baseType: !131, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !35, line: 316, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!33, !33, !80}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !48, file: !35, line: 344, baseType: !136, size: 64, align: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !35, line: 318, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!72, !33, !80, !33}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !48, file: !35, line: 345, baseType: !32, size: 64, align: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !48, file: !35, line: 346, baseType: !142, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !35, line: 320, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!33, !33}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !48, file: !35, line: 350, baseType: !147, size: 64, align: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !35, line: 278, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 236, size: 2176, align: 64, elements: !150)
!150 = !{!151, !156, !157, !158, !159, !160, !165, !167, !168, !169, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !149, file: !35, line: 241, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !35, line: 166, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!33, !33, !33}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !149, file: !35, line: 242, baseType: !152, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !149, file: !35, line: 243, baseType: !152, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !149, file: !35, line: 244, baseType: !152, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !149, file: !35, line: 245, baseType: !152, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !149, file: !35, line: 246, baseType: !161, size: 64, align: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !35, line: 167, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!33, !33, !33, !33}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !149, file: !35, line: 247, baseType: !166, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !35, line: 165, baseType: !143)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !149, file: !35, line: 248, baseType: !166, size: 64, align: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !149, file: !35, line: 249, baseType: !166, size: 64, align: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !149, file: !35, line: 250, baseType: !170, size: 64, align: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !35, line: 168, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!72, !33}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !149, file: !35, line: 251, baseType: !166, size: 64, align: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !149, file: !35, line: 252, baseType: !152, size: 64, align: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !149, file: !35, line: 253, baseType: !152, size: 64, align: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !149, file: !35, line: 254, baseType: !152, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !149, file: !35, line: 255, baseType: !152, size: 64, align: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !149, file: !35, line: 256, baseType: !152, size: 64, align: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !149, file: !35, line: 257, baseType: !166, size: 64, align: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !149, file: !35, line: 258, baseType: !32, size: 64, align: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !149, file: !35, line: 259, baseType: !166, size: 64, align: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !149, file: !35, line: 261, baseType: !152, size: 64, align: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !149, file: !35, line: 262, baseType: !152, size: 64, align: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !149, file: !35, line: 263, baseType: !152, size: 64, align: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !149, file: !35, line: 264, baseType: !152, size: 64, align: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !149, file: !35, line: 265, baseType: !161, size: 64, align: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !149, file: !35, line: 266, baseType: !152, size: 64, align: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !149, file: !35, line: 267, baseType: !152, size: 64, align: 64, offset: 1600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !149, file: !35, line: 268, baseType: !152, size: 64, align: 64, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !149, file: !35, line: 269, baseType: !152, size: 64, align: 64, offset: 1728)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !149, file: !35, line: 270, baseType: !152, size: 64, align: 64, offset: 1792)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !149, file: !35, line: 272, baseType: !152, size: 64, align: 64, offset: 1856)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !149, file: !35, line: 273, baseType: !152, size: 64, align: 64, offset: 1920)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !149, file: !35, line: 274, baseType: !152, size: 64, align: 64, offset: 1984)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !149, file: !35, line: 275, baseType: !152, size: 64, align: 64, offset: 2048)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !149, file: !35, line: 277, baseType: !166, size: 64, align: 64, offset: 2112)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !48, file: !35, line: 351, baseType: !199, size: 64, align: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !35, line: 292, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 280, size: 640, align: 64, elements: !202)
!202 = !{!203, !208, !209, !214, !215, !216, !221, !222, !227, !228}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !201, file: !35, line: 281, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !35, line: 169, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!39, !33}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !201, file: !35, line: 282, baseType: !152, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !201, file: !35, line: 283, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !35, line: 170, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!33, !33, !39}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !201, file: !35, line: 284, baseType: !210, size: 64, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !201, file: !35, line: 285, baseType: !32, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !201, file: !35, line: 286, baseType: !217, size: 64, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !35, line: 172, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!72, !33, !39, !33}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !201, file: !35, line: 287, baseType: !32, size: 64, align: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !201, file: !35, line: 288, baseType: !223, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !35, line: 231, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!72, !33, !33}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !201, file: !35, line: 290, baseType: !152, size: 64, align: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !201, file: !35, line: 291, baseType: !210, size: 64, align: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !48, file: !35, line: 352, baseType: !230, size: 64, align: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !35, line: 298, baseType: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 294, size: 192, align: 64, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !232, file: !35, line: 295, baseType: !204, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !232, file: !35, line: 296, baseType: !152, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !232, file: !35, line: 297, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !35, line: 174, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!72, !33, !33, !33}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !48, file: !35, line: 356, baseType: !242, size: 64, align: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !35, line: 321, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!246, !33}
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !40, line: 186, baseType: !39)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !48, file: !35, line: 357, baseType: !161, size: 64, align: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !48, file: !35, line: 358, baseType: !142, size: 64, align: 64, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !48, file: !35, line: 359, baseType: !250, size: 64, align: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !35, line: 317, baseType: !153)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !48, file: !35, line: 360, baseType: !252, size: 64, align: 64, offset: 1216)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !35, line: 319, baseType: !238)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !48, file: !35, line: 363, baseType: !254, size: 64, align: 64, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !35, line: 304, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 301, size: 128, align: 64, elements: !257)
!257 = !{!258, !279}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !256, file: !35, line: 302, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !35, line: 193, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!72, !33, !263, !72}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !35, line: 191, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !35, line: 178, size: 640, align: 64, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !276, !277, !278}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !265, file: !35, line: 179, baseType: !32, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !265, file: !35, line: 180, baseType: !33, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !35, line: 181, baseType: !39, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !265, file: !35, line: 182, baseType: !39, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !265, file: !35, line: 184, baseType: !72, size: 32, align: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !265, file: !35, line: 185, baseType: !72, size: 32, align: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !265, file: !35, line: 186, baseType: !80, size: 64, align: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !265, file: !35, line: 187, baseType: !275, size: 64, align: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !265, file: !35, line: 188, baseType: !275, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !265, file: !35, line: 189, baseType: !275, size: 64, align: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !265, file: !35, line: 190, baseType: !32, size: 64, align: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !256, file: !35, line: 303, baseType: !280, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !35, line: 194, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !33, !263}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !48, file: !35, line: 366, baseType: !124, size: 64, align: 64, offset: 1344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !48, file: !35, line: 368, baseType: !57, size: 64, align: 64, offset: 1408)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !48, file: !35, line: 372, baseType: !287, size: 64, align: 64, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !35, line: 233, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!72, !33, !291, !32}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !35, line: 232, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!72, !33, !32}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !48, file: !35, line: 375, baseType: !170, size: 64, align: 64, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !48, file: !35, line: 379, baseType: !297, size: 64, align: 64, offset: 1600)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !35, line: 322, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!33, !33, !33, !72}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !48, file: !35, line: 382, baseType: !39, size: 64, align: 64, offset: 1664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !48, file: !35, line: 385, baseType: !303, size: 64, align: 64, offset: 1728)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !35, line: 323, baseType: !143)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !48, file: !35, line: 386, baseType: !305, size: 64, align: 64, offset: 1792)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !35, line: 324, baseType: !143)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !48, file: !35, line: 389, baseType: !307, size: 64, align: 64, offset: 1856)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !309, line: 40, size: 256, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!310 = !{!311, !312, !314, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !308, file: !309, line: 41, baseType: !57, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !308, file: !309, line: 42, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !309, line: 18, baseType: !153)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !308, file: !309, line: 43, baseType: !72, size: 32, align: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !308, file: !309, line: 45, baseType: !57, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !48, file: !35, line: 390, baseType: !317, size: 64, align: 64, offset: 1920)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !319, line: 18, size: 320, align: 64, elements: !320)
!319 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!320 = !{!321, !322, !323, !324, !325}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 19, baseType: !80, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !318, file: !319, line: 20, baseType: !72, size: 32, align: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !318, file: !319, line: 21, baseType: !39, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !319, line: 22, baseType: !72, size: 32, align: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !318, file: !319, line: 23, baseType: !80, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !48, file: !35, line: 391, baseType: !327, size: 64, align: 64, offset: 1984)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !329, line: 11, size: 320, align: 64, elements: !330)
!329 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!330 = !{!331, !332, !337, !342, !343}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 12, baseType: !80, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !328, file: !329, line: 13, baseType: !333, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !329, line: 8, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!33, !33, !32}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !328, file: !329, line: 14, baseType: !338, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !329, line: 9, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!72, !33, !33, !32}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !328, file: !329, line: 15, baseType: !80, size: 64, align: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !328, file: !329, line: 16, baseType: !32, size: 64, align: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !48, file: !35, line: 392, baseType: !47, size: 64, align: 64, offset: 2048)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !48, file: !35, line: 393, baseType: !33, size: 64, align: 64, offset: 2112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !48, file: !35, line: 394, baseType: !347, size: 64, align: 64, offset: 2176)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !35, line: 325, baseType: !162)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !48, file: !35, line: 395, baseType: !349, size: 64, align: 64, offset: 2240)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !35, line: 326, baseType: !238)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !48, file: !35, line: 396, baseType: !39, size: 64, align: 64, offset: 2304)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !48, file: !35, line: 397, baseType: !352, size: 64, align: 64, offset: 2368)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !35, line: 327, baseType: !238)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !48, file: !35, line: 398, baseType: !354, size: 64, align: 64, offset: 2432)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !35, line: 329, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!33, !47, !39}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !48, file: !35, line: 399, baseType: !359, size: 64, align: 64, offset: 2496)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !35, line: 328, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!33, !47, !33, !33}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !48, file: !35, line: 400, baseType: !364, size: 64, align: 64, offset: 2560)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !35, line: 307, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !32}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !48, file: !35, line: 401, baseType: !170, size: 64, align: 64, offset: 2624)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !48, file: !35, line: 402, baseType: !33, size: 64, align: 64, offset: 2688)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !48, file: !35, line: 403, baseType: !33, size: 64, align: 64, offset: 2752)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !48, file: !35, line: 404, baseType: !33, size: 64, align: 64, offset: 2816)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !48, file: !35, line: 405, baseType: !33, size: 64, align: 64, offset: 2880)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !48, file: !35, line: 406, baseType: !33, size: 64, align: 64, offset: 2944)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !48, file: !35, line: 407, baseType: !63, size: 64, align: 64, offset: 3008)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !48, file: !35, line: 410, baseType: !376, size: 32, align: 32, offset: 3072)
!376 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !48, file: !35, line: 412, baseType: !63, size: 64, align: 64, offset: 3136)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !17, line: 351, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 217, size: 384, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !393}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !380, file: !17, line: 291, baseType: !34, size: 128, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !380, file: !17, line: 292, baseType: !39, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !380, file: !17, line: 293, baseType: !246, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !17, line: 349, baseType: !386, size: 32, align: 32, offset: 256)
!386 = !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !17, line: 294, size: 32, align: 32, elements: !387)
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !386, file: !17, line: 303, baseType: !376, size: 2, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !386, file: !17, line: 331, baseType: !376, size: 3, align: 32, offset: 2)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !386, file: !17, line: 336, baseType: !376, size: 1, align: 32, offset: 5)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !386, file: !17, line: 340, baseType: !376, size: 1, align: 32, offset: 6)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !386, file: !17, line: 345, baseType: !376, size: 1, align: 32, offset: 7)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !380, file: !17, line: 350, baseType: !394, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !123, line: 90, baseType: !72)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZipImporter", file: !4, line: 38, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_zipimporter", file: !4, line: 40, size: 320, align: 64, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !398, file: !4, line: 41, baseType: !34, size: 128, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !398, file: !4, line: 42, baseType: !33, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !398, file: !4, line: 44, baseType: !33, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !398, file: !4, line: 46, baseType: !33, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !405, line: 75, baseType: !406)
!405 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !44, line: 148, baseType: !45)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !17, line: 363, baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 356, size: 576, align: 64, elements: !410)
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !409, file: !17, line: 357, baseType: !379, size: 384, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !409, file: !17, line: 358, baseType: !39, size: 64, align: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !409, file: !17, line: 360, baseType: !80, size: 64, align: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !409, file: !17, line: 361, baseType: !39, size: 64, align: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !17, line: 376, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 368, size: 640, align: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !417, file: !17, line: 369, baseType: !408, size: 576, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !417, file: !17, line: 375, baseType: !421, size: 64, align: 64, offset: 576)
!421 = !DICompositeType(tag: DW_TAG_union_type, scope: !417, file: !17, line: 370, size: 64, align: 64, elements: !422)
!422 = !{!423, !424, !428, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !421, file: !17, line: 371, baseType: !32, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !421, file: !17, line: 372, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !17, line: 134, baseType: !427)
!427 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !421, file: !17, line: 373, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !17, line: 129, baseType: !105)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !421, file: !17, line: 374, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !17, line: 121, baseType: !376)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !443, line: 41, baseType: !444)
!443 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!444 = !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 31, size: 320, align: 64, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !443, line: 32, baseType: !51, size: 192, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !444, file: !443, line: 33, baseType: !246, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !444, file: !443, line: 34, baseType: !109, size: 8, align: 8, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !452, line: 139, baseType: !453)
!452 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !452, line: 69, size: 1536, align: 64, elements: !454)
!454 = !{!455, !457, !458, !478, !481, !482, !483, !484, !485, !486, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !452, line: 72, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !452, line: 73, baseType: !456, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !453, file: !452, line: 74, baseType: !459, size: 64, align: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !452, line: 44, baseType: !461)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !452, line: 19, size: 832, align: 64, elements: !462)
!462 = !{!463, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !452, line: 21, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !461, file: !452, line: 22, baseType: !456, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !461, file: !452, line: 24, baseType: !33, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !461, file: !452, line: 25, baseType: !33, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !461, file: !452, line: 26, baseType: !33, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !461, file: !452, line: 27, baseType: !33, size: 64, align: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !461, file: !452, line: 28, baseType: !33, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !461, file: !452, line: 30, baseType: !33, size: 64, align: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !461, file: !452, line: 31, baseType: !33, size: 64, align: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !461, file: !452, line: 32, baseType: !33, size: 64, align: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !461, file: !452, line: 33, baseType: !72, size: 32, align: 32, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !461, file: !452, line: 34, baseType: !72, size: 32, align: 32, offset: 672)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !461, file: !452, line: 37, baseType: !72, size: 32, align: 32, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !461, file: !452, line: 43, baseType: !33, size: 64, align: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !453, file: !452, line: 76, baseType: !479, size: 64, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !452, line: 50, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !453, file: !452, line: 77, baseType: !72, size: 32, align: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !453, file: !452, line: 78, baseType: !59, size: 8, align: 8, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !453, file: !452, line: 80, baseType: !59, size: 8, align: 8, offset: 296)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !453, file: !452, line: 85, baseType: !72, size: 32, align: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !453, file: !452, line: 86, baseType: !72, size: 32, align: 32, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !453, file: !452, line: 88, baseType: !487, size: 64, align: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !452, line: 54, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!72, !33, !479, !72, !33}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !453, file: !452, line: 89, baseType: !487, size: 64, align: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !453, file: !452, line: 90, baseType: !33, size: 64, align: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !453, file: !452, line: 91, baseType: !33, size: 64, align: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !453, file: !452, line: 93, baseType: !33, size: 64, align: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !453, file: !452, line: 94, baseType: !33, size: 64, align: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !453, file: !452, line: 95, baseType: !33, size: 64, align: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !453, file: !452, line: 97, baseType: !33, size: 64, align: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !453, file: !452, line: 98, baseType: !33, size: 64, align: 64, offset: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !453, file: !452, line: 99, baseType: !33, size: 64, align: 64, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !453, file: !452, line: 101, baseType: !33, size: 64, align: 64, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !453, file: !452, line: 103, baseType: !72, size: 32, align: 32, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !453, file: !452, line: 105, baseType: !33, size: 64, align: 64, offset: 1152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !453, file: !452, line: 106, baseType: !45, size: 64, align: 64, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !453, file: !452, line: 108, baseType: !72, size: 32, align: 32, offset: 1280)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !453, file: !452, line: 109, baseType: !33, size: 64, align: 64, offset: 1344)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !453, file: !452, line: 134, baseType: !365, size: 64, align: 64, offset: 1408)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !453, file: !452, line: 135, baseType: !32, size: 64, align: 64, offset: 1472)
!508 = !{!509, !524, !544, !549, !559, !571, !584, !613, !618, !626, !637, !649, !688, !736, !751, !771, !785, !818, !826, !840, !846, !853, !868, !876, !897, !903, !926, !937, !944, !1024, !1111, !1120, !1125}
!509 = !DISubprogram(name: "PyInit_zipimport", scope: !4, file: !4, line: 1471, type: !510, isLocal: false, isDefinition: true, scopeLine: 1472, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_zipimport, variables: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!33}
!512 = !{!513, !514}
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !509, file: !4, line: 1473, type: !33)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !515, file: !4, line: 1484, type: !517)
!515 = distinct !DILexicalBlock(scope: !516, file: !4, line: 1482, column: 26)
!516 = distinct !DILexicalBlock(scope: !509, file: !4, line: 1482, column: 9)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "st_zip_searchorder", file: !4, line: 12, size: 160, align: 32, elements: !518)
!518 = !{!519, !523}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !517, file: !4, line: 13, baseType: !520, size: 112, align: 8)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 112, align: 8, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 14)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !517, file: !4, line: 14, baseType: !72, size: 32, align: 32, offset: 128)
!524 = !DISubprogram(name: "zipimporter_dealloc", scope: !4, file: !4, line: 185, type: !525, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._zipimporter*)* @zipimporter_dealloc, variables: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !396}
!527 = !{!528, !529, !531, !534, !536, !539, !541}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !524, file: !4, line: 185, type: !396)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !530, file: !4, line: 188, type: !33)
!530 = distinct !DILexicalBlock(scope: !524, file: !4, line: 188, column: 8)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !532, file: !4, line: 188, type: !33)
!532 = distinct !DILexicalBlock(scope: !533, file: !4, line: 188, column: 105)
!533 = distinct !DILexicalBlock(scope: !530, file: !4, line: 188, column: 71)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !535, file: !4, line: 189, type: !33)
!535 = distinct !DILexicalBlock(scope: !524, file: !4, line: 189, column: 8)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !537, file: !4, line: 189, type: !33)
!537 = distinct !DILexicalBlock(scope: !538, file: !4, line: 189, column: 104)
!538 = distinct !DILexicalBlock(scope: !535, file: !4, line: 189, column: 70)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !540, file: !4, line: 190, type: !33)
!540 = distinct !DILexicalBlock(scope: !524, file: !4, line: 190, column: 8)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !542, file: !4, line: 190, type: !33)
!542 = distinct !DILexicalBlock(scope: !543, file: !4, line: 190, column: 103)
!543 = distinct !DILexicalBlock(scope: !540, file: !4, line: 190, column: 69)
!544 = !DISubprogram(name: "zipimporter_repr", scope: !4, file: !4, line: 195, type: !545, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._zipimporter*)* @zipimporter_repr, variables: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{!33, !396}
!547 = !{!548}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !544, file: !4, line: 195, type: !396)
!549 = !DISubprogram(name: "zipimporter_traverse", scope: !4, file: !4, line: 177, type: !289, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @zipimporter_traverse, variables: !550)
!550 = !{!551, !552, !553, !554, !555}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !549, file: !4, line: 177, type: !33)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !549, file: !4, line: 177, type: !291)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !549, file: !4, line: 177, type: !32)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !549, file: !4, line: 179, type: !396)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !556, file: !4, line: 180, type: !72)
!556 = distinct !DILexicalBlock(scope: !557, file: !4, line: 180, column: 27)
!557 = distinct !DILexicalBlock(scope: !558, file: !4, line: 180, column: 14)
!558 = distinct !DILexicalBlock(scope: !549, file: !4, line: 180, column: 8)
!559 = !DISubprogram(name: "zipimporter_find_module", scope: !4, file: !4, line: 379, type: !154, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_find_module, variables: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !559, file: !4, line: 379, type: !33)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !559, file: !4, line: 379, type: !33)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !559, file: !4, line: 381, type: !396)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !559, file: !4, line: 382, type: !33)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !559, file: !4, line: 383, type: !33)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namespace_portion", scope: !559, file: !4, line: 384, type: !33)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !559, file: !4, line: 385, type: !33)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !4, line: 395, type: !33)
!569 = distinct !DILexicalBlock(scope: !570, file: !4, line: 395, column: 12)
!570 = distinct !DILexicalBlock(scope: !559, file: !4, line: 390, column: 62)
!571 = !DISubprogram(name: "find_loader", scope: !4, file: !4, line: 343, type: !572, isLocal: true, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._zipimporter*, %struct._object*, %struct._object**)* @find_loader, variables: !576)
!572 = !DISubroutineType(types: !573)
!573 = !{!574, !396, !33, !575}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "find_loader_result", file: !4, line: 334, baseType: !3)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!576 = !{!577, !578, !579, !580, !581}
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !571, file: !4, line: 343, type: !396)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !571, file: !4, line: 343, type: !33)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "namespace_portion", arg: 3, scope: !571, file: !4, line: 343, type: !575)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mi", scope: !571, file: !4, line: 345, type: !10)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_dir", scope: !582, file: !4, line: 355, type: !72)
!582 = distinct !DILexicalBlock(scope: !583, file: !4, line: 352, column: 29)
!583 = distinct !DILexicalBlock(scope: !571, file: !4, line: 352, column: 9)
!584 = !DISubprogram(name: "get_module_info", scope: !4, file: !4, line: 294, type: !585, isLocal: true, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._zipimporter*, %struct._object*)* @get_module_info, variables: !587)
!585 = !DISubroutineType(types: !586)
!586 = !{!10, !396, !33}
!587 = !{!588, !589, !590, !591, !592, !593, !594, !596, !598, !605, !607, !611}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !584, file: !4, line: 294, type: !396)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !584, file: !4, line: 294, type: !33)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !584, file: !4, line: 296, type: !33)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !584, file: !4, line: 297, type: !33)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !584, file: !4, line: 297, type: !33)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !584, file: !4, line: 297, type: !33)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zso", scope: !584, file: !4, line: 298, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !597, file: !4, line: 305, type: !33)
!597 = distinct !DILexicalBlock(scope: !584, file: !4, line: 305, column: 8)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !4, line: 312, type: !33)
!599 = distinct !DILexicalBlock(scope: !600, file: !4, line: 312, column: 16)
!600 = distinct !DILexicalBlock(scope: !601, file: !4, line: 311, column: 37)
!601 = distinct !DILexicalBlock(scope: !602, file: !4, line: 311, column: 13)
!602 = distinct !DILexicalBlock(scope: !603, file: !4, line: 309, column: 54)
!603 = distinct !DILexicalBlock(scope: !604, file: !4, line: 309, column: 5)
!604 = distinct !DILexicalBlock(scope: !584, file: !4, line: 309, column: 5)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !606, file: !4, line: 316, type: !33)
!606 = distinct !DILexicalBlock(scope: !602, file: !4, line: 316, column: 12)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !608, file: !4, line: 318, type: !33)
!608 = distinct !DILexicalBlock(scope: !609, file: !4, line: 318, column: 16)
!609 = distinct !DILexicalBlock(scope: !610, file: !4, line: 317, column: 33)
!610 = distinct !DILexicalBlock(scope: !602, file: !4, line: 317, column: 13)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !612, file: !4, line: 325, type: !33)
!612 = distinct !DILexicalBlock(scope: !584, file: !4, line: 325, column: 8)
!613 = !DISubprogram(name: "get_subname", scope: !4, file: !4, line: 209, type: !144, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_subname, variables: !614)
!614 = !{!615, !616, !617}
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 1, scope: !613, file: !4, line: 209, type: !33)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !613, file: !4, line: 211, type: !39)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !613, file: !4, line: 211, type: !39)
!618 = !DISubprogram(name: "make_filename", scope: !4, file: !4, line: 229, type: !154, isLocal: true, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @make_filename, variables: !619)
!619 = !{!620, !621, !622, !623, !624, !625}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 1, scope: !618, file: !4, line: 229, type: !33)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !618, file: !4, line: 229, type: !33)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pathobj", scope: !618, file: !4, line: 231, type: !33)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !618, file: !4, line: 232, type: !432)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !618, file: !4, line: 232, type: !432)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !618, file: !4, line: 233, type: !39)
!626 = !DISubprogram(name: "check_is_directory", scope: !4, file: !4, line: 275, type: !627, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._zipimporter*, %struct._object*, %struct._object*)* @check_is_directory, variables: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!72, !396, !33, !33}
!629 = !{!630, !631, !632, !633, !634, !635}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !626, file: !4, line: 275, type: !396)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 2, scope: !626, file: !4, line: 275, type: !33)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 3, scope: !626, file: !4, line: 275, type: !33)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirpath", scope: !626, file: !4, line: 277, type: !33)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !626, file: !4, line: 278, type: !72)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !636, file: !4, line: 288, type: !33)
!636 = distinct !DILexicalBlock(scope: !626, file: !4, line: 288, column: 8)
!637 = !DISubprogram(name: "zipimporter_find_loader", scope: !4, file: !4, line: 415, type: !154, isLocal: true, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_find_loader, variables: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !637, file: !4, line: 415, type: !33)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !637, file: !4, line: 415, type: !33)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !637, file: !4, line: 417, type: !396)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !637, file: !4, line: 418, type: !33)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !637, file: !4, line: 419, type: !33)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !637, file: !4, line: 420, type: !33)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namespace_portion", scope: !637, file: !4, line: 421, type: !33)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !4, line: 437, type: !33)
!647 = distinct !DILexicalBlock(scope: !648, file: !4, line: 437, column: 12)
!648 = distinct !DILexicalBlock(scope: !637, file: !4, line: 426, column: 62)
!649 = !DISubprogram(name: "zipimporter_load_module", scope: !4, file: !4, line: 445, type: !154, isLocal: true, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_load_module, variables: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !663, !664, !665, !666, !668, !670, !672, !676, !678, !680, !683, !685}
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !649, file: !4, line: 445, type: !33)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !649, file: !4, line: 445, type: !33)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !649, file: !4, line: 447, type: !396)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !649, file: !4, line: 448, type: !33)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !649, file: !4, line: 448, type: !33)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !649, file: !4, line: 448, type: !33)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !649, file: !4, line: 449, type: !33)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modpath", scope: !649, file: !4, line: 450, type: !33)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ispackage", scope: !649, file: !4, line: 451, type: !72)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pkgpath", scope: !661, file: !4, line: 475, type: !33)
!661 = distinct !DILexicalBlock(scope: !662, file: !4, line: 472, column: 20)
!662 = distinct !DILexicalBlock(scope: !649, file: !4, line: 472, column: 9)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !661, file: !4, line: 475, type: !33)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !661, file: !4, line: 475, type: !33)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !661, file: !4, line: 476, type: !72)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !4, line: 485, type: !33)
!667 = distinct !DILexicalBlock(scope: !661, file: !4, line: 485, column: 12)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !4, line: 493, type: !33)
!669 = distinct !DILexicalBlock(scope: !661, file: !4, line: 493, column: 12)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !671, file: !4, line: 498, type: !33)
!671 = distinct !DILexicalBlock(scope: !649, file: !4, line: 498, column: 8)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !4, line: 498, type: !33)
!673 = distinct !DILexicalBlock(scope: !674, file: !4, line: 498, column: 103)
!674 = distinct !DILexicalBlock(scope: !675, file: !4, line: 498, column: 77)
!675 = distinct !DILexicalBlock(scope: !671, file: !4, line: 498, column: 54)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !4, line: 505, type: !33)
!677 = distinct !DILexicalBlock(scope: !649, file: !4, line: 505, column: 8)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !679, file: !4, line: 508, type: !33)
!679 = distinct !DILexicalBlock(scope: !649, file: !4, line: 508, column: 8)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !681, file: !4, line: 508, type: !33)
!681 = distinct !DILexicalBlock(scope: !682, file: !4, line: 508, column: 96)
!682 = distinct !DILexicalBlock(scope: !679, file: !4, line: 508, column: 62)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !684, file: !4, line: 509, type: !33)
!684 = distinct !DILexicalBlock(scope: !649, file: !4, line: 509, column: 8)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !4, line: 509, type: !33)
!686 = distinct !DILexicalBlock(scope: !687, file: !4, line: 509, column: 99)
!687 = distinct !DILexicalBlock(scope: !684, file: !4, line: 509, column: 65)
!688 = !DISubprogram(name: "get_module_code", scope: !4, file: !4, line: 1375, type: !689, isLocal: true, isDefinition: true, scopeLine: 1377, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._zipimporter*, %struct._object*, i32*, %struct._object**)* @get_module_code, variables: !692)
!689 = !DISubroutineType(types: !690)
!690 = !{!33, !396, !33, !691, !575}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !705, !711, !712, !713, !715, !719, !723, !725, !729, !731, !733}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !688, file: !4, line: 1375, type: !396)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !688, file: !4, line: 1375, type: !33)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_ispackage", arg: 3, scope: !688, file: !4, line: 1376, type: !691)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_modpath", arg: 4, scope: !688, file: !4, line: 1376, type: !575)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !688, file: !4, line: 1378, type: !33)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !688, file: !4, line: 1378, type: !33)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !688, file: !4, line: 1378, type: !33)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !688, file: !4, line: 1379, type: !33)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !688, file: !4, line: 1379, type: !33)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zso", scope: !688, file: !4, line: 1380, type: !595)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !4, line: 1387, type: !33)
!704 = distinct !DILexicalBlock(scope: !688, file: !4, line: 1387, column: 8)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtime", scope: !706, file: !4, line: 1403, type: !404)
!706 = distinct !DILexicalBlock(scope: !707, file: !4, line: 1402, column: 38)
!707 = distinct !DILexicalBlock(scope: !708, file: !4, line: 1402, column: 13)
!708 = distinct !DILexicalBlock(scope: !709, file: !4, line: 1391, column: 54)
!709 = distinct !DILexicalBlock(scope: !710, file: !4, line: 1391, column: 5)
!710 = distinct !DILexicalBlock(scope: !688, file: !4, line: 1391, column: 5)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ispackage", scope: !706, file: !4, line: 1404, type: !72)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isbytecode", scope: !706, file: !4, line: 1405, type: !72)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !714, file: !4, line: 1413, type: !33)
!714 = distinct !DILexicalBlock(scope: !706, file: !4, line: 1413, column: 16)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !4, line: 1413, type: !33)
!716 = distinct !DILexicalBlock(scope: !717, file: !4, line: 1413, column: 119)
!717 = distinct !DILexicalBlock(scope: !718, file: !4, line: 1413, column: 89)
!718 = distinct !DILexicalBlock(scope: !714, file: !4, line: 1413, column: 66)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !720, file: !4, line: 1422, type: !33)
!720 = distinct !DILexicalBlock(scope: !721, file: !4, line: 1422, column: 20)
!721 = distinct !DILexicalBlock(scope: !722, file: !4, line: 1419, column: 44)
!722 = distinct !DILexicalBlock(scope: !706, file: !4, line: 1419, column: 17)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !724, file: !4, line: 1432, type: !33)
!724 = distinct !DILexicalBlock(scope: !707, file: !4, line: 1432, column: 16)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !726, file: !4, line: 1432, type: !33)
!726 = distinct !DILexicalBlock(scope: !727, file: !4, line: 1432, column: 119)
!727 = distinct !DILexicalBlock(scope: !728, file: !4, line: 1432, column: 89)
!728 = distinct !DILexicalBlock(scope: !724, file: !4, line: 1432, column: 66)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !4, line: 1436, type: !33)
!730 = distinct !DILexicalBlock(scope: !688, file: !4, line: 1436, column: 8)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !732, file: !4, line: 1437, type: !33)
!732 = distinct !DILexicalBlock(scope: !688, file: !4, line: 1437, column: 8)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !734, file: !4, line: 1437, type: !33)
!734 = distinct !DILexicalBlock(scope: !735, file: !4, line: 1437, column: 100)
!735 = distinct !DILexicalBlock(scope: !732, file: !4, line: 1437, column: 66)
!736 = !DISubprogram(name: "get_mtime_of_source", scope: !4, file: !4, line: 1322, type: !737, isLocal: true, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._zipimporter*, %struct._object*)* @get_mtime_of_source, variables: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{!404, !396, !33}
!739 = !{!740, !741, !742, !743, !744, !745, !747, !750}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !736, file: !4, line: 1322, type: !396)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !736, file: !4, line: 1322, type: !33)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !736, file: !4, line: 1324, type: !33)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stripped", scope: !736, file: !4, line: 1324, type: !33)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtime", scope: !736, file: !4, line: 1325, type: !404)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !746, file: !4, line: 1337, type: !33)
!746 = distinct !DILexicalBlock(scope: !736, file: !4, line: 1337, column: 8)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !748, file: !4, line: 1342, type: !72)
!748 = distinct !DILexicalBlock(scope: !749, file: !4, line: 1339, column: 39)
!749 = distinct !DILexicalBlock(scope: !736, file: !4, line: 1338, column: 9)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "date", scope: !748, file: !4, line: 1342, type: !72)
!751 = !DISubprogram(name: "parse_dostime", scope: !4, file: !4, line: 1301, type: !752, isLocal: true, isDefinition: true, scopeLine: 1302, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32, i32)* @parse_dostime, variables: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!404, !72, !72}
!754 = !{!755, !756, !757}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dostime", arg: 1, scope: !751, file: !4, line: 1301, type: !72)
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dosdate", arg: 2, scope: !751, file: !4, line: 1301, type: !72)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stm", scope: !751, file: !4, line: 1303, type: !758)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !405, line: 133, size: 448, align: 64, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !758, file: !405, line: 135, baseType: !72, size: 32, align: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !758, file: !405, line: 136, baseType: !72, size: 32, align: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !758, file: !405, line: 137, baseType: !72, size: 32, align: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !758, file: !405, line: 138, baseType: !72, size: 32, align: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !758, file: !405, line: 139, baseType: !72, size: 32, align: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !758, file: !405, line: 140, baseType: !72, size: 32, align: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !758, file: !405, line: 141, baseType: !72, size: 32, align: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !758, file: !405, line: 142, baseType: !72, size: 32, align: 32, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !758, file: !405, line: 143, baseType: !72, size: 32, align: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !758, file: !405, line: 146, baseType: !45, size: 64, align: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !758, file: !405, line: 147, baseType: !57, size: 64, align: 64, offset: 384)
!771 = !DISubprogram(name: "get_code_from_data", scope: !4, file: !4, line: 1354, type: !772, isLocal: true, isDefinition: true, scopeLine: 1356, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._zipimporter*, i32, i32, i64, %struct._object*)* @get_code_from_data, variables: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!33, !396, !72, !72, !404, !33}
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783}
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !771, file: !4, line: 1354, type: !396)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ispackage", arg: 2, scope: !771, file: !4, line: 1354, type: !72)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isbytecode", arg: 3, scope: !771, file: !4, line: 1354, type: !72)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtime", arg: 4, scope: !771, file: !4, line: 1355, type: !404)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "toc_entry", arg: 5, scope: !771, file: !4, line: 1355, type: !33)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !771, file: !4, line: 1357, type: !33)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modpath", scope: !771, file: !4, line: 1357, type: !33)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !771, file: !4, line: 1357, type: !33)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !4, line: 1368, type: !33)
!784 = distinct !DILexicalBlock(scope: !771, file: !4, line: 1368, column: 8)
!785 = !DISubprogram(name: "get_data", scope: !4, file: !4, line: 1057, type: !154, isLocal: true, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_data, variables: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !810, !814, !816}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "archive", arg: 1, scope: !785, file: !4, line: 1057, type: !33)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "toc_entry", arg: 2, scope: !785, file: !4, line: 1057, type: !33)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw_data", scope: !785, file: !4, line: 1059, type: !33)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !785, file: !4, line: 1059, type: !33)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decompress", scope: !785, file: !4, line: 1059, type: !33)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !785, file: !4, line: 1060, type: !80)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !785, file: !4, line: 1061, type: !73)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !785, file: !4, line: 1062, type: !72)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_read", scope: !785, file: !4, line: 1063, type: !39)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !785, file: !4, line: 1064, type: !45)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "datapath", scope: !785, file: !4, line: 1065, type: !33)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compress", scope: !785, file: !4, line: 1066, type: !45)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_size", scope: !785, file: !4, line: 1066, type: !45)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_size", scope: !785, file: !4, line: 1066, type: !45)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_offset", scope: !785, file: !4, line: 1066, type: !45)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_size", scope: !785, file: !4, line: 1066, type: !45)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !785, file: !4, line: 1067, type: !45)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "date", scope: !785, file: !4, line: 1067, type: !45)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crc", scope: !785, file: !4, line: 1067, type: !45)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !807, file: !4, line: 1137, type: !33)
!807 = distinct !DILexicalBlock(scope: !808, file: !4, line: 1137, column: 12)
!808 = distinct !DILexicalBlock(scope: !809, file: !4, line: 1134, column: 41)
!809 = distinct !DILexicalBlock(scope: !785, file: !4, line: 1134, column: 9)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !811, file: !4, line: 1149, type: !33)
!811 = distinct !DILexicalBlock(scope: !812, file: !4, line: 1149, column: 12)
!812 = distinct !DILexicalBlock(scope: !813, file: !4, line: 1147, column: 24)
!813 = distinct !DILexicalBlock(scope: !785, file: !4, line: 1147, column: 9)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !4, line: 1162, type: !33)
!815 = distinct !DILexicalBlock(scope: !785, file: !4, line: 1162, column: 8)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !4, line: 1164, type: !33)
!817 = distinct !DILexicalBlock(scope: !785, file: !4, line: 1164, column: 8)
!818 = !DISubprogram(name: "get_decompress_func", scope: !4, file: !4, line: 1025, type: !510, isLocal: true, isDefinition: true, scopeLine: 1026, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @get_decompress_func, variables: !819)
!819 = !{!820, !821, !822}
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zlib", scope: !818, file: !4, line: 1028, type: !33)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decompress", scope: !818, file: !4, line: 1029, type: !33)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !823, file: !4, line: 1042, type: !33)
!823 = distinct !DILexicalBlock(scope: !824, file: !4, line: 1042, column: 12)
!824 = distinct !DILexicalBlock(scope: !825, file: !4, line: 1039, column: 29)
!825 = distinct !DILexicalBlock(scope: !818, file: !4, line: 1039, column: 9)
!826 = !DISubprogram(name: "unmarshal_code", scope: !4, file: !4, line: 1187, type: !827, isLocal: true, isDefinition: true, scopeLine: 1188, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i64)* @unmarshal_code, variables: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!33, !33, !33, !404}
!829 = !{!830, !831, !832, !833, !834, !835, !836}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !826, file: !4, line: 1187, type: !33)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !826, file: !4, line: 1187, type: !33)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtime", arg: 3, scope: !826, file: !4, line: 1187, type: !404)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !826, file: !4, line: 1189, type: !33)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !826, file: !4, line: 1190, type: !80)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !826, file: !4, line: 1191, type: !39)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !4, line: 1222, type: !33)
!837 = distinct !DILexicalBlock(scope: !838, file: !4, line: 1222, column: 12)
!838 = distinct !DILexicalBlock(scope: !839, file: !4, line: 1221, column: 60)
!839 = distinct !DILexicalBlock(scope: !826, file: !4, line: 1221, column: 9)
!840 = !DISubprogram(name: "get_long", scope: !4, file: !4, line: 821, type: !841, isLocal: true, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @get_long, variables: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!45, !434}
!843 = !{!844, !845}
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !840, file: !4, line: 821, type: !434)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !840, file: !4, line: 822, type: !45)
!846 = !DISubprogram(name: "eq_mtime", scope: !4, file: !4, line: 1172, type: !847, isLocal: true, isDefinition: true, scopeLine: 1173, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64, i64)* @eq_mtime, variables: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!72, !404, !404}
!849 = !{!850, !851, !852}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t1", arg: 1, scope: !846, file: !4, line: 1172, type: !404)
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t2", arg: 2, scope: !846, file: !4, line: 1172, type: !404)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !846, file: !4, line: 1174, type: !404)
!853 = !DISubprogram(name: "compile_source", scope: !4, file: !4, line: 1276, type: !154, isLocal: true, isDefinition: true, scopeLine: 1277, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @compile_source, variables: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !864, !866}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !853, file: !4, line: 1276, type: !33)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !853, file: !4, line: 1276, type: !33)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !853, file: !4, line: 1278, type: !33)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixed_source", scope: !853, file: !4, line: 1278, type: !33)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pathbytes", scope: !853, file: !4, line: 1278, type: !33)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !861, file: !4, line: 1286, type: !33)
!861 = distinct !DILexicalBlock(scope: !862, file: !4, line: 1286, column: 12)
!862 = distinct !DILexicalBlock(scope: !863, file: !4, line: 1285, column: 37)
!863 = distinct !DILexicalBlock(scope: !853, file: !4, line: 1285, column: 9)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !4, line: 1293, type: !33)
!865 = distinct !DILexicalBlock(scope: !853, file: !4, line: 1293, column: 8)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !4, line: 1294, type: !33)
!867 = distinct !DILexicalBlock(scope: !853, file: !4, line: 1294, column: 8)
!868 = !DISubprogram(name: "normalize_line_endings", scope: !4, file: !4, line: 1236, type: !144, isLocal: true, isDefinition: true, scopeLine: 1237, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @normalize_line_endings, variables: !869)
!869 = !{!870, !871, !872, !873, !874, !875}
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 1, scope: !868, file: !4, line: 1236, type: !33)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !868, file: !4, line: 1238, type: !80)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !868, file: !4, line: 1238, type: !80)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !868, file: !4, line: 1238, type: !80)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixed_source", scope: !868, file: !4, line: 1239, type: !33)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !868, file: !4, line: 1240, type: !72)
!876 = !DISubprogram(name: "zipimporter_get_data", scope: !4, file: !4, line: 559, type: !154, isLocal: true, isDefinition: true, scopeLine: 560, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_get_data, variables: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !891, !893, !895}
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !876, file: !4, line: 559, type: !33)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !876, file: !4, line: 559, type: !33)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !876, file: !4, line: 561, type: !396)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !876, file: !4, line: 562, type: !33)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !876, file: !4, line: 562, type: !33)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !876, file: !4, line: 563, type: !33)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_start", scope: !876, file: !4, line: 564, type: !39)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_len", scope: !876, file: !4, line: 564, type: !39)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !876, file: !4, line: 564, type: !39)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !888, file: !4, line: 594, type: !33)
!888 = distinct !DILexicalBlock(scope: !889, file: !4, line: 594, column: 12)
!889 = distinct !DILexicalBlock(scope: !890, file: !4, line: 592, column: 34)
!890 = distinct !DILexicalBlock(scope: !876, file: !4, line: 592, column: 9)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !4, line: 597, type: !33)
!892 = distinct !DILexicalBlock(scope: !876, file: !4, line: 597, column: 8)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !894, file: !4, line: 598, type: !33)
!894 = distinct !DILexicalBlock(scope: !876, file: !4, line: 598, column: 8)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !896, file: !4, line: 601, type: !33)
!896 = distinct !DILexicalBlock(scope: !876, file: !4, line: 601, column: 8)
!897 = !DISubprogram(name: "zipimporter_get_code", scope: !4, file: !4, line: 606, type: !154, isLocal: true, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_get_code, variables: !898)
!898 = !{!899, !900, !901, !902}
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !897, file: !4, line: 606, type: !33)
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !897, file: !4, line: 606, type: !33)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !897, file: !4, line: 608, type: !396)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !897, file: !4, line: 609, type: !33)
!903 = !DISubprogram(name: "zipimporter_get_source", scope: !4, file: !4, line: 618, type: !154, isLocal: true, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_get_source, variables: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !916, !918, !920, !923, !924}
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !903, file: !4, line: 618, type: !33)
!906 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !903, file: !4, line: 618, type: !33)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !903, file: !4, line: 620, type: !396)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !903, file: !4, line: 621, type: !33)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !903, file: !4, line: 622, type: !33)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !903, file: !4, line: 622, type: !33)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !903, file: !4, line: 622, type: !33)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !903, file: !4, line: 622, type: !33)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mi", scope: !903, file: !4, line: 623, type: !10)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !915, file: !4, line: 641, type: !33)
!915 = distinct !DILexicalBlock(scope: !903, file: !4, line: 641, column: 8)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !4, line: 649, type: !33)
!917 = distinct !DILexicalBlock(scope: !903, file: !4, line: 649, column: 8)
