; ModuleID = 'programs_new/Python-new/zlibmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !415, globals: !1040)
!1 = !DIFile(filename: "zlibmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !94, !348, !350, !352, !360, !96, !412, !413, !52, !414, !44, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !354, line: 41, baseType: !355)
!354 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!355 = !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 31, size: 320, align: 64, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !355, file: !354, line: 32, baseType: !23, size: 192, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !355, file: !354, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !355, file: !354, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "compobject", file: !362, line: 52, baseType: !363)
!362 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/zlibmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!363 = !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 40, size: 1344, align: 64, elements: !364)
!364 = !{!365, !366, !404, !405, !406, !407, !408, !409}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !363, file: !362, line: 42, baseType: !6, size: 128, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "zst", scope: !363, file: !362, line: 43, baseType: !367, size: 896, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !368, line: 104, baseType: !369)
!368 = !DIFile(filename: "/usr/include/zlib.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !368, line: 85, size: 896, align: 64, elements: !370)
!370 = !{!371, !376, !378, !380, !381, !382, !383, !384, !389, !395, !400, !401, !402, !403}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !369, file: !368, line: 86, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !374, line: 374, baseType: !375)
!374 = !DIFile(filename: "/usr/include/zconf.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !374, line: 365, baseType: !351)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !369, file: !368, line: 87, baseType: !377, size: 32, align: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !374, line: 367, baseType: !348)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !369, file: !368, line: 88, baseType: !379, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !374, line: 368, baseType: !96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !369, file: !368, line: 90, baseType: !372, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !369, file: !368, line: 91, baseType: !377, size: 32, align: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !369, file: !368, line: 92, baseType: !379, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !369, file: !368, line: 94, baseType: !52, size: 64, align: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !368, line: 95, baseType: !385, size: 64, align: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !368, line: 1725, size: 32, align: 32, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !386, file: !368, line: 1725, baseType: !44, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !369, file: !368, line: 97, baseType: !390, size: 64, align: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !368, line: 80, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !394, !377, !377}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !374, line: 383, baseType: !4)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !369, file: !368, line: 98, baseType: !396, size: 64, align: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !368, line: 81, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !394, !394}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !369, file: !368, line: 99, baseType: !394, size: 64, align: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !369, file: !368, line: 101, baseType: !44, size: 32, align: 32, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !369, file: !368, line: 102, baseType: !379, size: 64, align: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !369, file: !368, line: 103, baseType: !379, size: 64, align: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "unused_data", scope: !363, file: !362, line: 44, baseType: !5, size: 64, align: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "unconsumed_tail", scope: !363, file: !362, line: 45, baseType: !5, size: 64, align: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !363, file: !362, line: 46, baseType: !31, size: 8, align: 8, offset: 1152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialised", scope: !363, file: !362, line: 47, baseType: !44, size: 32, align: 32, offset: 1184)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "zdict", scope: !363, file: !362, line: 48, baseType: !5, size: 64, align: 64, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !363, file: !362, line: 50, baseType: !410, size: 64, align: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThread_type_lock", file: !411, line: 5, baseType: !4)
!411 = !DIFile(filename: "./Include/pythread.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!415 = !{!416, !422, !427, !445, !454, !556, !564, !570, !614, !618, !649, !665, !668, !675, !681, !750, !770, !776, !820, !824, !853, !886, !899, !906, !921, !928, !934, !948, !967, !974, !986, !994, !1016, !1024}
!416 = !DISubprogram(name: "PyInit_zlib", scope: !362, file: !362, line: 1353, type: !417, isLocal: false, isDefinition: true, scopeLine: 1354, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_zlib, variables: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{!5}
!419 = !{!420, !421}
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !416, file: !362, line: 1355, type: !5)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ver", scope: !416, file: !362, line: 1355, type: !5)
!422 = !DISubprogram(name: "Comp_dealloc", scope: !362, file: !362, line: 542, type: !423, isLocal: true, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.compobject*)* @Comp_dealloc, variables: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !360}
!425 = !{!426}
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !422, file: !362, line: 542, type: !360)
!427 = !DISubprogram(name: "Dealloc", scope: !362, file: !362, line: 530, type: !423, isLocal: true, isDefinition: true, scopeLine: 531, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.compobject*)* @Dealloc, variables: !428)
!428 = !{!429, !430, !432, !435, !437, !440, !442}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !427, file: !362, line: 530, type: !360)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !431, file: !362, line: 535, type: !5)
!431 = distinct !DILexicalBlock(scope: !427, file: !362, line: 535, column: 8)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !362, line: 535, type: !5)
!433 = distinct !DILexicalBlock(scope: !434, file: !362, line: 535, column: 109)
!434 = distinct !DILexicalBlock(scope: !431, file: !362, line: 535, column: 75)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !436, file: !362, line: 536, type: !5)
!436 = distinct !DILexicalBlock(scope: !427, file: !362, line: 536, column: 8)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !438, file: !362, line: 536, type: !5)
!438 = distinct !DILexicalBlock(scope: !439, file: !362, line: 536, column: 113)
!439 = distinct !DILexicalBlock(scope: !436, file: !362, line: 536, column: 79)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !441, file: !362, line: 537, type: !5)
!441 = distinct !DILexicalBlock(scope: !427, file: !362, line: 537, column: 8)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !362, line: 537, type: !5)
!443 = distinct !DILexicalBlock(scope: !444, file: !362, line: 537, column: 103)
!444 = distinct !DILexicalBlock(scope: !441, file: !362, line: 537, column: 69)
!445 = !DISubprogram(name: "zlib_Compress_compress", scope: !446, file: !446, line: 198, type: !447, isLocal: true, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct._object*)* @zlib_Compress_compress, variables: !449)
!446 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/clinic/zlibmodule.c.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!447 = !DISubroutineType(types: !448)
!448 = !{!5, !360, !5}
!449 = !{!450, !451, !452, !453}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !445, file: !446, line: 198, type: !360)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !445, file: !446, line: 198, type: !5)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !445, file: !446, line: 200, type: !5)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !445, file: !446, line: 201, type: !236)
!454 = !DISubprogram(name: "zlib_Compress_compress_impl", scope: !362, file: !362, line: 572, type: !455, isLocal: true, isDefinition: true, scopeLine: 574, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct.bufferinfo*)* @zlib_Compress_compress_impl, variables: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!5, !360, !235}
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !527, !529, !534, !538, !540, !544, !548, !552}
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !454, file: !362, line: 572, type: !360)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !454, file: !362, line: 572, type: !235)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !454, file: !362, line: 575, type: !44)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inplen", scope: !454, file: !362, line: 576, type: !348)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !454, file: !362, line: 577, type: !348)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_length", scope: !454, file: !362, line: 577, type: !348)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RetVal", scope: !454, file: !362, line: 578, type: !5)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !454, file: !362, line: 579, type: !414)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_total_out", scope: !454, file: !362, line: 580, type: !96)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !468, file: !362, line: 593, type: !469)
!468 = distinct !DILexicalBlock(scope: !454, file: !362, line: 593, column: 5)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !471, line: 139, baseType: !472)
!471 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !471, line: 69, size: 1536, align: 64, elements: !473)
!473 = !{!474, !476, !477, !497, !500, !501, !502, !503, !504, !505, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !472, file: !471, line: 72, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !471, line: 73, baseType: !475, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !472, file: !471, line: 74, baseType: !478, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !471, line: 44, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !471, line: 19, size: 832, align: 64, elements: !481)
!481 = !{!482, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !471, line: 21, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !480, file: !471, line: 22, baseType: !475, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !480, file: !471, line: 24, baseType: !5, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !480, file: !471, line: 25, baseType: !5, size: 64, align: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !480, file: !471, line: 26, baseType: !5, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !480, file: !471, line: 27, baseType: !5, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !480, file: !471, line: 28, baseType: !5, size: 64, align: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !480, file: !471, line: 30, baseType: !5, size: 64, align: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !480, file: !471, line: 31, baseType: !5, size: 64, align: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !480, file: !471, line: 32, baseType: !5, size: 64, align: 64, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !480, file: !471, line: 33, baseType: !44, size: 32, align: 32, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !480, file: !471, line: 34, baseType: !44, size: 32, align: 32, offset: 672)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !480, file: !471, line: 37, baseType: !44, size: 32, align: 32, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !480, file: !471, line: 43, baseType: !5, size: 64, align: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !472, file: !471, line: 76, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !471, line: 50, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !472, file: !471, line: 77, baseType: !44, size: 32, align: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !472, file: !471, line: 78, baseType: !31, size: 8, align: 8, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !472, file: !471, line: 80, baseType: !31, size: 8, align: 8, offset: 296)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !472, file: !471, line: 85, baseType: !44, size: 32, align: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !472, file: !471, line: 86, baseType: !44, size: 32, align: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !472, file: !471, line: 88, baseType: !506, size: 64, align: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !471, line: 54, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!44, !5, !498, !44, !5}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !472, file: !471, line: 89, baseType: !506, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !472, file: !471, line: 90, baseType: !5, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !472, file: !471, line: 91, baseType: !5, size: 64, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !472, file: !471, line: 93, baseType: !5, size: 64, align: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !472, file: !471, line: 94, baseType: !5, size: 64, align: 64, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !472, file: !471, line: 95, baseType: !5, size: 64, align: 64, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !472, file: !471, line: 97, baseType: !5, size: 64, align: 64, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !472, file: !471, line: 98, baseType: !5, size: 64, align: 64, offset: 896)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !472, file: !471, line: 99, baseType: !5, size: 64, align: 64, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !472, file: !471, line: 101, baseType: !5, size: 64, align: 64, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !472, file: !471, line: 103, baseType: !44, size: 32, align: 32, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !472, file: !471, line: 105, baseType: !5, size: 64, align: 64, offset: 1152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !472, file: !471, line: 106, baseType: !17, size: 64, align: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !472, file: !471, line: 108, baseType: !44, size: 32, align: 32, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !472, file: !471, line: 109, baseType: !5, size: 64, align: 64, offset: 1344)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !472, file: !471, line: 134, baseType: !337, size: 64, align: 64, offset: 1408)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !472, file: !471, line: 135, baseType: !4, size: 64, align: 64, offset: 1472)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !528, file: !362, line: 601, type: !469)
!528 = distinct !DILexicalBlock(scope: !454, file: !362, line: 601, column: 5)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !530, file: !362, line: 613, type: !5)
!530 = distinct !DILexicalBlock(scope: !531, file: !362, line: 613, column: 16)
!531 = distinct !DILexicalBlock(scope: !532, file: !362, line: 612, column: 55)
!532 = distinct !DILexicalBlock(scope: !533, file: !362, line: 612, column: 13)
!533 = distinct !DILexicalBlock(scope: !454, file: !362, line: 607, column: 50)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !535, file: !362, line: 613, type: !5)
!535 = distinct !DILexicalBlock(scope: !536, file: !362, line: 613, column: 115)
!536 = distinct !DILexicalBlock(scope: !537, file: !362, line: 613, column: 87)
!537 = distinct !DILexicalBlock(scope: !530, file: !362, line: 613, column: 64)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !539, file: !362, line: 621, type: !469)
!539 = distinct !DILexicalBlock(scope: !533, file: !362, line: 621, column: 9)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !541, file: !362, line: 632, type: !5)
!541 = distinct !DILexicalBlock(scope: !542, file: !362, line: 632, column: 12)
!542 = distinct !DILexicalBlock(scope: !543, file: !362, line: 630, column: 34)
!543 = distinct !DILexicalBlock(scope: !454, file: !362, line: 630, column: 9)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !545, file: !362, line: 632, type: !5)
!545 = distinct !DILexicalBlock(scope: !546, file: !362, line: 632, column: 111)
!546 = distinct !DILexicalBlock(scope: !547, file: !362, line: 632, column: 83)
!547 = distinct !DILexicalBlock(scope: !541, file: !362, line: 632, column: 60)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !549, file: !362, line: 636, type: !5)
!549 = distinct !DILexicalBlock(scope: !550, file: !362, line: 636, column: 12)
!550 = distinct !DILexicalBlock(scope: !551, file: !362, line: 635, column: 78)
!551 = distinct !DILexicalBlock(scope: !454, file: !362, line: 635, column: 9)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !362, line: 636, type: !5)
!553 = distinct !DILexicalBlock(scope: !554, file: !362, line: 636, column: 111)
!554 = distinct !DILexicalBlock(scope: !555, file: !362, line: 636, column: 83)
!555 = distinct !DILexicalBlock(scope: !549, file: !362, line: 636, column: 60)
!556 = !DISubprogram(name: "zlib_error", scope: !362, file: !362, line: 55, type: !557, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.z_stream_s*, i32, i8*)* @zlib_error, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !367, !44, !52}
!559 = !{!560, !561, !562, !563}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "zst", arg: 1, scope: !556, file: !362, line: 55, type: !367)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 2, scope: !556, file: !362, line: 55, type: !44)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 3, scope: !556, file: !362, line: 55, type: !52)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zmsg", scope: !556, file: !362, line: 57, type: !29)
!564 = !DISubprogram(name: "zlib_Compress_flush", scope: !446, file: !446, line: 280, type: !447, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct._object*)* @zlib_Compress_flush, variables: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !564, file: !446, line: 280, type: !360)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !564, file: !446, line: 280, type: !5)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !564, file: !446, line: 282, type: !5)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !564, file: !446, line: 283, type: !44)
!570 = !DISubprogram(name: "zlib_Compress_flush_impl", scope: !362, file: !362, line: 841, type: !571, isLocal: true, isDefinition: true, scopeLine: 843, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, i32)* @zlib_Compress_flush_impl, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!5, !360, !44}
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !583, !585, !590, !594, !596, !602, !606, !610}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !570, file: !362, line: 841, type: !360)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !570, file: !362, line: 841, type: !44)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !570, file: !362, line: 844, type: !44)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !570, file: !362, line: 845, type: !348)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_length", scope: !570, file: !362, line: 845, type: !348)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RetVal", scope: !570, file: !362, line: 846, type: !5)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_total_out", scope: !570, file: !362, line: 847, type: !96)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !582, file: !362, line: 858, type: !469)
!582 = distinct !DILexicalBlock(scope: !570, file: !362, line: 858, column: 5)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !584, file: !362, line: 865, type: !469)
!584 = distinct !DILexicalBlock(scope: !570, file: !362, line: 865, column: 5)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !586, file: !362, line: 877, type: !5)
!586 = distinct !DILexicalBlock(scope: !587, file: !362, line: 877, column: 16)
!587 = distinct !DILexicalBlock(scope: !588, file: !362, line: 876, column: 55)
!588 = distinct !DILexicalBlock(scope: !589, file: !362, line: 876, column: 13)
!589 = distinct !DILexicalBlock(scope: !570, file: !362, line: 871, column: 50)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !591, file: !362, line: 877, type: !5)
!591 = distinct !DILexicalBlock(scope: !592, file: !362, line: 877, column: 115)
!592 = distinct !DILexicalBlock(scope: !593, file: !362, line: 877, column: 87)
!593 = distinct !DILexicalBlock(scope: !586, file: !362, line: 877, column: 64)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !595, file: !362, line: 885, type: !469)
!595 = distinct !DILexicalBlock(scope: !589, file: !362, line: 885, column: 9)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !597, file: !362, line: 897, type: !5)
!597 = distinct !DILexicalBlock(scope: !598, file: !362, line: 897, column: 16)
!598 = distinct !DILexicalBlock(scope: !599, file: !362, line: 895, column: 23)
!599 = distinct !DILexicalBlock(scope: !600, file: !362, line: 895, column: 13)
!600 = distinct !DILexicalBlock(scope: !601, file: !362, line: 893, column: 32)
!601 = distinct !DILexicalBlock(scope: !570, file: !362, line: 893, column: 9)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !362, line: 910, type: !5)
!603 = distinct !DILexicalBlock(scope: !604, file: !362, line: 910, column: 12)
!604 = distinct !DILexicalBlock(scope: !605, file: !362, line: 908, column: 37)
!605 = distinct !DILexicalBlock(scope: !601, file: !362, line: 908, column: 16)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !607, file: !362, line: 916, type: !5)
!607 = distinct !DILexicalBlock(scope: !608, file: !362, line: 916, column: 12)
!608 = distinct !DILexicalBlock(scope: !609, file: !362, line: 915, column: 78)
!609 = distinct !DILexicalBlock(scope: !570, file: !362, line: 915, column: 9)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !362, line: 916, type: !5)
!611 = distinct !DILexicalBlock(scope: !612, file: !362, line: 916, column: 111)
!612 = distinct !DILexicalBlock(scope: !613, file: !362, line: 916, column: 83)
!613 = distinct !DILexicalBlock(scope: !607, file: !362, line: 916, column: 60)
!614 = !DISubprogram(name: "zlib_Compress_copy", scope: !446, file: !446, line: 310, type: !447, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct._object*)* @zlib_Compress_copy, variables: !615)
!615 = !{!616, !617}
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !614, file: !446, line: 310, type: !360)
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_unused_ignored", arg: 2, scope: !614, file: !446, line: 310, type: !5)
!618 = !DISubprogram(name: "zlib_Compress_copy_impl", scope: !362, file: !362, line: 934, type: !619, isLocal: true, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*)* @zlib_Compress_copy_impl, variables: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!5, !360}
!621 = !{!622, !623, !624, !625, !627, !629, !631, !634, !636, !639, !641, !644, !646}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !618, file: !362, line: 934, type: !360)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !618, file: !362, line: 937, type: !360)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !618, file: !362, line: 938, type: !44)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !626, file: !362, line: 946, type: !469)
!626 = distinct !DILexicalBlock(scope: !618, file: !362, line: 946, column: 5)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !628, file: !362, line: 964, type: !5)
!628 = distinct !DILexicalBlock(scope: !618, file: !362, line: 964, column: 8)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !630, file: !362, line: 965, type: !5)
!630 = distinct !DILexicalBlock(scope: !618, file: !362, line: 965, column: 8)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !362, line: 965, type: !5)
!632 = distinct !DILexicalBlock(scope: !633, file: !362, line: 965, column: 111)
!633 = distinct !DILexicalBlock(scope: !630, file: !362, line: 965, column: 77)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !635, file: !362, line: 966, type: !5)
!635 = distinct !DILexicalBlock(scope: !618, file: !362, line: 966, column: 8)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !362, line: 966, type: !5)
!637 = distinct !DILexicalBlock(scope: !638, file: !362, line: 966, column: 115)
!638 = distinct !DILexicalBlock(scope: !635, file: !362, line: 966, column: 81)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !640, file: !362, line: 967, type: !5)
!640 = distinct !DILexicalBlock(scope: !618, file: !362, line: 967, column: 8)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !642, file: !362, line: 967, type: !5)
!642 = distinct !DILexicalBlock(scope: !643, file: !362, line: 967, column: 105)
!643 = distinct !DILexicalBlock(scope: !640, file: !362, line: 967, column: 71)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !645, file: !362, line: 981, type: !5)
!645 = distinct !DILexicalBlock(scope: !618, file: !362, line: 981, column: 8)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !362, line: 981, type: !5)
!647 = distinct !DILexicalBlock(scope: !648, file: !362, line: 981, column: 98)
!648 = distinct !DILexicalBlock(scope: !645, file: !362, line: 981, column: 64)
!649 = !DISubprogram(name: "newcompobject", scope: !362, file: !362, line: 92, type: !650, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct.compobject* (%struct._typeobject*)* @newcompobject, variables: !654)
!650 = !DISubroutineType(types: !651)
!651 = !{!360, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!654 = !{!655, !656, !657, !661}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !649, file: !362, line: 92, type: !652)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !649, file: !362, line: 94, type: !360)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !658, file: !362, line: 103, type: !5)
!658 = distinct !DILexicalBlock(scope: !659, file: !362, line: 103, column: 12)
!659 = distinct !DILexicalBlock(scope: !660, file: !362, line: 102, column: 42)
!660 = distinct !DILexicalBlock(scope: !649, file: !362, line: 102, column: 9)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !362, line: 108, type: !5)
!662 = distinct !DILexicalBlock(scope: !663, file: !362, line: 108, column: 12)
!663 = distinct !DILexicalBlock(scope: !664, file: !362, line: 107, column: 46)
!664 = distinct !DILexicalBlock(scope: !649, file: !362, line: 107, column: 9)
!665 = !DISubprogram(name: "Decomp_dealloc", scope: !362, file: !362, line: 550, type: !423, isLocal: true, isDefinition: true, scopeLine: 551, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.compobject*)* @Decomp_dealloc, variables: !666)
!666 = !{!667}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !665, file: !362, line: 550, type: !360)
!668 = !DISubprogram(name: "zlib_Decompress_decompress", scope: !446, file: !446, line: 241, type: !447, isLocal: true, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct._object*)* @zlib_Decompress_decompress, variables: !669)
!669 = !{!670, !671, !672, !673, !674}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !668, file: !446, line: 241, type: !360)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !668, file: !446, line: 241, type: !5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !668, file: !446, line: 243, type: !5)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !668, file: !446, line: 244, type: !236)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_length", scope: !668, file: !446, line: 245, type: !348)
!675 = !DISubprogram(name: "uint_converter", scope: !362, file: !362, line: 238, type: !265, isLocal: true, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @uint_converter, variables: !676)
!676 = !{!677, !678, !679, !680}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !675, file: !362, line: 238, type: !5)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 2, scope: !675, file: !362, line: 238, type: !4)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !675, file: !362, line: 240, type: !17)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uval", scope: !675, file: !362, line: 241, type: !96)
!681 = !DISubprogram(name: "zlib_Decompress_decompress_impl", scope: !362, file: !362, line: 706, type: !682, isLocal: true, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct.bufferinfo*, i32)* @zlib_Decompress_decompress_impl, variables: !684)
!682 = !DISubroutineType(types: !683)
!683 = !{!5, !360, !235, !348}
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !695, !697, !700, !704, !708, !712, !716, !720, !722, !727, !731, !733, !737, !742, !746}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !681, file: !362, line: 706, type: !360)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !681, file: !362, line: 706, type: !235)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_length", arg: 3, scope: !681, file: !362, line: 706, type: !348)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !681, file: !362, line: 709, type: !44)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_length", scope: !681, file: !362, line: 710, type: !348)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !681, file: !362, line: 710, type: !348)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "RetVal", scope: !681, file: !362, line: 711, type: !5)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_total_out", scope: !681, file: !362, line: 712, type: !96)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !694, file: !362, line: 726, type: !469)
!694 = distinct !DILexicalBlock(scope: !681, file: !362, line: 726, column: 5)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !696, file: !362, line: 734, type: !469)
!696 = distinct !DILexicalBlock(scope: !681, file: !362, line: 734, column: 5)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zdict_buf", scope: !698, file: !362, line: 739, type: !236)
!698 = distinct !DILexicalBlock(scope: !699, file: !362, line: 738, column: 48)
!699 = distinct !DILexicalBlock(scope: !681, file: !362, line: 738, column: 9)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !701, file: !362, line: 741, type: !5)
!701 = distinct !DILexicalBlock(scope: !702, file: !362, line: 741, column: 16)
!702 = distinct !DILexicalBlock(scope: !703, file: !362, line: 740, column: 67)
!703 = distinct !DILexicalBlock(scope: !698, file: !362, line: 740, column: 13)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !705, file: !362, line: 750, type: !5)
!705 = distinct !DILexicalBlock(scope: !706, file: !362, line: 750, column: 16)
!706 = distinct !DILexicalBlock(scope: !707, file: !362, line: 746, column: 59)
!707 = distinct !DILexicalBlock(scope: !698, file: !362, line: 746, column: 13)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !362, line: 750, type: !5)
!709 = distinct !DILexicalBlock(scope: !710, file: !362, line: 750, column: 115)
!710 = distinct !DILexicalBlock(scope: !711, file: !362, line: 750, column: 87)
!711 = distinct !DILexicalBlock(scope: !705, file: !362, line: 750, column: 64)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !713, file: !362, line: 759, type: !5)
!713 = distinct !DILexicalBlock(scope: !714, file: !362, line: 759, column: 16)
!714 = distinct !DILexicalBlock(scope: !715, file: !362, line: 757, column: 23)
!715 = distinct !DILexicalBlock(scope: !698, file: !362, line: 757, column: 13)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !717, file: !362, line: 759, type: !5)
!717 = distinct !DILexicalBlock(scope: !718, file: !362, line: 759, column: 115)
!718 = distinct !DILexicalBlock(scope: !719, file: !362, line: 759, column: 87)
!719 = distinct !DILexicalBlock(scope: !713, file: !362, line: 759, column: 64)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !721, file: !362, line: 763, type: !469)
!721 = distinct !DILexicalBlock(scope: !698, file: !362, line: 763, column: 9)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !723, file: !362, line: 785, type: !5)
!723 = distinct !DILexicalBlock(scope: !724, file: !362, line: 785, column: 16)
!724 = distinct !DILexicalBlock(scope: !725, file: !362, line: 784, column: 51)
!725 = distinct !DILexicalBlock(scope: !726, file: !362, line: 784, column: 13)
!726 = distinct !DILexicalBlock(scope: !681, file: !362, line: 771, column: 50)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !362, line: 785, type: !5)
!728 = distinct !DILexicalBlock(scope: !729, file: !362, line: 785, column: 115)
!729 = distinct !DILexicalBlock(scope: !730, file: !362, line: 785, column: 87)
!730 = distinct !DILexicalBlock(scope: !723, file: !362, line: 785, column: 64)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !732, file: !362, line: 792, type: !469)
!732 = distinct !DILexicalBlock(scope: !726, file: !362, line: 792, column: 9)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !734, file: !362, line: 798, type: !5)
!734 = distinct !DILexicalBlock(scope: !735, file: !362, line: 798, column: 12)
!735 = distinct !DILexicalBlock(scope: !736, file: !362, line: 797, column: 47)
!736 = distinct !DILexicalBlock(scope: !681, file: !362, line: 797, column: 9)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !362, line: 813, type: !5)
!738 = distinct !DILexicalBlock(scope: !739, file: !362, line: 813, column: 12)
!739 = distinct !DILexicalBlock(scope: !740, file: !362, line: 807, column: 41)
!740 = distinct !DILexicalBlock(scope: !741, file: !362, line: 807, column: 16)
!741 = distinct !DILexicalBlock(scope: !681, file: !362, line: 803, column: 9)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !743, file: !362, line: 819, type: !5)
!743 = distinct !DILexicalBlock(scope: !744, file: !362, line: 819, column: 12)
!744 = distinct !DILexicalBlock(scope: !745, file: !362, line: 818, column: 78)
!745 = distinct !DILexicalBlock(scope: !681, file: !362, line: 818, column: 9)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !747, file: !362, line: 819, type: !5)
!747 = distinct !DILexicalBlock(scope: !748, file: !362, line: 819, column: 111)
!748 = distinct !DILexicalBlock(scope: !749, file: !362, line: 819, column: 83)
!749 = distinct !DILexicalBlock(scope: !743, file: !362, line: 819, column: 60)
!750 = !DISubprogram(name: "save_unconsumed_input", scope: !362, file: !362, line: 647, type: !751, isLocal: true, isDefinition: true, scopeLine: 648, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.compobject*, i32)* @save_unconsumed_input, variables: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!44, !360, !44}
!753 = !{!754, !755, !756, !761, !762, !763, !765, !768}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !750, file: !362, line: 647, type: !360)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 2, scope: !750, file: !362, line: 647, type: !44)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_size", scope: !757, file: !362, line: 653, type: !11)
!757 = distinct !DILexicalBlock(scope: !758, file: !362, line: 652, column: 37)
!758 = distinct !DILexicalBlock(scope: !759, file: !362, line: 652, column: 13)
!759 = distinct !DILexicalBlock(scope: !760, file: !362, line: 649, column: 19)
!760 = distinct !DILexicalBlock(scope: !750, file: !362, line: 649, column: 9)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_size", scope: !757, file: !362, line: 654, type: !11)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_data", scope: !757, file: !362, line: 655, type: !5)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !764, file: !362, line: 668, type: !5)
!764 = distinct !DILexicalBlock(scope: !757, file: !362, line: 668, column: 16)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_data", scope: !766, file: !362, line: 677, type: !5)
!766 = distinct !DILexicalBlock(scope: !767, file: !362, line: 673, column: 102)
!767 = distinct !DILexicalBlock(scope: !750, file: !362, line: 673, column: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !362, line: 681, type: !5)
!769 = distinct !DILexicalBlock(scope: !766, file: !362, line: 681, column: 12)
!770 = !DISubprogram(name: "zlib_Decompress_flush", scope: !446, file: !446, line: 363, type: !447, isLocal: true, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct._object*)* @zlib_Decompress_flush, variables: !771)
!771 = !{!772, !773, !774, !775}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !770, file: !446, line: 363, type: !360)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !770, file: !446, line: 363, type: !5)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !770, file: !446, line: 365, type: !5)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !770, file: !446, line: 366, type: !348)
!776 = !DISubprogram(name: "zlib_Decompress_flush_impl", scope: !362, file: !362, line: 1056, type: !777, isLocal: true, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, i32)* @zlib_Decompress_flush_impl, variables: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!5, !360, !348}
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !789, !791, !796, !800, !802, !806, !812, !816}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !776, file: !362, line: 1056, type: !360)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !776, file: !362, line: 1056, type: !348)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !776, file: !362, line: 1059, type: !44)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_length", scope: !776, file: !362, line: 1060, type: !348)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !776, file: !362, line: 1061, type: !5)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_total_out", scope: !776, file: !362, line: 1062, type: !96)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !776, file: !362, line: 1063, type: !11)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !788, file: !362, line: 1074, type: !469)
!788 = distinct !DILexicalBlock(scope: !776, file: !362, line: 1074, column: 5)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !790, file: !362, line: 1086, type: !469)
!790 = distinct !DILexicalBlock(scope: !776, file: !362, line: 1086, column: 5)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !792, file: !362, line: 1098, type: !5)
!792 = distinct !DILexicalBlock(scope: !793, file: !362, line: 1098, column: 16)
!793 = distinct !DILexicalBlock(scope: !794, file: !362, line: 1097, column: 55)
!794 = distinct !DILexicalBlock(scope: !795, file: !362, line: 1097, column: 13)
!795 = distinct !DILexicalBlock(scope: !776, file: !362, line: 1092, column: 67)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !362, line: 1098, type: !5)
!797 = distinct !DILexicalBlock(scope: !798, file: !362, line: 1098, column: 115)
!798 = distinct !DILexicalBlock(scope: !799, file: !362, line: 1098, column: 87)
!799 = distinct !DILexicalBlock(scope: !792, file: !362, line: 1098, column: 64)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !801, file: !362, line: 1105, type: !469)
!801 = distinct !DILexicalBlock(scope: !795, file: !362, line: 1105, column: 9)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !362, line: 1111, type: !5)
!803 = distinct !DILexicalBlock(scope: !804, file: !362, line: 1111, column: 12)
!804 = distinct !DILexicalBlock(scope: !805, file: !362, line: 1110, column: 47)
!805 = distinct !DILexicalBlock(scope: !776, file: !362, line: 1110, column: 9)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !807, file: !362, line: 1123, type: !5)
!807 = distinct !DILexicalBlock(scope: !808, file: !362, line: 1123, column: 16)
!808 = distinct !DILexicalBlock(scope: !809, file: !362, line: 1121, column: 23)
!809 = distinct !DILexicalBlock(scope: !810, file: !362, line: 1121, column: 13)
!810 = distinct !DILexicalBlock(scope: !811, file: !362, line: 1117, column: 19)
!811 = distinct !DILexicalBlock(scope: !776, file: !362, line: 1117, column: 9)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !813, file: !362, line: 1130, type: !5)
!813 = distinct !DILexicalBlock(scope: !814, file: !362, line: 1130, column: 12)
!814 = distinct !DILexicalBlock(scope: !815, file: !362, line: 1129, column: 78)
!815 = distinct !DILexicalBlock(scope: !776, file: !362, line: 1129, column: 9)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !362, line: 1130, type: !5)
!817 = distinct !DILexicalBlock(scope: !818, file: !362, line: 1130, column: 111)
!818 = distinct !DILexicalBlock(scope: !819, file: !362, line: 1130, column: 83)
!819 = distinct !DILexicalBlock(scope: !813, file: !362, line: 1130, column: 60)
!820 = !DISubprogram(name: "zlib_Decompress_copy", scope: !446, file: !446, line: 336, type: !447, isLocal: true, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*, %struct._object*)* @zlib_Decompress_copy, variables: !821)
!821 = !{!822, !823}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !820, file: !446, line: 336, type: !360)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_unused_ignored", arg: 2, scope: !820, file: !446, line: 336, type: !5)
!824 = !DISubprogram(name: "zlib_Decompress_copy_impl", scope: !362, file: !362, line: 992, type: !619, isLocal: true, isDefinition: true, scopeLine: 994, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.compobject*)* @zlib_Decompress_copy_impl, variables: !825)
!825 = !{!826, !827, !828, !829, !831, !833, !835, !838, !840, !843, !845, !848, !850}
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !824, file: !362, line: 992, type: !360)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !824, file: !362, line: 995, type: !360)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !824, file: !362, line: 996, type: !44)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !830, file: !362, line: 1004, type: !469)
!830 = distinct !DILexicalBlock(scope: !824, file: !362, line: 1004, column: 5)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !832, file: !362, line: 1023, type: !5)
!832 = distinct !DILexicalBlock(scope: !824, file: !362, line: 1023, column: 8)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !834, file: !362, line: 1024, type: !5)
!834 = distinct !DILexicalBlock(scope: !824, file: !362, line: 1024, column: 8)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !362, line: 1024, type: !5)
!836 = distinct !DILexicalBlock(scope: !837, file: !362, line: 1024, column: 111)
!837 = distinct !DILexicalBlock(scope: !834, file: !362, line: 1024, column: 77)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !839, file: !362, line: 1025, type: !5)
!839 = distinct !DILexicalBlock(scope: !824, file: !362, line: 1025, column: 8)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !362, line: 1025, type: !5)
!841 = distinct !DILexicalBlock(scope: !842, file: !362, line: 1025, column: 115)
!842 = distinct !DILexicalBlock(scope: !839, file: !362, line: 1025, column: 81)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !844, file: !362, line: 1026, type: !5)
!844 = distinct !DILexicalBlock(scope: !824, file: !362, line: 1026, column: 8)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !846, file: !362, line: 1026, type: !5)
!846 = distinct !DILexicalBlock(scope: !847, file: !362, line: 1026, column: 105)
!847 = distinct !DILexicalBlock(scope: !844, file: !362, line: 1026, column: 71)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !849, file: !362, line: 1040, type: !5)
!849 = distinct !DILexicalBlock(scope: !824, file: !362, line: 1040, column: 8)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !362, line: 1040, type: !5)
!851 = distinct !DILexicalBlock(scope: !852, file: !362, line: 1040, column: 98)
!852 = distinct !DILexicalBlock(scope: !849, file: !362, line: 1040, column: 64)
!853 = !DISubprogram(name: "zlib_adler32", scope: !446, file: !446, line: 396, type: !854, isLocal: true, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*)* @zlib_adler32, variables: !880)
!854 = !DISubroutineType(types: !855)
!855 = !{!5, !856, !5}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !858, line: 57, baseType: !859)
!858 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !858, line: 47, size: 832, align: 64, elements: !860)
!860 = !{!861, !870, !871, !872, !873, !876, !877, !878, !879}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !859, file: !858, line: 48, baseType: !862, size: 320, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !858, line: 38, baseType: !863)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !858, line: 33, size: 320, align: 64, elements: !864)
!864 = !{!865, !866, !868, !869}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !863, file: !858, line: 34, baseType: !6, size: 128, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !863, file: !858, line: 35, baseType: !867, size: 64, align: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !863, file: !858, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !863, file: !858, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !859, file: !858, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !859, file: !858, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !859, file: !858, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !859, file: !858, line: 52, baseType: !874, size: 64, align: 64, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !859, file: !858, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !859, file: !858, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !859, file: !858, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !859, file: !858, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!880 = !{!881, !882, !883, !884, !885}
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !853, file: !446, line: 396, type: !856)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !853, file: !446, line: 396, type: !5)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !853, file: !446, line: 398, type: !5)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !853, file: !446, line: 399, type: !236)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !853, file: !446, line: 400, type: !348)
!886 = !DISubprogram(name: "zlib_adler32_impl", scope: !362, file: !362, line: 1184, type: !887, isLocal: true, isDefinition: true, scopeLine: 1186, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct.bufferinfo*, i32)* @zlib_adler32_impl, variables: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!5, !856, !235, !348}
!889 = !{!890, !891, !892, !893, !896, !897}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !886, file: !362, line: 1184, type: !856)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !886, file: !362, line: 1184, type: !235)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !886, file: !362, line: 1184, type: !348)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !894, file: !362, line: 1190, type: !350)
!894 = distinct !DILexicalBlock(scope: !895, file: !362, line: 1189, column: 29)
!895 = distinct !DILexicalBlock(scope: !886, file: !362, line: 1189, column: 9)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !894, file: !362, line: 1191, type: !11)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !898, file: !362, line: 1193, type: !469)
!898 = distinct !DILexicalBlock(scope: !894, file: !362, line: 1193, column: 9)
!899 = !DISubprogram(name: "zlib_compress", scope: !446, file: !446, line: 23, type: !854, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*)* @zlib_compress, variables: !900)
!900 = !{!901, !902, !903, !904, !905}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !899, file: !446, line: 23, type: !856)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !899, file: !446, line: 23, type: !5)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !899, file: !446, line: 25, type: !5)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !899, file: !446, line: 26, type: !236)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !899, file: !446, line: 27, type: !44)
!906 = !DISubprogram(name: "zlib_compress_impl", scope: !362, file: !362, line: 150, type: !907, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct.bufferinfo*, i32)* @zlib_compress_impl, variables: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!5, !856, !235, !44}
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !906, file: !362, line: 150, type: !856)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 2, scope: !906, file: !362, line: 150, type: !235)
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 3, scope: !906, file: !362, line: 150, type: !44)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ReturnVal", scope: !906, file: !362, line: 153, type: !5)
